{"title":"Robotics Q&A with Boston Dynamics’ Aaron Saunders","context":"## Robotics Q&A with Boston Dynamics’ Aaron Saunders\n\nFor the next few weeks, TechCrunch’s robotics newsletter Actuator will be running Q&As with some of the top minds in robotics. Subscribe here for future updates.\nPart 1: CMU’s Matthew Johnson-Roberson\nPart 2: Toyota Research Institute’s Max Bajracharya and Russ Tedrake\nPart 3: Meta’s Dhruv Batra\nThis time it’s Boston Dynamics CTO, Aaron Saunders. He has been with the company for more than 20 years, most recently serving as its vice president of Engineering.\nWhat role(s) will generative AI play in the future of robotics?\nThe current rate of change makes it hard to predict very far into the future. Foundation models represent a major shift in how the best machine learning models are created, and we are already seeing some impressive near-term accelerations in natural language interfaces. They offer opportunities to create conversational interfaces to our robots, improve the quality of existing computer vision functions and potentially enable new customer-facing capabilities such as visual question answering. Ultimately we feel these more scalable architectures and training strategies are likely to extend past language and vision into robotic planning and control. Being able to interpret the world around a robot will lead to a much richer understanding on how to interact with it. It’s a really exciting time to be a roboticist!\nWhat are your thoughts on the humanoid form factor?\nHumanoids aren’t necessarily the best form factor for all tasks. Take Stretch, for example — we originally generated interest in a box-moving robot from a video we shared of Atlas moving boxes. Just because humans can move boxes doesn’t mean we’re the best form factor to complete that task, and we ultimately designed a custom robot in Stretch that can move boxes more efficiently and effectively than a human. With that said, we see great potential in the long-term pursuit of general-purpose robotics, and the humanoid form factor is the most obvious match to a world built around our form. We have always been excited about the potential of humanoids and are working hard to close the technology gap.\nFollowing manufacturing and warehouses, what is the next major category for robotics?\nThose two industries still stand out when you look at matching up customer needs with the state of art in technology. As we fan out, I think we will move slowly from environments that have determinism to those with higher levels of uncertainty. Once we see broad adoption in automation-friendly industries like manufacturing and logistics, the next wave probably happens in areas like construction and healthcare. Sectors like these are compelling opportunities because they have large workforces and high demand for skilled labor, but the supply is not meeting the need. Combine that with the work environments, which sit between the highly structured industrial setting and the totally unstructured consumer market, and it could represent a natural next step along the path to general purpose.\nHow far out are true general-purpose robots?\nThere are many hard problems standing between today and truly general-purpose robots. Purpose-built robots have become a commodity in the industrial automation world, but we are just now seeing the emergence of multi-purpose robots. To be truly general purpose, robots will need to navigate unstructured environments and tackle problems they have not encountered. They will need to do this in a way that builds trust and delights the user. And they will have to deliver this value at a competitive price point. The good news is that we are seeing an exciting increase in critical mass and interest in the field. Our children are exposed to robotics early, and recent graduates are helping us drive a massive acceleration of technology. Today’s challenge of delivering value to industrial customers is paving the way toward tomorrow’s consumer opportunity and the general purpose future we all dream of.\nWill home robots (beyond vacuums) take off in the next decade?\nWe may see additional introduction of robots into the home in the next decade, but for very limited and specific tasks (like Roomba, we will find other clear value cases in our daily lives). We’re still more than a decade away from multifunctional in-home robots that deliver value to the broad consumer market. When would you pay as much for a robot as you would a car? When it achieves the same level of dependability and value you have come to take for granted in the amazing machines we use to transport us around the world.\nWhat important robotics story\/trend isn’t getting enough coverage?\nThere is a lot of enthusiasm around AI and its potential to change all industries, including robotics. Although it has a clear role and may unlock domains that have been relatively static for decades, there is a lot more to a good robotic product than 1’s and 0’s. For AI to achieve the physical embodiment we need to interact with the world around us, we need to track progress in key technologies like computers, perception sensors, power sources and all the other bits that make up a full robotic system. The recent pivot in automotive towards electrification and Advanced Driver Assistance Systems (ADAS) is quickly transforming a massive supply chain. Progress in graphics cards, computers and increasingly sophisticated AI-enabled consumer electronics continues to drive value into adjacent supply chains. This massive snowball of technology, rarely in the spotlight, is one of the most exciting trends in robotics because it enables small innovative companies to stand on the backs of giants to create new and exciting products.\n\nThis article, authored by Brian Heater, was published by TechCrunch on 2023-12-09 under the category 'technology'.\n\n","id":420}
{"title":"Robot startups see huge market in replacing human workers: 'We can sell millions of humanoids, billions maybe'","context":"## Robot startups see huge market in replacing human workers: 'We can sell millions of humanoids, billions maybe'\n\nBuilding a robot that’s both human-like and useful is a decades-old engineering dream inspired by popular science fiction.\nWhile the latest artificial intelligence craze has sparked another wave of investments in the quest to build a humanoid, most of the current prototypes are clumsy and impractical, looking better in staged performances than in real life. That hasn’t stopped a handful of startups from keeping at it.\n“The intention is not to start from the beginning and say, ‘Hey, we’re trying to make a robot look like a person,’” said Jonathan Hurst, co-founder and chief robot officer at Agility Robotics. “We’re trying to make robots that can operate in human spaces.”\nDo we even need humanoids? Hurst makes a point of describing Agility’s warehouse robot Digit as human-centric, not humanoid, a distinction meant to emphasize what it does over what it’s trying to be.\nWhat it does, for now, is pick up tote bins and move them. Amazon announced in October it will begin testing Digits for use in its warehouses, and Agility opened an Oregon factory in September to mass produce them.\nDigit has a head containing cameras, other sensors and animated eyes, and a torso that essentially works as its engine. It has two arms and two legs, but its legs are more bird-like than human, with an inverted knees appearance that resembles so-called digitigrade animals such as birds, cats and dogs that walk on their toes rather than on flat feet.\nRival robot-makers, like Figure AI, are taking a more purist approach on the idea that only true humanoids can effectively navigate workplaces, homes and a society built for humans. Figure also plans to start with a relatively simple use case, such as in a retail warehouse, but aims for a commercial robot that can be “iterated on like an iPhone” to perform multiple tasks to take up the work of humans as birth rates decline around the world.\n“There’s not enough people doing these jobs, so the market’s massive,” said Figure AI CEO Brett Adcock. “If we can just get humanoids to do work that humans are not wanting to do because there’s a shortfall of humans, we can sell millions of humanoids, billions maybe.”\nAt the moment, however, Adcock’s firm doesn’t have a prototype that’s ready for market. Founded just over a year ago and after having raised tens of millions of dollars, it recently revealed a 38-second video of Figure walking through its test facility in Sunnyvale, California.\nTesla CEO Elon Musk is also trying to build a humanoid, called Optimus, through the electric car-maker’s robotics division, but a hyped-up live demonstration last year of the robot’s awkwardly halting steps didn’t impress experts in the robotics field. Seemingly farther along is Tesla’s Austin, Texas-based neighbor Apptronik, which unveiled its Apollo humanoid in an August video demonstration.\nAll the attention — and money — poured into making ungainly humanoid machines might make the whole enterprise seem like a futile hobby for wealthy technologists, but for some pioneers of legged robots it’s all about what you learn along the way.\n“Not only about their design and operation, but also about how people respond to them, and about the critical underlying technologies for mobility, dexterity, perception and intelligence,” said Marc Raibert, the co-founder of Boston Dynamics, best known for its dog-like robots named Spot.\nRaibert said sometimes the path of development is not along a straight line. Boston Dynamics, now a subsidiary of carmaker Hyundai, experimented with building a humanoid that could handle boxes.\n“That led to development of a new robot that was not really a humanoid, but had several characteristics of a humanoid,” he said via an emailed message. “But the changes resulted in a new robot that could handle boxes faster, could work longer hours, and could operate in tight spaces, such as a truck. So humanoid research led to a useful non-humanoid robot.”\nSome startups aiming for human-like machines focused on improving the dexterity of robotic fingers before trying to get their robots to walk.\nWalking is “not the hardest problem to solve in humanoid robotics,” said Geordie Rose, co-founder and CEO of British Columbia, Canada-based startup Sanctuary AI. “The hardest problem is the problem of understanding the world and being able to manipulate it with your hands.”\nSanctuary’s newest and first bipedal robot, Phoenix, can stock shelves, unload delivery vehicles and operate a checkout, early steps toward what Rose sees as a much longer-term goal of getting robots to perceive the physical world to be able to reason about it in a way that resembles intelligence. Like other humanoids, it’s meant to look endearing, because how it interacts with real people is a big part of its function.\n“We want to be able to provide labor to the world, not just for one thing, but for everybody who needs it,” Rose said. “The systems have to be able to think like people. So we could call that artificial general intelligence if you’d like. But what I mean more specifically is the systems have to be able to understand speech and they need to be able to convert the understanding of speech into action, which will satisfy job roles across the entire economy.”\nAgility’s Digit robot caught Amazon’s attention because it can walk and also move around in a way that could complement the e-commerce giant’s existing fleet of vehicle-like robots that move large carts around its vast warehouses.\n“The mobility aspect is more interesting than the actual form,” said Tye Brady, Amazon’s chief technologist for robotics, after the company showed it off at a media event in Seattle.\nRight now, Digit is being tested to help with the repetitive task of picking up and moving empty totes. But just having it there is bound to resurrect some fears about robots taking people’s jobs, a narrative Amazon is trying to prevent from taking hold.\nAgility Robotics co-founder and CEO Damion Shelton said the warehouse robot is “just the first use case” of a new generation of robots he hopes will be embraced rather than feared as they prepare to enter businesses and homes.\n“So in 10, 20 years, you’re going to see these robots everywhere,” Shelton said. “Forever more, human- centric robots like that are going to be part of human life. So that’s pretty exciting.”\n—-\nAP writer Haleluya Hadero contributed to this report.\n\nThis article, authored by Matt O'Brien, The Associated Press, was published by Fortune on 2023-11-05 under the category 'business'.\n\n","id":421}
{"title":"MLB free agency tracker: Live updates on news, rumors, signings and trades after 2023 Winter Meetings","context":"## MLB free agency tracker: Live updates on news, rumors, signings and trades after 2023 Winter Meetings\n\nShohei Ohtani and Juan Soto have already found new homes, but much of the MLB offseason has yet to play out.\nJapanese pitcher Yoshinobu Yamamoto is the focus of many teams as he prepares to sign a massive deal, while Blake Snell, Cody Bellinger and Jordan Montgomery remain on the market. The trade market is also expected to be active once more dominoes fall, with Dylan Cease, Corbin Burnes and Tyler Glasnow among starters who could be moved this winter.\nThe Winter Meetings are over, but because of the timeline of major decisions by Ohtani and Yamamoto, there could be a flurry of activity leading up to the end of the year.\nMORE: Why Shohei Ohtani signed with Dodgers over Blue Jays, other suitors\nSporting News is tracking the rumors, signings and trades as MLB free agency continues. Follow along below for the latest news.\nMLB free agency tracker, live updates\nPadres ink five-year deal with NPB star Matsui\nDate: Saturday, Dec. 23\nSource: ESPN's Jeff Passan\nAnother Japanese star is headed to the Sunshine State. Star reliever Yuki Matsui inked a five-year, $28 million deal to join the Friars on Saturday. Matsui was one of NPB's best arms out the pen, starring for Tohoku Rakuten Golden Eagles for nearly a decade. He tallied up 236 saves over the course of his career, posting a 2.40 ERA in 659.2 innings of work. The contract features opt-out clauses in Years 4 and 5, offering San Diego an out if Matsui deals with elbow trouble.\nDodgers sign Yamamoto to $325 million contract\nDate: Tuesday, Dec. 19\nSource: ESPN's Jeff Passan, YES Network's Jack Curry\nThe Yamamoto sweepstakes are over, as the Dodgers have reportedly signed the Japanese ace to a 12-year, $325 million. It's the largest MLB deal for a pitcher, surpassing Gerrit Cole's deal with the Yankees by $1 million. Los Angeles' incredible offseason continues, as Yamamoto joins Shohei Ohtani on the defending NL West champs.\nGiants out of Yamamoto sweepstakes\nDate: Thursday, Dec. 21\nSource: Alex Pavlovic, NBC Sports Bay Area\nThe Giants made a hard push to land Yamamoto, but according to NBC Sports Bay Area's Alex Pavlovic, San Francisco has been notified that the team is out of the bidding to land the Japanese ace. Pavlovic added that it is very likely that Yamamoto ends up either in Los Angeles with the Dodgers, or New York with the Mets or Yankees.\nYamamoto met with Giants, won't decide on team until after Christmas\nDate: Tuesday, Dec. 19\nSource: Andrew Baggarly, The Athletic and Bob Klapisch, Newark Star-Ledger\nSan Francisco has been among the teams most heavily believed to be in on Yamamoto, and according to The Athletic's Andrew Baggarly, the team met with him in San Francisco last week. Baggarly reported the Giants have been willing to \"blow teams out of the water\" to land Yamamoto, but noted he believes the crowded picture for the Japanese ace could make it more challenging for the Giants to be the winner of the Yamamoto sweepstakes.\nAnd fans will have to wait a bit longer before hearing a final resolution on his decision. The Newark Star-Ledger's Bob Klapisch reported Yamamoto isn't expected to make a decision until after Christmas, and that it could run until around Jan. 1-4.\nPirates re-sign franchise legend Andrew McCutchen\nDate: Tuesday, Dec. 19\nSource: Jason Mackey, Pittsburgh Post-Gazette\nThe Pirates have been making a few veteran free-agent signings to bolster the rotation. Now, they're bringing back a franchise icon. Pittsburgh has reportedly inked Andrew McCutchen to a one-year, $5 million.\nMcCutchen enjoyed a solid return to Pittsburgh in 2023, slashing .256\/.378\/.397 with 12 home runs in 112 games. It was his first season in Pittsburgh since 2017.\nAngels discussing Blake Snell\nDate: Tuesday, Dec. 19\nSource: Jon Morosi, MLB Network\nThe Angels came up empty on bringing back Ohtani. Now, they're looking to land another splashy name on the free-agent market. MLB Network's Jon Morosi reported Los Angeles has had discussions with two-time Cy Young winner Blake Snell.\nPer Morosi, the Angels are not believed to be a strong contender for Yamamoto, thus allowing them to put more of an effort on landing Snell rather than waiting for Yamamoto to make a decision.\nCody Bellinger looking for package starting at $200 million\nDate: Tuesday, Dec. 18\nSource: Jesse Rogers, ESPN\nWith Ohtani signed to Los Angeles, Bellinger remains the top free-agent bat on the market. And he is clearly looking for a top-of-the-market contract. Rogers reported sources indicate Bellinger's agent, Scott Boras, is seeking a deal worth well over $200 million for Bellinger, with one source saying he is \"not budging.\"\nRogers went on to note that some believe the Cubs won't be a team willing to pay a player that type of money until he's 40 years old, while a team like the Blue Jays might given their desperation to round out the roster.\nPadres closing in on contract for Yuki Matsui\nDate: Tuesday, Dec. 18\nSource: Yuki Yamada, Sankei Sports\nThe Padres are nearing a deal for one of the top Japanese pitchers on the market. Per Sankei Sports' Yuki Yamada, the Padres are \"close to signing\" Rakuten Golden Eagles' reliever Yuki Matsui to a deal. In 10 years in Nippon Professional Baseball, Matsui has a 2.40 ERA across 659.2 innings of work. In 2023, he posted a 1.57 ERA in 57.1 innings and racked up 39 saves for the Golden Eagles.\nGiants ink catcher Tom Murphy to two-year contract\nDate: Monday, Dec. 18\nSource: Ken Rosenthal, The Athletic\nThe Giants are adding some catching depth. The Athletic's Ken Rosenthal reported San Francisco has agreed to a two-year, $8 million contract with the Giants. Murphy appeared in only 47 games for the Mariners in 2023, but had a standout year at the plate, slashing .290\/.335\/.538 with eight home runs. He joins a catching room that also features breakout 2023 rookie Patrick Bailey and Joey Bart. Bart is out of minor-league options, and could be on the outside-looking-in to a 2024 Opening Day roster spot if the Giants decide to have only two catchers on the active roster.\nPirates add to rotation, sign Martin Perez\nDate: Monday, Dec. 18\nSource: Jason Mackey, Pittsburgh Post-Gazette\nPittsburgh continues to add to its rotation this offseason. The Pirates have reportedly agreed to a one-year, $8 million deal with former Ranger starter Martin Perez. He was used as a swing man in 2023, making 20 starts and 35 total appearances, pitching to a 4.45 ERA with 93 strikeouts and 49 walks in 141.2 innings en route to winning a WorldSeries ring. The Pirates also added another left-hander who pitched in 2023 for an AL West team in Marco Gonzales, though he had an offseason stop in Atlanta in the middle.\nBidding for Yamamoto begins Monday\nDate: Monday, Dec. 18\nSource: Jeff Passan, ESPN\nThere has been plenty of speculation about offers sent over to Yamamoto to this point, but Passan reports he has yet to receiver any formal offers. However, that will start to change on Monday, with the bidding slated to begin.\nBraves cut Matt Carpenter after trying to trade him\nDate: Monday, Dec. 18\nSource: Robert Murray, FanSided\nAtlanta reportedly was hoping to trade Matt Carpenter after acquiring him in a deal earlier this offseason from the Padres. The team acquired him and took on $4 million along with trading for Ray Kerr, but was looking to deal away his contract to someone else, according to The Athletic's Ken Rosenthal.\nTwins could trade Max Kepler, Jorge Polance\nDate: Sunday, Dec. 17\nSource: Jon Morosi, MLB Network\nThe Twins are coming off an AL Central title, but could be looking to deal away two of their key players form the team. Max Kepler and Jorge Polanco could both reportedly be on the trade market, per MLB Network's Jon Morosi, though their market could hinge on the status of other infield free agents.\nKepler appeared in 130 games for the Twins, and posted an impressive .260\/.332\/.484 slash line with 24 homers for Minnesota. Polanco was moved to an infield utility role with Edouard Julien and Royce Lewis emerging into regulars, but was still solid in 80 games, logging a .255\/.335\/.454 slash with 14 homers.\nYamamoto requests meeting with Yankees\nDate: Sunday, Dec. 17\nSource: Jon Heyman, New York Post\nYamamoto has been making the rounds with MLB teams, and per Heyman, he reportedly asked to meet with the Yankees for a second time. The meeting with New York comes a day after he met with the Mets at team owner Steve Cohen's Connecticut home.\nLourdes Gurriel Jr. re-signs with Diamondbacks\nDate: Sunday, Dec. 17\nSource: Ken Rosenthal, The Athletic and ESPN's Jeff Passan\nThe Diamondbacks acquired Lourdes Gurriel Jr. last offseason in a trade involving Daulton Varsho and Gabriel Moreno. And after helping Arizona get to the World Series, Gurriel is ready to come back to Arizona. The Athletic's Ken Rosenthal reported Gurriel has re-signed a contract with the Diamondbacks.\nAccording to ESPN's Jeff Passan, the deal is for $42 million over three years with a club option for a fourth year and an opt out after his second season with the club.\nYamamoto dines with Mets owner\nDate: Sunday, Dec. 17\nSource: Joel Sherman, New York Post\nThe Mets continued their strong push for the top free agent available, Yoshinobu Yamamoto, by hosting the Japanese pitcher for dinner Saturday night at team owner Steve Cohen's Connecticut home. Cohen and other top Mets officials previously flew to Japan to meet with Yamamoto on his home turf, so this is at least the second time the key players have met face-to-face.\nSherman reports the bidding process for the 25-year-old \"is supposed to intensify this week,\" with the Yankees, Dodgers, Giants, Red Sox, Phillies and Blue Jays also in the mix.\nRoyals sign pair of veterans\nDate: Friday, Dec. 15\nSource: MLB.com's Anne Rogers\nThe Royals continue to splurge in the offseason. Per MLB.com's Anne Rogers, Kansas City signed outfielder Hunter Renfroe to a one-year, $5.5 million deal with a player option for 2025 worth $7.5 million, as well as right-hander Michael Wacha to a two-year, $32 million deal with an opt-out after 2024.\nThe moves are the latest for the Royals, who already signed Seth Lugo, Will Smith and Garrett Hampson this offseason. The total commitments are now up to $82 million.\nTyler Glansow inks extension with Dodgers\nDate: Friday, Dec. 15\nSource: ESPN's Jeff Passan\nThe only question mark left in the Glasnow trade was the figures on the extension he'd wind up signing with the Dodgers. Now, the numbers are in, and the deal is set to be completed.\nPer Passan, Glasnow will be signing a five-year, $135 million deal with the Dodgers. Passan reported the deal begins in 2024, and could reach up to $145 million if the Dodgers pick up a $30 million option at the end of the contract. He also reported that unlike Ohtani's deal, there will be no deferred money.\nTyler Glasnow traded to Dodgers from Rays\nDate: Thursday, Dec. 14\nSource: ESPN's Jeff Passan\nAs had been reported for a few days, the deal between the Dodgers and Rays for Tyler Glasnow is coming to fruition. Los Angeles has reportedly acquired the right-handed starting pitcher, along with outfielder Manuel Margot, for RHP Ryan Pepiot and OF Jonny Deluca.\nGlasnow is expected to sign a contract extension with the Dodgers as a result of the trade. The 30-year-old is in the final year of a two-year deal he sinked with the Rays in 2023, and was set to be free agent in 2025.\nJack Flaherty signs with Tigers\nDate: Thursday, Dec. 14\nSource:ESPN's Jeff Passan\nJack Flaherty has a new home. The right hander is signing a one-year, $14 million deal with the Tigers, according to Passan.\nAfter undergoing shoulder surgery in 2022, Flaherty was traded from the Cardinals to the Orioles last year at the 2023 deadline. In total, he made 27 starts last year, posting a 4.99 ERA with 148 strikeouts in 144.1 innings.\nYoshinobu Yamamoto meets with Phillies\nDate: Thursday, Dec. 14\nSource: Jon Heyman, New York Post\nThe Phillies have not been one of the more frequent names connected to Yamamoto, however the Japanese free agent reportedly met with the team. The starting pitcher has met with a number of teams, including the Dodgers, Mets, Yankees and Red Sox.\nPhiladelphia re-signed ace Aaron Nola this offseason, bringing back the powerful duo of Nola and Zack Wheeler. Adding Yamamoto would immediately give the Phillies' one of the best rotations in baseball.\nCubs, Blue Jays the favorites for Cody Bellinger\nDate: Wednesday, Dec. 13\nSource: Jon Heyman, New York Post\nThe Blue Jays and Cubs were believed to be among the favorites to land Ohtani. But with the star two-way talent off to Los Angeles, the two are now believed to be the favorites to land Cody Bellinger, according to Heyman.\nBellinger would be returning to the Cubs, the team with which he rebuilt his value after a down year with the Dodgers. If he signed with the Blue Jays, he'd be bringing the powerful left-handed bat the team sought when it pursued Ohtani.\nDodgers send stars to meet with Yamamoto\nDate: Wednesday, Dec. 13\nSource: Fabian Ardaya, The Athletic\nThe Dodgers added one Japanese star this offseason. They're now looking to add another. Los Angeles reportedly sent Ohtani, Mookie Betts, Freddie Freeman and Will Smith to meet with Yamamoto, trying to convince the standout starting pitcher to join the National League superpower.\nSigning Yamamoto would be a major boost for the Dodgers, who still have a need at starting pitcher.\nRays-Dodgers working on a Tyler Glasnow trade\nDate: Wednesday, Dec. 13\nSource: Ken Rosenthal, The Athletic\nThe Rays and Dodgers are reportedly working on a trade that would send starting pitcher Tyler Glasnow to L.A. Rosenthal reports that the proposed deal would also include OF Manny Margot going to the Dodgers, while the Rays would receive RHP Ryan Pepiot and OF Jonny Deluca.\nRosenthal clarified that the deal is not complete and changes are possible, but the base of the deal is Glasnow to the Dodgers.\nRowdy Tellez inks one-year deal with Pirates\nDate: Tuesday, Dec. 12\nSource: Robert Murray, FanSided\nThe Pirates have agreed to a one-year, $3.2 million contract with Rowdy Tellez. The deal includes an additional $800,000 in incentives.\nTellez hit 35 home runs as a centerpiece of the Brewers' lineup in 2022, but he took a significant step back in 2023 after starting the season on a roll. Between first base and the DH role, however, the Pirates figure to give Tellez near-everyday playing time in hopes his power bat finds its form.\nGiants, Jung-Hoo Lee agree to six-year deal\nDate: Tuesday, Dec. 12\nSource: Jon Heyman, New York Post\nThe Giants have struggled to land big-name free agents over the last two offseasons, but they reeled in a pretty significant fish on Tuesday by inking Korean outfielder Jung-Hoo Lee to a six-year, $113M contract. Lee can opt out after 2027.\nLee is just 25 and was an on-base machine in Korea, batting .340 in his KBO career. While his power was inconsistent between seasons, Lee was a sought-after bat in free agency and drew heavy interest from the Padres as well.\nDodgers meeting with Yamamoto on Tuesday\nDate: Tuesday, Dec. 12\nSource: Russell Dorsey, Bally Sports\nBally Sports' Russell Dorsey reports the Dodgers met with Yoshinobu Yamamoto on Tuesday, extending Yamamoto's free agent four.\nYamamoto has already met with four teams and still plans to meet with the Red Sox and Blue Jays in the coming days.\nRoyals finalizing deal with SP Seth Lugo\nDate: Tuesday, Dec. 12\nSource: Anne Rogers, MLB.com\nThe Royals and starter Seth Lugo are finalizing a 3-year, $45 million contract, according to MLB.com's Anne Rogers.\nThe Padres stretched Lugo back into a full-time starter in 2023, and the 34-year-old posted a 3.57 ERA across 146.1 innings. Kansas City can use plenty of rotation help after a dismal 2023 season, so Lugo figures to be one of the Royals' top arms in 2024 and perhaps beyond.\nYamamoto to meet with Red Sox, Blue Jays\nDate: Tuesday, Dec. 12\nSource: Mark Feinsand, MLB.com\nMLB.com's Mark Feinsand reports Japanese ace Yoshinobu Yamamoto will meet with both the Red Sox and Blue Jays in the coming days.\nYamamoto has already met with the Mets, Giants and Yankees, with the Dodgers also believed to be involved in the bidding. With both meetings still upcoming, the report is an indication the Yamamoto sweepstakes aren't on the verge of a conclusion.\nMORE: Ranking the best fits for Japanese star Yoshinobu Yamamoto\nDodgers formally announce Ohtani signing\nDate: Monday, Dec. 11\nSource: Los Angeles Dodgers\nThe Dodgers have officially announced their signing of Ohtani, calling him a \"once-in-a-generation talent and one of the most exciting professional athletes in the world.\"\n\"Dodger fans, thank you for welcoming me to your team. I can say 100 percent that you, the Dodger organization and I share the same goal - to bring World Series parades to the streets of Los Angeles,\" Ohtani said in a statement.\nThe Los Angeles Dodgers have signed two-time American League Most Valuable Player Shohei Ohtani to a 10-year contract. pic.twitter.com\/mggYwgp01i — Los Angeles Dodgers (@Dodgers) December 12, 2023\nOhtani to defer $680 million of $700 million Dodgers deal\nDate: Monday, Dec. 11\nSource: Fabian Ardaya, The Athletic\nAccording to The Athletic, Ohtani will defer a whopping $680 million of his $700 million contract from the Dodgers, receiving only $2 million per year.\nWhile it's important to note the deal will still count as $46 million annually toward the luxury tax thresholds for Los Angeles, Ohtani is still giving the organization much more flexibility than expected over the course of the deal.\nThe two-time MVP will receive $68 million per year, without interest, from 2034-43, making the present-day value of the contract much less than it originally appeared.\nMORE: Complete breakdown of Shohei Ohtani's Dodgers contract, by the minute\nGiants reportedly meet with Yamamoto\nDate: Monday, Dec. 11\nSource: Buster Olney, ESPN\nESPN's Buster Olney reports the Giants met with Japanese ace Yoshinobu Yamamoto on Sunday, Dec. 10.\nYamamoto is the biggest fish on the free-agent market right now, and he's being pursued by a handful of big-market teams including the Yankees and Dodgers. The Giants have missed out on some of the most prominent free agents over the last two offseasons, so there might be incentive to make Yamamoto a massive offer to try and stay relevant in the NL West after the Dodgers' Ohtani signing.\nMORE: What to know about Japanese ace Yoshinobu Yamamoto as he moves to MLB\nRoyals agree to 1-year deal with reliever Will Smith\nDate: Sunday, Dec. 10\nSource: Jeff Passan, ESPN\nThe Royals have agreed to a 1-year, $5 million contract with reliever Will Smith, who spent this past season with the Rangers.\nSmith has won the World Series in each of the last three seasons, but Kansas City's expectations in 2024 don't quite extend to a championship. Instead, the Royals will hope the veteran Smith, who had solid underlying numbers in 2023, can serve as a reliable late-inning arm after both Scott Barlow and Aroldis Chapman were traded before the deadline this past season.\nShohei Ohtani agrees to mega contract with Dodgers\nDate: Saturday, Dec. 9\nSource: Shohei Ohtani, Jeff Passan\nTwo-time MVP Shohei Ohtani announced on Instagram that he is signing with the Los Angeles Dodgers, spurning the Blue Jays and remaining in the city where he became a sensation with the Angels.\nESPN's Jeff Passan reports Ohtani has agreed to a colossal 10-year, $700 million contract shattering the MLB record for both total value and average annual value.\nOhtani joins a Dodgers lineup that already features two former MVPs in Mookie Betts and Freddie Freeman, both of whom were NL MVP finalists in 2023. While he won't pitch again until 2025, Ohtani's power and on-base ability gives Los Angeles the most dangerous trio of hitters in the sport.\nMORE: How Dodgers' 2024 payroll looks after handing out monster deal to Shohei Ohtani\nRed Sox swing deal for Cardinals' Tyler O'Neill\nDate: Friday, Dec. 8\nSource: Jon Heyman, New York Post\nDays after trading Alex Verdugo to the Yankees, the Red Sox have acquired OF Tyler O'Neill from the Cardinals in a deal that sends pitching prospects Nick Robertson and Victor Santos to St. Louis.\nO'Neill enjoyed a breakthrough 2021 season with the Cardinals, batting .286 with 34 home runs and a .912 OPS, but he's struggled to recapture that level of production over the last two seasons and is set to be a free agent after 2024.\n\nThis article, authored by Dan Treacy, was published by Sporting News on 2023-12-23 under the category 'sports'.\n\n","id":422}
{"title":"Unraveling Potential Reasons Why the Dodgers May Not Pursue Shohei Ohtani and Mike Trout in Free Agency Despite Their Availability","context":"## Unraveling Potential Reasons Why the Dodgers May Not Pursue Shohei Ohtani and Mike Trout in Free Agency Despite Their Availability\n\nThe Los Angeles Angels have gone through a tough year. After a heartbreaking 2023 season, they now have to cope with the impending exit of their star two-way star, Shohei Ohtani. The team is also open to trading their nine-time Silver Slugger hitter Mike Trout, should he request it. In a huge miss, a team that couldn’t do well even with two of the league’s biggest talents on their roster may lose said stars at the same time. Will they choose to stay in LA?\nAmerica’s Favorite Video Today\nThe Halos’ cross-town rivals, the Los Angeles Dodgers, have been eyeing the dynamic Troutani duo for a long time. However, despite fans’ expectations, the Dodgers’ Ohtani-Trout conquest might not take place—and for good reasons.\nDo the Dodgers have the budget to afford Ohtani and Trout on the same roster?\nADVERTISEMENT Article continues below this ad\nShohei Ohtani’s next projected contract value is predicted to be around $500–$600 million. If it goes through, he will break Trout’s biggest MLB deal record of 12 years, $426.5 million. Now, we all know that the Dodgers have deep pockets; they have managed to maintain quite a costly lineup this season valued at $283 million. But can they afford two of baseball’s biggest superstars at full value?\nNow, with Trout’s $426.5 million tagline, the slugger has an annual salary of about $35.45 million. He still has seven years left on his Angels contract, so get him in blue, the Dodgers will have to pay $248.15 million plus any extension value. Shohei Ohtani’s predicted $535 million for 11 years (according to a Sports Illustrated segment) will bring the Dodgers down to pay him a good $48.63 million annually.\nThe Dodgers already have six players whom they have to pay above $10 million a year: Freddie Freeman ($27 million), Mookie Betts ($25 million), Clayton Kershaw ($20 million), Chris Taylor ($15 million), Max Muncy ($13.5 million), and J.D. Martinez ($10 million). Among the top-paid players, Clayton Kershaw is exiting the team this season. That, along with a few other player offloads, will free up enough space in the Dodgers payroll to support two $25 million or three $10 million p\/a players on their team. Neither Trout nor Ohtani falls within that price range, so keeping both together at the same time would not be a feasible option for the Dodgers right now.\nPitchers or Hitters? Who Will the Dodgers Prioritize This Free Agency?\nThe Dodgers have been in dire need of pitchers for a few seasons. Their current highest strikeout rate by a pitcher in a single postseason is 137 SOs by Clayton Kershaw, followed by 119 SOs by Bobby Miller and 117 SOs by Julio Urias. With Shohei Ohtani’s high strikeout rate of 167 this season, he’ll be an invaluable addition to the team. However, there’s a little hiccup that could keep that from happening.\nOhtani will not be available to pitch throughout the 2024 season due to an elbow ligament injury he’s currently recovering from. Given the pitcher’s unavoidable absence, it will not be advisable for the Dodgers to hire him until 2025. Yes, Ohtani does have magnificent hitting form as well. However, the team already has hitters like Freeman and Betts, who have scored 211 and 179 hits this regular season, respectively. Speaking of hitters, why will they still want Trout to join the team despite having better-than-average hitters on the team?\nWhy will the Dodgers sign an injury-prone Trout?\nMike Trout might have been absent for most of the 2023 season, but his career records boast the story of a legendary hitter who has given more than his salt’s worth to his current team. He has bagged 1624 hits and 940 RBIs with an 85.2 WAR and .301 BA across his 12-year-long baseball career. Unfortunately, Trout has become a victim of an injury streak, starting in 2022. He got his hands, left groin, back, and foot injured five times in the entire season; in 2023, he faced two hand injuries in two consecutive months.\nDespite his injury-prone history, the more logical option for the Dodgers would be to choose Trout over Ohtani; the team will not be able to afford them both at the same time. Trout comes with a cheaper price tag of $35.45 million compared to Ohtani’s projected $48.63 million. The Dodgers could use his All-Star form in between injuries if he still keeps getting them in 2024. With Shohei Ohtani, the Dodgers would be wasting a year letting him play at-bat, with a high chance of getting him further injured and missing more pitching time. Isn’t it better to have a consistently wounded soldier than risk losing an overperforming one in a game of chances?\nADVERTISEMENT Article continues below this ad\nWhy would Mike Trout switch to another Los Angeles team?\nTrout has been pretty persistent about sticking with the Los Angeles Angels from the very start. The team has been transparent about not stopping him should he choose to play for another team, but he does not want to do that. However, it seems that the Angels will have a hard time affording a player like Trout in the foreseeable future, as they have to win a good number of games to stay in the playoffs and keep a steady income of revenue throughout the seasons. Considering their 73-game win record this season, that seems like a pipe dream right now.\nADVERTISEMENT Article continues below this ad\nTrout is 32 years old, which means that he has already hit the MLB average retirement age of 30. He still has a lot left to give to the diamond for approximately 6 more years. If the Dodgers have the chance to draft them, should they go with Ohtani, Trout, both, or neither? Let us know your opinions in the comment box.\nWatch This Story: Shohei Ohtani’s Two-Way Dream: Before Injury, He Always Wanted Both!\n\nThis article, authored by Shrabana Sengupta, was published by Essentially Sports on 2023-11-18 under the category 'sports'.\n\n","id":423}
{"title":"The Verge’s 2023 holiday gift guide for kids","context":"## The Verge’s 2023 holiday gift guide for kids\n\nPoetry for Neanderthals Good game is good. Fun time be had by all. Me think you enjoy. That may sound like word crimes, but it’s the gist of playing Poetry for Neanderthals. Up to six players are tasked with getting their team to guess a word or phrase using only single-syllable words. And if you don’t, be prepared to get whacked with an inflatable club.\nPrice: $19.99 Amazon Walmart Target\nDisney Illusion Island (Nintendo Switch) Disney Illusion Island is a terrific intro to 2D side-scrolling “Metroidvania”-style games for kids. The art style is cute and fun, you can play with up to three others in co-op mode, and if anyone is ever struggling and gets dangerously low on health, you can give them an in-game hug to restore their vitality.\nPrice: $39.88+ Walmart Target GameStop\nMagna-Tiles Jungle Animals (25-piece set) It’s a proven fact that everything is more fun with magnets. Don’t believe us? Just ask any four-year-old child. Magna-Tiles’ jungle-themed set unites two things most kids love: animals and magnets. How do they work? Who knows? Nor do we think anyone is going to care when there’s a caiman and magnetic sloth this adorable involved.\nPrice: $39.99 Amazon Walmart Macy’s\nPokémon Matching Family Pajamas The family that Thunder Shocks together stays together. If your little ones are engrossed in the Pokémon world, then a fun way to engage with their hobby is with a little dress-up. Who needs cheesy red flannel and holiday PJs when you can wear the many expressions of Pikachu? It’ll make for much cuter family photos, I assure you.\nPrice: $19.99 Hanna Andersson\nCustom Face Socks Who doesn’t want to see their loved ones’ faces when looking at their feet? These eclectic socks from DivvyUp make for a silly gift for the kids or a fun one for an adult when featuring said children. You can choose up to three faces to plaster across a pair of socks in up to 14 colors, and all you need are some photos with decent resolution and good, consistent lighting.\nPrice: $24+ DivvyUp\nChatbooks Subscription Photo Book Photo albums are a time-honored treasure, but having the actual time to make them is the hurdle that dooms most family photos to a life spent dormant in cloud storage. With a monthly Chatbooks subscription, you take photos from your phone and easily assemble them in a 30-page photo book, one you can have delivered straight to your door with minimal effort.\nPrice: $21+ Chatbooks\nParchie watches Giving a kid a watch once they’re able to tell time is a small acknowledgment that they’re starting to have some responsibility bestowed upon them. While many watches aimed at children are cheesy, cheap garbage, these waterproof timepieces from Parchie are fun, adequately sized for smaller wrists, and built to last without costing a small fortune.\nPrice: $55.25+ Amazon Parchie Hodinkee\nKeith Haring Kids’ Chair What’s cooler than Keith Haring’s playful and uplifting artwork? Well, for one, having it be a decorative yet functional part of your home. This kid-sized chair constructed of lacquered beech wood can add a touch of whimsy to any room and, frankly, would look absolutely adorable when pulled up to a small desk for a little arts and crafts.\nPrice: $116.10+ The Shop at The Broad MoMA Design Store\nArteza Gel Ink Pens (60-pack) Some kids will always complain about school and homework, but the right set of pens can make both just a teeny-tiny bit more enjoyable. These long-lasting gel pens from Arteza are great for writing, drawing, coloring, or just doodling. The metal-tipped pens come in a wide range of colors, too, with metallic, pastel, and glitter finishes.\nPrice: $17.84+ Amazon Target Arteza\nWe’re Not Really Strangers Kids Edition Having deeper conversations with children is rarely easy, but the kids edition of We’re Not Really Strangers is an enjoyable exercise that gets both adults and children closer to the same wavelength. The thoughtful prompts are likely to elicit unexpected answers from both you and your kids, and the rainbow-colored pencils are a playful touch.\nPrice: $10+ Amazon We’re Not Really Strangers Toys R Us\nKit Adam mechanical keyboard Building a mechanical keyboard is a hobby oft-enjoyed by nerdy adults, but what if you could build one with Legos? The Kit Adam by KBDcraft is just that: a hot-swappable 60 percent board with a case constructed of Lego-style bricks. Not only does that make it simple and fun to build together but it also makes it infinitely customizable with your pieces.\nPrice: $99.99 KBDcraft\nBuddyPhones Cosmos Plus Headphones built for kids are low key some of the best gadgets parents can own. They come in handy while doing homework and can go a long way in keeping things a little less hectic during screen time, especially in the car. The noise-canceling BuddyPhones Cosmos Plus feature both wireless and wired connectivity, an included case, shareable audio, and — most importantly — a volume limiter to protect young ears.\nPrice: $79.90+ Amazon Walmart BuddyPhones\nThe Super Mario Bros. Movie – Van Playset It’s been a big year for Mario. Nintendo’s lovable Italian has a new movie and a new Nintendo Switch game in Super Mario Bros. Wonder. If the tykes still can’t get enough of everyone’s favorite plumber, however, then the Super Mario Bros. Movie Van Playset may scratch that itch — that is, until it’s time to rewatch the movie for the 100th time.\nPrice: $9.99+ Amazon Walmart GameStop\nKindle Kids (2022) The latest Kindle Kids offers young readers a sharp 6.2-inch display with adjustable front lighting, USB-C charging, and a battery that can last for weeks on a single charge. The best part of Amazon’s kid-ified ebook reader, however, is that it’s ad-free and comes with a two-year warranty against accidental damage, not to mention access to a ton of age-appropriate content.\nPrice: $119.99 Amazon Best Buy\n8BitDo SN30 Pro (Special Edition) The 8BitDo SN30 is more than a small controller best suited for tiny hands. It also oozes nostalgic vibes to make you feel a bit of what mom and dad did while playing the original SNES — albeit, with modern games on PC or the Nintendo Switch. What’s more, its see-through color schemes are sure to entice just about everyone, regardless of what year you were born.\nPrice: $44.99+ Amazon Walmart 8BitDo\nNintendo Switch Lite (Isabelle’s Aloha Edition) The Steam Deck may have ushered in a new era of handheld gaming, but it’s a bit pricey and overbearing for a child. That said, there’s still no substitute for the simplicity of Nintendo’s Switch Lite and its travel-friendly 5.5-inch display. Now add in the cuteness factor of this Animal Crossing-inspired design, which comes with a digital copy of New Horizons, and there’s not much topping this kid-friendly console.\nPrice: $199.99 Target\nSkullcandy Jib True 2 With the 3.5mm headphone jack quickly going extinct — thanks, Apple — wireless headphones have become the main mode of listening to music. If you’re anxious about giving your children a pricey pair of earbuds, however, Skullcandy’s Jib True 2 are here to save your budget. The inexpensive pair sound just fine, and they have built-in Tile tracking so you can find them should your kid misplace them.\nPrice: $28.17+ Amazon Best Buy Walmart\nAmazmic Kids Karaoke Microphone If you were a ’90s kid, you might remember those terrible echo mics. The Amazmic Kids Karaoke Microphone is essentially an evolution of that concept, only instead of your child only hearing their own voice, they get the backing track of whatever song you choose to play via Bluetooth. Just try not to give them too much stage fright, okay?\nPrice: $15.29 Amazon\nSamba de Amigo: Party Central (Nintendo Switch) Samba de Amigo: Party Central may not have maracas controllers like the original Dreamcast games, but on the flip side, all you need to get shaking are your Joy-Con controllers. The music rhythm game is loaded with modern pop songs from the likes of Ariana Grande and Charli XCX — not to mention classics like Ricky Martin’s “The Cup of Life” — and there are even Sonic the Hedgehog cameos to marvel at.\nPrice: $14.99+ Amazon Best Buy GameStop\nApple iPad (2021) The ninth-gen iPad isn’t just the final holdout in Apple’s tablet lineup to have a 3.5mm headphone jack; it’s also a great device despite its age. The entry-level slate features a sharp 10.2-inch screen, a 12MP camera, and the ability to smoothly run all kinds of apps, unlike cheaper tablets that are often relegated to Netflix and little else.\nPrice: $249+ Best Buy Walmart Target\nMark-my-time digital bookmark Mark-my-time’s colorful bookmark features a helpful timer built into its top that allows you to easily track your child’s daily reading sessions. You can set a countdown timer with an alarm so children know when they’re done, or you can set cumulative time to track multiple reading sessions if you’re curious about how long it takes them to finish a particular book or assignment.\nPrice: $8.95+ Amazon Mark-My-Time\nEcho Dot Kids (fifth-gen) The animal-themed kids version of Amazon’s latest Echo Dot boasts all the same features as the regular model but comes equipped with a selection of age-appropriate games. The Alexa speaker also comes with a one-year subscription to Amazon Kids Plus (which houses a large assortment of audiobooks) and a two-year accident protection plan.\nPrice: $27.99 Amazon Best Buy Target\nShadows in the Forest Shadows in the Forest is a cute tabletop game you can play in the dark, a la flashlight tag. Anywhere from two to seven players can join in on this asymmetrical game, which is easy enough to play for the whole family. One player uses the lantern to search for the other players’ Shadowling characters, encouraging the group to work together.\nPrice: $31.99 Amazon Legacy Toys\nA Very Spidey Christmas Remember that brief gag from Spider-Man: Into the Spider-Verse about Spider-Man having a Christmas album? No? Well, it doesn’t matter. The important part is you can actually buy a five-song EP on vinyl of Spidey’s real-life holiday album, one that features songs from Shameik Moore, Chris Pine, and Jake Johnson. Yes, there’s even that Xmas classic, “Spidey-Bells.”\nPrice: $19.99+ Merchbar Discogs Marketplace\nPokémon Carry Case Playset Backpacks for children are universally cute, sure, but each and every one of them would be infinitely cooler if they opened into a pokémon playset. This plastic backpack does just that, unfolding to reveal a collapsible climbing wall, a sparring platform, and other arid environments for small two-inch plastic pokémon to play or battle in.\nPrice: $33.99+ Walmart Target Macy’s\nHurry Up Chicken Butt The best children’s games are the ones that get them learning or doing something positive without even realizing it. In the case of Hurry Up Chicken Butt, kids get to play a silly game of hot potato with their parents while getting a bit of exercise and physical activity in the process. The fast-paced game is easy to learn, yet it gets both kids and parents playing and laughing together.\nPrice: $19.99 Target Exploding Kittens\nFurby Furby is back, baby! The new version of the voice-activated animatronic plushie features all kinds of responses, dances, and songs built into it. Most importantly, though, the resurrected ’90s toy is a completely offline experience with no “smart” functionality to speak of, meaning your kid won’t be pinging a cloud server every time they speak.\nPrice: $49 Amazon Walmart\nOriginal Bazooka Bubble Gun Holy crap, kids love bubbles! Like, wow, the sheer joy on a child’s face every time they see those soapy floating spheres is unmatched. So why not go full-tilt with a bubble bazooka? This beastly battery-powered blaster pumps out a rate of fire of over 5,000 BPM (that’s bubbles per minute). It’s like bringing a bubble gun to a bubble knife fight.\nPrice: $32.39 Amazon\nNerf Perses MXIX-5000 Motorized Blaster Say hello to my little foam friend. The Nerf Perses MXIX-5000 is that next-level upgrade from playing with standard foam darts. The motorized blaster shoots soft foam balls as fast as eight pellets per second, with a top-loading hopper that’s equally fast and frantic to reload. Just don’t forget to outfit your kids with some proper eye protection. You’ve been warned.\nPrice: $59.99+ Amazon Walmart Electronics Express\nQuick Push electronic sensory fidget toy (frog-green) Do you love popping bubble wrap? This adorable froggy game with lights and sounds feels a bit like that. While it’s recommended for kids ages three and up, you may surprise yourself with how fun it is even for adults. But us kids-at-heart aside, this little guy’s fidget-friendly fun may be a great fit for children who enjoy sensory toys.\nPrice: $16.99 Amazon\nPinecil portable soldering iron Safety warning: this one’s just for big kids — like teenagers or early teens if they’re responsible enough. The Pincecil portable soldering iron is the perfect introductory tool into the world of electronics tinkering. It’s affordable, it heats up quickly, and it allows you to dial in the exact temperature you need. You can even run it off a USB-C PD power bank.\nPrice: $25.99+ Amazon Pine64\n\nThis article, authored by Antonio G. Di Benedetto, was published by The Verge on 2023-12-18 under the category 'technology'.\n\n","id":424}
{"title":"Another cruel comeback sees Newcastle perish in group of death","context":"## Another cruel comeback sees Newcastle perish in group of death\n\nSign up to Miguel Delaney’s Reading the Game newsletter sent straight to your inbox for free Sign up to Miguel’s Delaney’s free weekly newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nFootball email {{ #verifyErrors }} {{ message }} {{ \/verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ \/verifyErrors }}\nIt was the sequel Newcastle United did not want, the second cruel comeback in as many Champions League games. For some 45 minutes, including half-time, they could savour the sight of a table that showed them in second, permitting them to imagine a date with Real Madrid or Bayern Munich in the knockout stages. And then, little more than half an hour, they were ejected from Europe altogether.\nChristian Pulisic’s equaliser threatened to condemn them to the Europa League. Samuel Chukwueze’s winner instead meant that spot goes to AC Milan. The group of death went down to the dying minutes, but Newcastle have perished. They had savoured a return to Europe but there will be no continental trips for them in the spring of 2024.\nAnd, after Kylian Mbappe’s controversial 98th-minute leveller in Paris, they can rue the loss of another lead. Once again, they may feel entitled to believe they should have won, but for different reasons. For much of the night, they were rampant and had Milan reeling. Yet, last season’s Champions League semi-finalists hung in the game, scored twice and hit the woodwork twice more. For Newcastle, a third consecutive defeat may come with the sense that their injuries came at a cost. Theirs was another colossal effort, a far better performance than at Everton or Tottenham, but while Eddie Howe had the luxury of one attacking substitute – in Alexander Isak – three replacements combined for Milan’s decider: first Luka Jovic found Noah Okafor and he picked out Chukwueze, who placed a shot past Martin Dubravka.\nIt was a sign of Newcastle’s determination to win, not to settle for the point and the Europa League place, that they were short-staffed at the back because centre-back Fabian Schar had charged into the Milan box in open play. Likewise, in a frantic finale, they almost conceded a third: with Dubravka out of his goal, Theo Hernandez almost scored from the halfway line and Fikayo Tomori hit the post.\nAs they wonder what might have been, they can reflect on the turning point of Pulisic’s strike, around the time Warren Zaire-Emery drew Paris Saint-Germain level against Borussia Dortmund. Newcastle failed to clear as the ball ricocheted around their box before Olivier Giroud found Pulisic to poke in a shot. The American had been a target for Newcastle last January; how they must now regret the fact he joined Milan in the summer.\nThen, with 11 minutes remaining, Rafael Leao sprinted clear and shot against the post. If this had threatened to be the derby of the depleted, Milan had Leao back for the first time in a month. Newcastle had Callum Wilson able to start, but their goal came from a less regular source, with a thunderbolt from Joelinton.\nJoelinton thumped home Newcastle’s goal (Reuters)\nOne of the great success stories of Howe’s reign, the misfit forward who was reinvented as a talismanic midfielder gave Newcastle a deserved lead. Joelinton’s rasping, rising shot from the edge of the box flew past Mike Maignan. He had taken Miguel Almiron’s pass and teed himself up. His initial non-celebration may have reflected his own surprise at the unerring accuracy of his strike.\nTheirs was the right response to the disappointment in Paris, a stirring effort. At this level, Newcastle do not possess a talent advantage but they can seek to outwork anyone. They rattled Milan by running at them. It took two astonishing interventions to stop them scoring both before and after Joelinton’s strike.\nAt 0-0, Fikayo Tomori made a magnificent goal-line tackle to stop Miguel Almiron applying the finishing touch to Joelinton’s low cross. It was a remarkable rescue act but pressure told when the Brazilian struck. Another almost joined him on the scoresheet at 1-1.\nNewcastle saw their European dreams slip away (Getty)\nMaignan tipped Bruno Guimaraes’ 20-yard shot onto the bar. As Nick Pope had denied Milan victory in San Siro with a string of saves, Stefano Pioli’s team could testify to the difference brilliant goalkeeping can make. Now they benefited from it. Newcastle had 17 shots, eight on target, but Maignan was only beaten once. Milan had two shots on target but Dubravka conceded twice.\nThe loss of the injured Pope may have proved pivotal. But perhaps seven-time winners, and a side who reached the last four last year, displayed greater knowhow. Maybe they simply had greater strength in depth on a night when Kieran Trippier and Anthony Gordon were taken off because they seemed exhausted.\nNewcastle can nevertheless depart the competition with heads held high. One win and five points seem meagre tallies for their contribution to the competition. They have proof it can be unforgiving, reasons to return. Their first Champions League campaign for two decades will surely not be their last for another 20 years. But it is over, and they are left to wonder about what might have been.\n\nThis article, authored by Richard Jolly, was published by The Independent - Sports on 2023-12-13 under the category 'sports'.\n\n","id":425}
{"title":"Shohei Ohtani rumors tracker: Latest news, updates on Dodgers, Cubs & more as free agency short list emerges","context":"## Shohei Ohtani rumors tracker: Latest news, updates on Dodgers, Cubs & more as free agency short list emerges\n\nAll eyes since the start of the offseason have been on Shohei Ohtani. And for the most part, there hasn't been much to see.\nThe two-way phenom is the most sought-after free agent in MLB history, with his combination of talent and marketability making him a franchise-changing player.\nAnd the bidding for Ohtani could be winding down soon. Multiple reports have indicated Ohtani could sign at some point during the winter meetings, which are scheduled to take place from Dec. 3 through Dec. 6.\nMany of the top teams are expected to be in the mix for Ohtani. The Dodgers and Cubs are among the top teams expected to be aiming to sign the two-time AL MVP, and plenty of others should continue to compete through the end to land him.\nHere's the latest on Ohtani's free agency pursuits.\nMORE: Projecting Shohei Ohtani's contract in free agency\nShohei Ohtani news: Latest updates, rumors for MLB free agency\nOhtani agrees to 10-year, $700 million deal with Dodgers\nDate: Saturday, Dec. 9\nShohei Ohtani announced Saturday that he has agreed to a contract with the Dodgers. It's a colossal 10-year, $700 million deal with \"significant deferrals,\" so while Los Angeles won't pay him $70 million per year, the franchise will be paying him beyond those 10 seasons.\nWhile rumors connected Ohtani to the Blue Jays on Friday, it's the Dodgers who hand him a record-shattering contract and pair the two-time MVP with two former MVPs in Mookie Betts and Freddie Freeman.\nOhtani not headed to Toronto, at his home in Southern California\nDate: Friday, Dec. 8\nSource: Bob Nightengale, USA Today; Ben Nicholson-Smith, Sportsnet\nOhtani had a change of plans, apparently. Hours after MLB Network's Jon Morosi reported that the two-way star was headed to Toronto for a meeting on Friday, USA Today's Nightengale and Sportsnet's Nicholson-Smith reported that Ohtani is at his home in Southern California.\nThe Blue Jays are still finalists to land Ohtani but his landing spot is not official yet.\nOhtani headed to Toronto on Friday\nDate: Friday, Dec. 8\nSource: Jon Morosi, MLB Network\nOhtani might not have officially picked a team, but he is headed to Toronto, per MLB Network's Jon Morosi. It had been previously reported he had picked the Blue Jays, though several reports have since denied that he has made a decision.\nReport: Ohtani picks Blue Jays over Dodgers\nDate: Friday, Dec. 8\nSource: J.P. Hoornstra, Dodgers Nation\nThe Blue Jays have reportedly won the sweepstakes for Ohtani. According to Dodgers Nation's J.P. Hoornstra, Ohtani has selected the Blue Jays. The official details have not been reported, though the report indicated it will shatter Mike Trout's record 12-year, $426.5 million deal.\nHowever, Sportsnet's Ben Nicholson-Smith reported Ohtani has not yet made his decision, and there is not a timeline, though he noted Toronto is a finalist.\nDecision from Ohtani 'imminent'\nDate: Friday, Dec. 8\nSource: Jon Morosi, MLB Network\nThe wait could soon be over. MLB Network's Jon Morosi reported Ohtani is expected to make his decision soon, reporting it could come as early as Friday. Coincidentally, Ohtani made his original decision to sign with the Angels on Dec. 8, 2017, six years to the day.\nDave Roberts says Dodgers met with Ohtani\nDate: Tuesday, Dec. 5\nSource: Alden Gonzalez, ESPN\nDodgers manager Dave Roberts told reporters Tuesday that the team met with Ohtani for 2-3 hours over the weekend. Roberts said Ohtani is \"clearly\" the Dodgers' top priority, adding that the team is confident the two-time MVP will pitch again. Roberts wasn't able to offer a timeline for Ohtani's decision.\nCubs losing optimism in signing Ohtani\nDate: Tuesday, Dec. 5\nSource: Bob Nightengale, USA Today\nThe Cubs have been viewed as one of Ohtani's likeliest destinations for a while. It appears that might no longer be the case. USA Today's Bob Nightengale reported one high-ranking executive believes the Cubs' optimism of signing Ohtani \"has now significantly wanted.\" The report stated that leaves the Dodgers, Blue Jays, Angels and Giants as the remaining finalists.\nOhtani has 'positive feeling' about Blue Jays\nDate: Tuesday, Dec. 5\nSource: Jon Heyman, The New York Post\nThe Blue Jays reported met with Ohtani on Monday, but even before he went to talk with the team, Ohtani reportedly had a \"positive feeling about Toronto,\" along with other cities and teams, including the Dodgers. He has been linked to Toronto and Los Angeles throughout the process.\nBlue Jays 'believed' to have met with Shohei Ohtani\nDate: Monday, Dec. 4\nSource: Ken Rosenthal, The Athletic\nWhile one report earlier Monday indicated Ohtani isn't expected to sign before the end of the Winter Meetings, the process seems to be moving along.\nThe Athletic's Ken Rosenthal reports Ohtani is \"believed\" to have met with the Blue Jays at the team's complex in Florida on Monday, far away from the meetings in Nashville. The Blue Jays have been pursuing Ohtani and Juan Soto in hopes of striking a deal for one of the two stars.\nBraves are reportedly 'engaged' with Ohtani's camp\nDate: Dec. 4\nSource: Jon Morosi, MLB Network\nIt's not surprising that any and all teams should be interested in Ohtani's services, but imagine the Braves landing the superstar? According to MLB Network's Jon Morosi, the Braves are \"engaged\" in talks with Ohtani's camp. Imagine a lineup consisting of Ohtani, Ronald Acuna Jr., Ozzie Albies, Austin Riley and Matt Olson?\nSources: Braves are among the teams still engaged with Shohei Ohtani’s camp, as I reported in this @MLBNetwork segment. @MLB pic.twitter.com\/lP4lISzttN — Jon Morosi (@jonmorosi) December 4, 2023\nOhtani has already received several $500+ million offers\nDate: Dec. 3\nSource: Jon Heyman, NY Post\nIt's no surprise the bidding for Ohtani is heating up, with the star expected to sign soon. And New York Post's Jon Heyman reported Ohtani has already received several deals that have topped $500 million, which could mean he winds up being the first $600 million player in MLB history. He added there are believed to be five teams in the running for Ohtani.\nOhtani decision coming this week\nDate: Dec. 3\nSource: Jon Morosi, MLB Network\nWith the winter meetings set to begin in Nashville, it seems a resolution is near for Ohtani. MLB Network's Jon Morosi reports the superstar is \"likely to decide on a team within the next week,\" according to a source.\nOhtani race starting to clear up\nDate: Dec. 1\nSource: Jeff Passan, ESPN\nTwo days before the start of the winter meetings, the picture on Ohtani is beginning to clear a bit more. ESPN's Jeff Passan reported the Rangers, Red Sox and Mets appear to be out of the running for Ohtani, while the Dodgers, Cubs, Blue Jays and Angels remain in the mix. The Giants are considered to be an unknown.\nIn addition to the teams, Passan also reported Ohtani is expecting a contract somewhere between $550 and $600 million, which would be the largest guaranteed contract in North American sports.\nBlue Jays could alter roster with Ohtani signing\nDate: Nov. 30\nSource: Jon Heyman, New York Post\nThe Blue Jays are one of the teams believed to still be among the strongest in the mix for Ohtani. The New York Post's Jon Heyman reported there could be some changes if Ohtani signs with the Blue Jays, however, reporting that some rivals believe Bo Bichette and Vladimir Guerrero Jr. could hit the trade block if Toronto lands the star.\nTrading the two infielders might seem counterproductive to signing Ohtani in the first place. Those two would be the biggest supporting bats in the lineup around Ohtani. However, both are free agents after the 2025 season, and given the added payroll of signing Ohtani, it's possible Toronto would view keeping the other two phenoms as too pricey.\n\nThis article, authored by Edward Sutelan, was published by Sporting News on 2023-12-01 under the category 'sports'.\n\n","id":426}
{"title":"New Alzheimer’s drugs bring hope of slowing disease for UK patients","context":"## New Alzheimer’s drugs bring hope of slowing disease for UK patients\n\nPeople in Britain could benefit from a key medical breakthrough next year. They may be given access to the first drugs ever developed to slow the impact of Alzheimer’s disease.\nThe first of these medicines – lecanemab – was recently approved in the US and Japan, where treatments using it have already been launched. A second drug, donanemab, is expected to follow soon, and next year it is anticipated that the UK medical authorities will consider both of them for approval in Britain.\nThe prospect has raised hopes that, after years of effort, scientists may be closing in on ways to directly tackle the UK’s dementia crisis. About a million people are living with the condition in this country, and this is expected to rise to about 1.7 million by 2040 – with potentially grim consequences. Last year dementia took the lives of 66,000 people in England and Wales, and it is now the leading cause of death in Britain, with Alzheimer’s accounting for two-thirds of cases.\nUntil now doctors have only been able to prescribe medicines that help patients manage their symptoms, so the arrival of the first drugs that treat the actual cause of the condition has been welcomed – although experts have warned that their use should be treated with some caution.\nAfter decades of research, these are the first drugs to improve patients’ lives directly. If nothing else, they suggest we’re on the right road to tackling Alzheimer’s\n“The new drugs slow down the development of Alzheimer’s by six months to a year and are useful only for those in the early stages of the condition, so they are certainly not miracle medicines,” said David Thomas, head of policy at Alzheimer’s Research UK.\n“However, after decades of research, they are the first to improve patients’ lives directly, and that is a justifiable cause for excitement. If nothing else, they suggest we are probably on the right road to tackling Alzheimer’s.”\nThis point was backed by neurologist Cath Mummery, of the Dementia Research Centre at University College London. “It has been a very long, hard road, but finally we have something positive to look at. That is very welcome.”\nAlzheimer’s disease is triggered by the buildup of a protein called amyloid in the brain, although symptoms may not appear for decades after this accretion has started. Scientists have tried for more than 20 years to find ways to stop amyloid from forming these plaques, in the hope this would stop the progression of the disease.\nLecanemab, which is produced by Japanese pharmaceutical company Eisai, and donanemab, produced by Eli Lilly of the US, are the first medicines to achieve this aim – though they only slow but do not ultimately halt the disease’s progression.\nGraeme Armstrong with wife Trina, who has a rare form of Alzheimer’s.\nBoth drugs are to be considered for approval in the UK next year. The Medicines & Healthcare products Regulatory Agency (MHRA) will first decide if they are safe and effective, then the National Institute for Health and Care Excellence (Nice) will rule on whether they offer value for money.\nBoth medicines are expensive – lecanemab costs about $25,000 (£19,700) a year – and are given by regular intravenous infusions. “That is a challenge from a health-service point of view, because you need to find the space and time to put someone in an infusion suite to treat them,” added Thomas.\nHowever, the main problem facing doctors is the difficulty involved in pinpointing dementia not just in its early stages but even in its later phases. Most cases are first presented to GPs, who will then refer patients to memory clinics for a dementia test. However there are long waiting times – up to two years on average – for appointments at these centres.\nIn addition, diagnosing Alzheimer’s and other forms of dementia is usually based on pen-and-paper tests, followed by lumbar punctures and brain scans before a final diagnosis.\nAbout 65% of cases are confirmed this way. The remaining third of dementia cases are never diagnosed. Yet patients can only expect to receive treatments – including the new drugs – if their condition is identified.\nEleanor Mackenzie-Smith’s father, Mike, has young-onset Alzheimer’s. His first symptoms were spotted 17 years ago, when Eleanor was 11. “However, it took over 10 years from the start of his symptoms and four separate tests between 2009 and 2017 to get my dad’s final diagnosis, when he was 65. It was distressing not knowing what was happening. Too many families, like mine, have had to watch as dementia takes hold of our loved ones while we are left without a diagnosis and the support and access to treatments.”\nIt took 10 years for Mike Mackenzie-Smith to get a diagnosis of young-onset Alzheimer’s.\nAnother grim illustration of the problem facing patients is provided by Graeme Armstrong. His wife, Trina, began having trouble recognising faces and reading telephone numbers in 2006 and was told, after a CT scan three years later, that she had probably had a stroke – although her symptoms did not suggest such a diagnosis. It took another three years before she was diagnosed with posterior cortical atrophy, a rare variant of Alzheimer’s disease that affects the way the brain interprets information from the eyes.\n“Had we had an accurate diagnosis four years earlier, Trina could have been placed on the correct medication, which may have been more effective and helped her day to day,” Armstrong said.\nOne solution sought by doctors involves the creation of blood tests which could pinpoint the disease quickly and effectively. “These are under research, but we are several years away from having them in widespread use,” said Thomas. “Meanwhile, we have got to get the NHS to a state where it is much more focused and better organised in getting better and earlier dementia diagnoses. That will be crucial in our battle against the condition.”\nMummery agreed: “By the time you have dementia, you will have had Alzheimer’s disease developing in your brain for at least 20 years. Dementia is the latest stage; we need to pick up signals much earlier. So we need to be thinking about how to diagnose people at the very earliest stages of disease, when they may only have very, very subtle symptoms.\nWe are now exploring ways of helping drugs get into the brain much more efficiently, and that could have a major impact Cath Mummery\n“Our current service isn’t good for doing that, and we need to develop brain health clinics where we can pinpoint the disease much earlier, then help to build resilience against dementia in a patient when it is only in a very early stage.”\nIn the long term, scientists also point to a number of recent developments which have raised hopes that it may be possible to tackle dementia more directly and effectively. One major challenge they have faced is the problem of getting drugs to pass through the blood-brain barrier, which controls the movement of ions and molecules from our bodies to our brains. That makes it difficult to get drugs into the central nervous system to tackle problems such as amyloid plaques.\n“However, researchers are developing active transport methods for getting drugs across the blood-brain barrier,” said Mummery. “For example, we are now exploring ways of helping drugs get into the brain much more efficiently, and that could have a major impact.”\nSuch developments will take years to realise, scientists caution, and a great deal needs to be done in the short term to deal with dementia.\n“It is clear we have taken a step in the right direction but there is much more to do before we can have successfully dealt with these processes that are happening to our brains,” said Thomas. “It is a challenge, and a very important one.”\n\nThis article, authored by Robin McKie, Science Editor, was published by The Guardian on 2023-12-17 under the category 'science'.\n\n","id":427}
{"title":"The 35 best couch co-op games for Nintendo Switch","context":"## The 35 best couch co-op games for Nintendo Switch\n\nMany games are huge. Others are endless. Some are so exciting that they swallow our news feeds whole. That’s where Polygon’s What to Play comes in: We curate the best, most innovative, and most intriguing games on every platform, so you can spend less time searching, and more time playing.\nThere’s a lot to love about the Nintendo Switch, not least of which is the abundance of titles with local multiplayer features, making it a great console for game night with friends or a casual play session with a roommate. We’ve collected some of our favorite titles that allow for good old-fashioned local play.\nIt’s also my preferred play style, as the last few years have given me more excuses to stay in and try new games. Local multiplayer makes ass-kicking games much more approachable, thanks to friends respawning my character. I also love building something together in real time, like a farm in Stardew Valley, or causing communal chaos like with Untitled Goose Game’s treacherous honking. Sure, couch co-op can also mean getting revived just to get ragdolled across spikes in Spelunky 2. But it sure beats dying alone.\nAnd if you’re looking for more platform-agnostic couch co-op recommendations, here are our favorite local multiplayer games, games to play with a Valentine’s Day beau, and a Dear Polygon column about couch co-op. Our last update added Escape Academy.\nFor two players\nThis modern-classic farming sim game takes its cues from the Harvest Moon series, and running a farm with your friends only adds to the fun. You can work together to plant and harvest crops or spend your days doing different activities, like fishing or mining. Local co-op is available for two players — just don’t forget to build an extra cabin on your farm. (Up to four can play with online multiplayer.)\nThis Switch remaster includes both Portal and Portal 2, seminal games well worth the revisit. You’ll explore and solve puzzles by using a portal gun; experimenting within the game’s physics is even more fun with a friend in tow. (Plus, when playing local co-op, the number of portals that can be placed is doubled.)\nCongrats, you are the new CEO of a large corporation, and your wisdom is required to help employees stay on task. Good Job! has a lot in common with Untitled Goose Game. In this isometric game, you’ll be given a list of tasks — like bringing a projector into the conference room. But no one said you couldn’t do it by launching it like a projectile through the window.\nThis Wii U game’s Switch port is full of charm. Play together in local co-op as Captain Toad and Toadette, and explore and solve your way through a series of bite-size puzzles. Each self-contained course has little nooks and crannies to pop in and out of, and Koopas to navigate around.\nIt’s a lovely morning in the village and you are a horrible goose! Cause mayhem and honk to your heart’s content in this charming game. With local co-op you and one friend can each be horrible geese, using teamwork to terrorize the townspeople. Honk honk HONK!!\nIn this melancholy game, you play as Stella the ferrymaster, who guides spirits into the afterlife. Meet wonderful characters and help them find closure. Spiritfarer combines exploration on the seas with management sim elements, as you build housing, kitchens, and more, and learn to farm, cook, and craft. Player two is Stella’s cat Daffodil, who can do most management sim tasks — she just can’t talk to characters, and thus, can’t trigger quests.\nScrew playing as the plumber in the red hat — it’s time to be his taller counterpart. In Luigi’s Mansion 3, you can play local co-op with player two as Gooigi (a spooky goo Luigi) after finishing the intro walkthrough and getting E. Gadd’s briefcase. Platform your way through the haunted hotel to save your friends Mario, Peach, and numerous Toads.\nThis modern-day, punishingly difficult platformer has the beautiful look of vintage animation. The art direction and soundtrack are wholly unique, making the game a joyride from start to finish, despite the challenge. Mugman, Cuphead’s sibling, can join on a local co-op journey.\nPlay as a Yarny (a living ball of yarn that looks like a small sprite) and solve puzzles with a friend by using your spare yarn to pull, yank, and swing. It requires quite a bit of teamwork. Where other local co-op games might allow players to wander and do their own thing, this game is all about solving puzzles using each other’s momentum.\nKirby games tend to be perfectly chill and incredibly adorable, and this one is no exception. In Forgotten Land you and another player run, float, and fight through 3D levels. In addition to Kirby’s classic inhale powers, Forgotten Land also gifted us “mouthful mode,” which lets Kirby stretch like a glove over enormous objects like cars and huge lightbulbs. (By the way, Kirby Star Allies is also fun with local co-op.)\nPlay as characters named “Nobody” as you work together to attempt to cure the world of a poisonous blight, and figure out why you have no memory of your past life. But there’s another twist: Instead of a classic perk tree, your characters will unlock various forms — like a turtle, ghost, knight, or ninja — each with its own set of moves. What’s more, the forms can synergize with one another, making for some incredibly absurd skill combos.\nCat Quest 2\nThis criminally underrated action game puts you in the shoes of a cat fighting their way through the pun-filled land of Felingard. And player two gets to be a dog! Playing is a simple grind in this approachable and silly RPG. Fight your way through dungeons, meet necromancer cats, and try on lots of outfits.\nPlay as an automaton that needs a gem substance to survive, and fight against the clock to keep your friends from becoming “unsighted” and turning into shells of their former selves. This Metroidvania has an incredible map with three interwoven floors of levels, and tons of Zelda-like puzzles. A couch co-op buddy makes these challenges much more surmountable.\nThis pixel art Metroidvania has the feel of a great NES game, with its retro aesthetic and excellent platforming and battling. The definitive edition (which includes the original Shovel of Hope campaign), available on Nintendo Switch, supports local co-op for two players.\nThe Lego games are always a great laugh, and they have reliable couch co-op modes (see also: Lego Marvel Super Heroes 2). They’re accessible, family-friendly, and give a silly spin to some of the most recognizable films of our time. The Skywalker Saga is no different, with Lego versions of a whopping nine movies from the behemoth franchise and 200-plus minifigs to unlock.\nA silly collaboration between Nintendo and Ubisoft became one of the sleeper hits of its release year. This squad tactics game pairs Mario and friends with their own doppelganger Rabbids against a veritable sea of evil Rabbids. While local co-op is limited to five specific challenges — so we wouldn’t recommend buying it specifically for co-op play alone — these levels are especially fun. Working together changes the tactical dynamics.\nCrypt of the Necrodancer is the perfect combination of dungeon crawler and rhythm game — with some sweet tunes, to enliven the whole experience. But dancing through the game’s levels is even more fun with a friend, even if having someone else there doesn’t necessarily make it easier. You both still have to stay on beat!\nIf you’ve ever wanted an escape room experience but in a video game, Escape Academy absolutely scratches that itch. Up to two couch co-op players can go to this school for puzzle enthusiasts. Players find solutions and crack codes to avoid legitimately perilous fates — like a tower flooding with water as you climb. Hints (and red herrings) are everywhere. Are you smart enough to escape each room?\nFor two or more players\nSuper Mario Bros. has always been one of Nintendo’s most beloved franchises, and Wonder is another banger. Super Mario Bros. Wonder brings together so many delightful ideas: platforming shenanigans, silly power-ups, and lots of map secrets. The best part? Four people can play local multiplayer, picking from so many classic characters: Mario, Luigi, Princess Peach, Princess Daisy, Toad, Toadette, and more.\nI’ve donated hours and hours of my life to this deceptively simple roguelike bullet-hell — min-maxing various buffs in order to avoid waves of mob attacks. But multiplayer changes everything. Having more reinforcements to fight waves of attacks means each player can try out unique combinations of weapons and buffs. Just make sure you and your teammates stay in the same screen; there isn’t split screen.\nThough packing up and moving is a pain in the neck in real life, Moving Out 2 turns the experience into a goofy, whimsical group experience. Play as a member of the F.A.R.T. moving crew (yes, you read that correctly) attempting to move furniture, and other items, around some highly inconvenient spaces.\nNow more than a decade old, Diablo 3 is still a great local multiplayer choice, especially on the Switch. The action RPG, which felt bombastic when it first came out, has become a very comforting grind game that I get to share with friends. (Especially as Diablo 4 hasn’t made its way to Nintendo Switch.)\nThis one is not for the faint of heart. Work with a friend to excavate cave levels, avoid the dangers within, and ration supplies. In local co-op, if one of you dies, you can bring them back to life by finding a coffin. Ragdoll physics — not to mention turkey riding — add challenge and humor to one of the best platformer roguelikes.\nThis edition of Rayman Legends has all of the platforming and hijinks that the series is known for. Play through delightful levels and time trials, and collect to your heart’s content. Having multiple players is particularly helpful for respawning, as the game ramps up in difficulty in its later levels.\nSure, racing games and soccer games are fun on their own — but mashing the two together results in something bizarre and unforgettable. Rocket League asks what other games don’t dare to: What if you played soccer? And what if you did that with rocket-powered vehicles?\nTowerfall Ascension is the gold standard for 2D arena games. Players are archers and must fight each other with well-placed arrows, or by stomping from above. Movement is a dream with dodging and dashing in the air, lending each character a spry and agile feel. Different multiplayer variants, like starting with just one arrow and having to scavenge for others, keep rounds feeling fresh.\nThis bestseller is a no-brainer for anyone looking to spend time with friends in a sandbox world. Mine, build, dig, fish, plant crops, and protect yourself from the monsters that come out at night — and most of all, survive.\nThis definitive remaster bundles Overcooked and Overcooked 2 (both excellent games) into one delicious package. Prepare orders for hungry customers while facing ridiculous odds — like cooking in a hot air balloon with cooktops that sometimes catch on fire, or while crossing a busy street.\nIf you’re searching for that classic Super Mario feeling in a modern 3D world, look no further. (Or if you’ve always wanted to play as Mario in a cat suit.) Play as Mario, Luigi, Peach, or Toad — each of them has a slightly different perk. Luigi can get a bit more air in his jump, while Toad is a bit faster.\nThe Mario Party series reigns supreme as a family-friendly, chill party time. In this board game-style title, players pick their favorite Nintendo character and then roll the dice to land on a spot on the board. Players compete in minigames, including a baseball-bat-swinging rhythm game, rowboat race, snow catching, and so many more.\nWii Sports’ legacy will never be forgotten (nor will its banging soundtrack). Nintendo Switch Sports gracefully takes up the mantle of its predecessor, along with many of the same classic sports, like bowling, golf, and tennis. It also adds some new ones to the mix, like volleyball and chambara (a great complement to Wii Sports’ boxing). Just make sure you have enough space around you so you don’t accidentally hit your television.\nNo multiplayer Nintendo Switch list would be complete without mentioning the most recent edition of 20-year series Mario Kart. Though the game came out in 2017, it still reigns supreme, as far as kart racing goes — and it still gets new courses, like the recent addition of Mario Kart 7’s Rainbow Road.\nScramble with your friends to operate a spaceship hurtling through outer space. Each of you can only pilot one of the ship’s eight total control panels at any given time. We hope you like your partners, because you’ll be shouting directions and trying not to lose it as you work together.\nThe premise is simple: Each of you is a piece of paper, and you can cut shapes out of one another in order to accomplish tasks. Some of these challenges involve working together to create a specific shape. Others require teamwork to shoot a ball into a hoop or fill up a basin with water. Bring your most levelheaded (or, alternatively, chaotic) friends.\nAnother Switch take on a stone-cold classic, Nintendo’s fight-to-the-death brawler is stocked with all of your favorite characters. Play with up to seven other people and survive to be the last one standing.\nTMNT: Shredder’s Revenge is a return to the halcyon days for any TMNT fan, and a truly excellent beat-’em-up brawler. Players can choose between the four Turtles — Leonardo, Michelangelo, Donatello, and Raphael — along with April O’Neil, Master Splinter, or Casey Jones.\n\nThis article, authored by Nicole Clark, was published by Polygon on 2023-10-20 under the category 'entertainment'.\n\n","id":428}
{"title":"Yankees Gear Up for 2024 Season After Horrendous Year, But Could Letting This Star Go Spell Another Big Mistake?","context":"## Yankees Gear Up for 2024 Season After Horrendous Year, But Could Letting This Star Go Spell Another Big Mistake?\n\nThe baseball season for the New York teams didn’t turn out to be their most successful one. Both the New York Mets and the New York Yankees failed to make it to the playoffs and came under scrutiny as the highest spenders in the league. But the level of accounting has come higher for the 27-time winners because of the highest expectations. The management has comprehended the situation and is actively seeking to make changes for the 2024 season. Be it trimming the squad and releasing a few players, including superstar Gleyber Torres, they look to bring about changes. But given that they are already short on options, it brings up the question: Is the move justified?\nAmerica’s Favorite Video Today\nAlthough it was a decent season for the second baseman, the lack of consistency brought Torres under scrutiny for changes for the upcoming season. Also, given he is currently in arbitration with the Yankees, it adds to his trade chances. The reason is that the team won’t want to lose the opportunity to cash in some money from his trade. The decision appears promising as the team seeks a shift, but the data tells a different story. Gleyber Torres’s Exit Becomes the Talk of the Town as the Yankees Look for a Rebuild The New York Yankees have been in the news since the league stage ended. First, because of the possibility of a third-party audit, which was later shunted out. Later, the comments from Aaron Judge brought a lot of attention to the workings of the team, conflicts, and divisions between the core four. Now it’s the assumptions of changes with the idea of cutting down the $300 million budget for the next season. One name that is making the rounds for an exit is Gleyber Torres. Notably, the 26-year-old avoided arbitration ahead of the 2023 season and signed a $9.95 million contract. It was a brilliant move, given the requirements of the Bronx Bombers. Torres fulfilled it for most of the season to finish it on a high, scoring 90 runs, 25 home runs, and 68 RBIs at an average of 0.273 and an OPS of 0.800. Torres also finished at the top of the batting charts for the team, alongside captain Aaron Judge, clinching the most hits and recording an OBP of 0.347. The infielder also finished second in the fielding department behind the team’s Gold Glove prospect, Anthony Volpe. The seasoned player made 80 double plays, with 563 chances created at a fielding percentage of 0.975. The performance from Gleyber has been crucial in a season filled with injuries on both fronts. But the Yankees are not favoring his services for the upcoming season. There are two reasons behind the interest of the Miami Marlins and the push for lower spending. As mlbtraderumors.com suggests, Torres is expected to earn $15.3 million next year; his trade could save the Yankees some money. The Marlins have been interested in him for a long time, and the Pinstripes can have a good deal for the outfielder. Considering the advantages, this appears promising. However, is it a worthwhile endeavor? Should the New York Yankees Trade Gleyber Torres Ahead of the New Season? Nothing has worked well for the New York Yankees this season. They had their worst finish in seven years, even after having all the resources. The Yankees are seeking a shift in their strategy, which has exceeded their initial expectations. This shift encompasses alterations in both offensive and defensive personnel, and surprisingly, it involves Gleyber Torres. Although it is a reboot button from Brian Cashman for a better 2024, should the Yankees refraining from including Torres? The answer is simple: they should indeed because of his worth as a player. It may sound huge as they expect Torres to earn $15 million, but it is not a big ask for the multibillion-dollar Yankees. The 2009 champions can easily fulfill this request without constraining their spending.\nADVERTISEMENT Article continues below this ad\nPlus, Torres is the sole option for the Yankees at second base. With limited options available in the market, the team is in the circumstances to spend more. And if the Yankees are for other infielders, they may have to reshuffle to make their place in the squad. It will include the shift of Oswaldo Peraza from third baseman to second. However, Peraza could not do well this season, even after all the positives. His involvement in unique positions could be a risk for the team.\nADVERTISEMENT Article continues below this ad\nMoreover, free agents Whit Merrifield and Adam Frazier have not done well. Given that the Yankees finished second last in total hits and had over 1400 strikeouts, losing a player with the best record in both parameters will not be ideal. Notably, Torres has a 14.6% strikeout rate, with only a handful of players recording a lower rate. He also covered a lot of bases this season to finish second to Judge. All these factors make him a player that the Yankees should keep as they look for a change in 2024.\nADVERTISEMENT Article continues below this ad\nnot in the best shape, losing Torres could haunt the Yankees further. It will be interesting to see how the most successful team approaches this. Will they be able to find genuine replacements on the market? Only time will tell. His trading is not worth it for the Yankees, which will further reduce the options in the outfield. With rookies and the farm not compensating for the demand, it would be a big ask for them to fulfill. With Jasson Dominguez Anthony Rizzo , and DJ LeMahieu\nWatch the Story: Ranking the New York Yankees Biggest World Series Failures\n\nThis article, authored by Saurabh Saini, was published by Essentially Sports on 2023-10-10 under the category 'sports'.\n\n","id":429}
{"title":"Simply Homes nabs $22M, leverages AI to tackle affordable housing crisis","context":"## Simply Homes nabs $22M, leverages AI to tackle affordable housing crisis\n\nThe United States has long had an affordable housing crisis, but it’s been exacerbated as of late by a surge in mortgage interest rates and low inventory.\nThe problem is especially acute for lower-income families.\nOne Portland, Maine-based startup is out to help address the problem by buying single-family homes in blighted neighborhoods, renovating them and then renting them out to very low-income families, the elderly and the disabled (or Section-8 voucher holders). That startup, Simply Homes, has recently secured $22 million in funding to further its efforts.\n“We’re helping to solve the affordability crisis for people who struggle with housing stability the most,” said CEO and co-founder Brian Bagdasarian. “While there are groups that have attempted to tackle programmatic buying of homes in the past — to varying degrees of success — the reality is no one is operating in our market, providing well-maintained affordable homes to the people most in need.”\nIndeed, most iBuyers are focused on buying, renovating and either selling or renting homes in middle to upper class neighborhoods. And most home builders are “out of touch and building homes that no one who needs affordable housing could ever afford,” Bagdasarian told TechCrunch in an interview.\nThe opportunity to help people overcome poverty and improve their chances for social and economic mobility was what attracted Bagdasarian and co-founder and CFO Robert Kavanagh to build Simply Homes’ model.\n“Children that are able to move into lower-poverty neighborhoods can see a 31% increase in lifetime earnings,” Bagdasarian said.\nAnd the pair are firm believers that you can still make money and do good at the same time.\nFounded in 2020, Simply Homes spent its first couple of years developing its platform and associated models before buying its first home in January of this year. By the end of this month, the startup is expected to have 108 units, or homes, in its portfolio. Since its first-quarter launch, it’s seen its revenue grow by more than 50% quarter over quarter.\nOver 80% of Simply Homes’ tenant base are single parents who would need to work an estimated 150 hours a week to afford market-rate rent on a home, notes Bagdasarian. Utilizing HUD’s HCV program through Simply Homes, these families are paying no more than 30% of their income for rent, claims Bagdasarian.\nCurrently, Simply Homes operates in Pittsburgh, Pennsylvania and Cleveland, Ohio. Its goal is to expand into Baltimore, Maryland and parts of the Midwest, including additional markets throughout Ohio and in St. Louis, Missouri, among other cities. The company looks for stable markets that aren’t susceptible to wild fluctuations in the housing industry.\nSimply Homes operates in an operating company\/property company structure, with the operational company using its technology platform and operational teams to source, acquire, renovate and manage the properties. The property management company holds them long term.\nMany proptech companies have struggled, or outright shut down, this year, in large part due to the sky-high interest rates. But Simply Homes, according to Bagdasarian, factored in the possibility of high interest rates very early on in its model so it has been less affected by the macro environment.\n“Everything is underwritten to a worst-case scenario. A lot of first generation ibuyers never underwrote interest rate risk. But we started with that,” Bagdasarian said. “We made sure our large return rates were inclusive of high interest rates that still allowed us to operate profitably. The other piece of that is we have highly stable income — because the way that Housing Choice Voucher works is that the tenant pays 30% of their adjusted monthly income. The voucher covers the balance. So it’s highly predictable income.”\nInitially, the company set out to solve the automated underwriting part of the process for third parties, and then for itself by leveraging Bagdasarian’s AI background and Kavanagh’s real estate experience. Bagdasarian has two decades of experience in human process automation and machine learning, and previously was with HubSpot, having joined as part of the founding team of Motion. Kavanagh previously led the acquisition of Ireland’s largest social housing portfolio, and spent 10 years as an investment banker at Jefferies and Cantor Fitzgerald in New York and London, specializing in infrastructure and ESG assets.\n“We know what we can rent the homes for because the housing authority (or HUD) gives us that information. This means we can underwrite — using that data and machine learning — very accurately, very effectively and very rapidly,” Bagdasarian said. “This eliminates a lot of the friction that has kept other institutions out of the space and gives us this sort of first-mover advantage.”\nSimply Homes collects the rent on its properties, which helps cover the cost of managing the properties. It takes a transaction fee, and a 3% fee on an ongoing basis to manage the portfolio.\nBesides expanding into new markets, the company plans to use its new capital in part toward developing a series of AI-powered virtual analysts that “rapidly” interpret massive amounts of data that Simply Homes aggregates and leverages to make its acquisitions.\nGutter Capital and Watchung Capital co-led the company’s recent $22 million funding round, which included participation from Village Global, Ambush Capital, RavenOne Ventures, Neil Parikh, Gabe Flateman, Luke Sherwin and others.\nJames Gettinger, managing partner at Gutter Capital, told TechCrunch that he believes Simply Homes is doing something “that very sorely needs to be done.”\n“By rejuvenating the aging housing stock, they’re able to make homes available to people who are affected by the affordability crisis the most,” he said. “One facet of the housing shortage that I think doesn’t get enough attention, frankly, is the fact that starter homes are no longer built. The average size of new construction homes has gone from something like 1,400 square feet 50 years ago to 2,200 square feet today. The downstream consequence of that is…basically, none of the new homes that are coming on market are affordable to the majority of Americans..”\n“I haven’t seen anyone who’s addressing affordability for the bottom end of the market like this,” he added.\n\nThis article, authored by Mary Ann Azevedo, was published by TechCrunch on 2023-12-07 under the category 'technology'.\n\n","id":430}
{"title":"Amazon’s latest Echo Frames are more style than substance","context":"## Amazon’s latest Echo Frames are more style than substance\n\nThe purpose of the Amazon Echo Frames is obvious: to provide quick access to Alexa no matter where you are because it’s on your face. But generally speaking, that’s not why anyone wants smart glasses, let alone a pair that costs $389.99 like the Carrera Cruiser model I’ve been wearing for the past week.\nFor better or worse, most people’s vision of smart glasses is informed by Tony Stark, James Bond, and other iconic sci-fi and spy movie characters: sleek, discreet devices that have some sort of hidden mixed reality display or the ability to capture the world around you. The original Google Glass cemented that image, while successors like the Snap Spectacles and the Ray-Ban Meta Smart Glasses have leaned heavily into content creation. But the Echo Frames hasn’t really ever been quite that ambitious. Like the Bose Frames, Amazon’s approach to smart glasses has primarily been as a pair of open-ear headphones that you can take calls on, listen to music with, and ask the occasional Alexa query. There’s no camera, no screen, and nothing to clue anyone in that you’re not just wearing ordinary glasses.\n6 Verge Score Amazon Echo Frames Carrera Cruiser $ 314.99 The Good More stylish and more options\nImproved battery life and audio\nCan use with multiple devices The Bad Bass still isn’t great and audio leaks\nDoes less or sounds not as good as others in this category\nAlexa still isn’t the best assistant when you’re on the go\nPricey for the category $315 at Amazon How we rate and review products\nAmazon isn’t straying too far from that formula with these third-gen Echo Frames. The big thing now is that they’re lighter, the battery lasts longer, the bass is more bassy, and they look a lot more stylish than previous iterations. I don’t think that’s enough to turn the Echo Frames into a must-have gadget — but it’s a half-step in the right direction.\nStrike a pose\nIt’s a big deal that Amazon’s latest Echo Frames look nicer than before. Style is one of the most underrated criteria for smart glasses, and put simply, you’re just not going to wear something that makes you look like a dweeb. Everyone’s face and vision is different, and a successful pair of smart glasses is going to account for that by offering a wide range of styles, colors, and fits.\nIt’s a vibe.\nWith the third-gen Echo Frames, you can choose between clear, prescription, blue light filtering, and sunglass lenses. They also come in multiple shapes, including round, cat eye, square, rectangle, and “modern” rectangle. These start at $269.99 for the most basic clear lenses, $299.99 for blue light filtering lenses, and $329.99 for sunglasses.\nThese are all subtler options, but if you like a flashier style, Amazon is also continuing its partnership with Carrera. That extra pizzazz comes with a heftier price tag. The Cruiser (the one I have) and Sprinter model will both set you back $389.99. The latter is more of a boxy, Wayfarer-esque frame and gives you the option of sunglass or blue light filtering lenses.\nI have a low nose bridge, so I had to keep pushing these up after a few seconds.\nBecause the Cruiser only comes with sunglass lenses, I wore these during my commute and on outdoor walks. They are a vibe. I’ve been described as channeling Yeezy, a Kardashian reject, a card-carrying member of the Jersey Shore mafia, and a time traveler from the ’80s. I most definitely have turned heads while on the street. I had fun wearing these, and most folks could pull this off so long as they put a little swagger in their step — but personally, this isn’t the style I’d pick for my day-to-day sunnies, mostly because they didn’t fit my face well. While these are made of a lightweight acetate weighing 46.3g, I have a low nose bridge, and these were slipping down my face every five seconds. The other thing I didn’t love about the Cruiser glasses was the build quality. While they look high fashion, they feel plasticky in my hands and not befitting of their nearly $400 price tag.\nForget the bass\nAs I said, these are less smart glasses than they are a pair of open-ear headphones. On that front, the Echo Frames are alright for the category but are nothing mind-blowing.\nBass is purportedly three times better on the new Echo Frames, but they’re still not going to bring the thump of even standard AirPods. I’ve been listening to a lot of Stray Kids lately, and Felix’s TikTok-breaking rumbly baritone is absolutely lost on these. In God’s Menu, the song’s famous “cookin’ like a chef I’m a 5-star Michelin” line is reduced to zero-star Michelin. On a loud train, I couldn’t even hear it despite turning the volume up to the max.\nThis isn’t a problem limited to the Echo Frames — it’s a common problem with any open-ear audio headphones. That said, the same song on the Meta smart glasses sounded a bit richer. These were a lot better for podcasts or less bass-heavy songs, but you still can’t get away from the feeling like you’re listening to something from a few feet away instead of right next to your ear.\nI don’t love the charging stand, but battery life has been improved.\nAt the same time, there’s a fair amount of audio leakage. No one asked me to turn things down while I was commuting. Trains and city noises are loud. But at the same volume in the office, all of my co-workers could hear that I was listening to something. They might not have been able to discern the song, but it was loud enough to be distracting.\nAs for call quality, these were good enough. I called a friend during an hour-long walk, and she was able to hear me despite beeping trucks and wind. In her words, I sounded “echo-y,” and she could hear a lot of the ambient noise around me, but at no point was she unable to hear me. I do like that you can pair the glasses to multiple devices and have them switch between the two — that’s something the Ray-Ban Meta Smart Glasses weren’t really capable of. However, this is only useful if you’re getting clear glasses, as you shouldn’t be wearing sunglasses indoors while on your laptop.\nThe right side has two action buttons. The volume rocker is on the left side. You can also see some of the directional speakers and mics.\nThe controls are at least easy to navigate. On the left arm, you’ve got a self-explanatory volume rocker. (Though, I found myself reaching for the volume rocker on my phone far more often. Habits are hard to break, especially if you often have your phone in hand anyway.) On the right side, there are two action buttons that you can use to take or decline calls, put the device into pairing mode, or mute Alexa. If you press the back action button twice, you can launch a personalized playlist on the music streaming service of your choice. For me, I’d think that’d be a list full of K-pop and sad indie artists like Phoebe Bridgers and Mitski. Instead, the glasses played a list full of artists I didn’t know and songs that I would never listen to.\nLike I said, these are more headphones than smart glasses.\nAlexa on your face\nThe main thing that’s supposed to set the Echo Frames apart is the fact that they have Alexa built in. My problem here is that Alexa has never been and still isn’t a particularly good voice assistant when you’re on the go. It’s fine at answering odd queries, setting timers, and telling you the weather — but it’s much better at controlling your smart home than replacing Siri or Assistant.\nIt’s not that you can’t do things. You can now use this to make non-Alexa calls and, if you have an Android phone, reply to text messages. Directions are also possible, but it’s clunky. Alexa told me I’d get a notification on my phone to start... but that meant tweaking my notification settings to a less preferred option. When I did get it working, it suggested I go to Bowling Green in Kentucky instead of the Manhattan train station five minutes away. Most things are still just easier (and faster) on my phone. As a result, I didn’t have a lot of reasons to actually use Alexa on these glasses. That was only exacerbated by the fact that I had a pair of sunglasses instead of regular glasses.\nIt relies on your phone for a connection, and that’s a pro and a con. So long as you have a stable Bluetooth connection and your phone has signal, you can use Alexa reliably while on the go. On the flip side, you don’t have much offline usability on that front. Plus, you need to make sure the Alexa app is always open and running in the background.\nIt says to just ask Alexa, but I didn’t find much to ask beyond the weather and timers.\nEven so, it’s just weird to say “Alexa” in public. (You can change the wake word to Echo if that feels better, but for me, it did not.) This is an issue I have with nearly every pair of smart glasses with some kind of voice assistant. Earbuds are a visual and cultural signal that we all implicitly understand. If I’m talking to midair with AirPods in, you can be confident I’m on a call. Me talking to myself with no phone or AirPods in sight got me some odd looks from strangers — and confused looks from some of my friends.\nIn terms of notifications, I like that you have some control over when you get notified. There’s a VIP Filter you can curate so that only select apps and contacts will notify you. The glasses will play a sound whenever you get a notification, and then you can pull your phone out to check. It won’t read your texts, but I appreciate that. I don’t love it when Siri takes 10 years to read out the URL to a funny link my friends send me, for instance. It does mean you have to be ruthless when setting up your VIP list, however.\nYou can set a VIP Filter to curate your notifications, but it’s best to be ruthless here since you only hear a ping.\nFor testing purposes, I did try issuing a few Alexa commands while I had these at home. I was pleasantly surprised that it didn’t trip up any of my Echo speakers. There is a feature where you can ask any Echo speaker you have to locate your Frames. That’s nice, but at the same time, I doubt it’s something most people will frequently use. As a lifelong glasses wearer, mine are always either in a case or on my nightstand because. I have a specific drawer for sunglasses. Plus, this feature relies on your glasses having a decent charge.\nSpeaking of charge, these held up well over the past week. My commute is around 60–80 minutes, depending how much the MTA wants to test me. I’ve gotten about five hours of media playback and calls thus far and have about 30 percent battery left. Meanwhile, a roughly 50-minute call drained the battery about 20 percent. Charging from zero to 100 percent takes about 2.5 hours, though I’m not a big fan of the charging stand’s design. It took me a hot second to figure out that you’re supposed to place them on the stand vertically so that the lenses are pointed straight up at the ceiling. The way the stand is designed, I’d expected you’d plop them in horizontally. I missed the charging case of Meta’s smart glasses, which killed two birds with one stone and was a much more elegant charging solution overall.\nPay more for less\nIf you’re a heavy Alexa user, I can see paying the $270 for the base model and maybe using FSA or HSA funds if you need prescription lenses. But while I like the look of the Carrera Cruiser model, this is not nearly $400 worth of tech and style, especially not when the Ray-Ban Meta Smart Glasses start at $299 — a mere $30 more than the cheapest Echo Frames. Those get you better build quality, a surprisingly good hands-free camera for photos and video, the ability to livestream to Instagram, better audio quality, and a much better mic. Those get you the option of transition lenses, too, though the third-gen Echo Frames are at least on a similar playing field when it comes to style. Likewise, the Bose Frames Tempo and Soprano have a retail price of $249 — and can be found on sale for around $200. Those have similar battery life and better sound quality.\nAudio definitely leaks on these in quieter spaces.\nThese make some small moves in the right direction. Again, improving the range of available styles was a much-needed change. It’s good to beef up the audio, but it wasn’t enough of a change to make these stand above the competition or a compelling alternative to wireless earbuds. But perhaps most crucially, I wasn’t convinced to use Alexa more than I otherwise would have. As it stands, I think Amazon’s getting there with form. It’s just not quite there with function.\n\nThis article, authored by Victoria Song, was published by The Verge on 2023-12-07 under the category 'technology'.\n\n","id":431}
{"title":"Best sports betting promo codes for college basketball: Claim $5,000+ in bonuses from Caesars Sportsbook, BetMGM, Bet365, FanDuel, DraftKings, BetRivers","context":"## Best sports betting promo codes for college basketball: Claim $5,000+ in bonuses from Caesars Sportsbook, BetMGM, Bet365, FanDuel, DraftKings, BetRivers\n\nWe've got the best sports betting promo codes for college basketball games including tonight's top-20 matchup between Tennessee vs. North Carolina in the ACC-SEC Challenge. Here's your chance to claim $5,000+ in bonuses as a new user from Caesars Sportsbook, BetMGM, Bet365, FanDuel, DraftKings, and BetRivers.\nUse our exclusive sports betting promo codes to unlock thousands of dollars in bonus bets for all of this week's CBK games (offers may vary among states):\nTop Sportsbook Bonuses Offer Promo Code Caesars Sportsbook Get $1,000 First Bet on Caesars NEWS1000 BetMGM $1,500 First Bet + $50 bonus bet TSN50 Bet365 First Bet Safety Net up to $1,000 OR Bet $5, Get $150 in bonus bets TSNCO FanDuel Bet $5 on any moneyline, Get $150 in bonus bets if your team wins Click to claim DraftKings Up to $1,200 in welcome offers Click to claim BetRivers 2nd chance bet up to $500 SPORTSRIV\nThe ACC-SEC Challenge continues today with seven games starting with No. 7 Tennessee vs. No. 14 North Carolina. Duke vs. Arkansas is another marquee matchup on tonight's slate of CBK games.\nClaim thousands in sports betting bonuses for college basketball games with these promo codes and links\nTop-rated sportsbooks -- BetMGM, Bet365, FanDuel, Caesars Sportsbook, DraftKings and BetRivers -- make it worth your while when signing up as a new user to the tune of $5K+ in bonus bets!\nClick our links to activate the best sports betting bonuses in the industry and register your sportsbook accounts now!\nCaesars Sportsbook promo code NEWS1000 for $1,000 First Bet on Caesars for Volunteers vs. Tar Heels\nCaesars Sportsbook promo code NEWS1000 gives new users a First Bet up to $1,000 on Caesars!\nStart by clicking our Caesars Sportsbook promo code link and sign up for a new account. If your first bet loses, Caesars will credit your account with bonus bets in the amount of your wager up to $1,000.\nClick to claim: Caesars Sportsbook promo code NEWS1000 for First Bet up to $1K on Caesars\nBetMGM bonus code TSN50 unlocks $1,550 in bonus bets for Blue Devils vs. Razorbacks\nUse our exclusive BetMGM bonus code TSN50 to claim a First Bet bonus of up to $1,500, and a $50 bonus bet for customers in select states.\nClick our BetMGM bonus code link and register for your new account with promo code TSN50 to unlock this bonus.\nThis offer requires a minimum $10 deposit, but you can deposit up to the amount of your first bet to $1,500 to maximize your potential winnings. If your first bet on the app loses, BetMGM will refund your account with bonus bets in the amount of the original wager up to $1,500.\nThe extra $50 bonus bet offer is not available in Washington D.C., Kentucky, Mississippi, Nevada, New York, Puerto Rico and Ontario. Customers in those areas can use BetMGM bonus code SPORTSPICK for the $1,500 First Bet offer.\nBet CBK games here: $1,550 in bonus bets with BetMGM bonus code TSN50\nBet365 bonus code TSNCO for First Bet Safety Net up to $1,000 or Bet $5, Get $150 in bonus bets for ACC-SEC Challenge games\nNew customers at Bet365 have their choice of promo offers when using Bet365 bonus code TSNCO. The First Bet Safety Net protects your initial wager up to $1,000!\nYou can also choose the Bet $5, Get $150 in bonus bets offer. Both of these promos can be used to bet on any CBK games including tonight's ACC-SEC Challenge matchups!\nUse Bet365 bonus code VATSN in Virginia or NJTSN in New Jersey.\nClaim here: Bet365 bonus code TSNCO for promo of your choice\nFanDuel promo code for Bet any $5 moneyline, Get $150 in bonus bets if your team wins in CBK game\nFanDuel has a new offer when using our exclusive FanDuel promo code link. Bet $5 on any moneyline, and Get $150 in bonus bets if your team wins!\nIt's important to note that there are no odds restrictions, so it'd be prudent to bet a big favorite over an outmatched underdog on the CBK schedule. You need to win the wager to receive $150 in bonus bets.\nBet now: FanDuel promo code for Bet $5 on any moneyline, Get $150 in bonus bets if your team wins\nDraftKings promo code scores $1,200 in bonus bets for Tennessee vs. North Carolina odds\nUse our DraftKings promo code link to unlock $1,200 in bonus bets for Tennessee vs. North Carolina! DraftKings offers new users a 20% deposit match up to $1000, $50 Bonus Bet with $5 deposit + Bet $5, Get $150 in Bonus Bets promo. All customers will also receive a \"No Sweat SGP\" daily!\nRegistering at DraftKings is simple, and so is claiming $1,200 in bonus bets.\nStart by clicking on our exclusive DraftKings promo code link\nRegister as a new user by supplying personal info including your name, email, last four of your SSN#, and mailing address\nDeposit $5 to activate $50 bonus bet\nBet $5 and Get $150 in bonus bets\nTo max out DraftKings' deposit match at $1,000, make a minimum deposit of $5,000 and meet the 25X playthrough requirement.\nClaim here: DraftKings promo code for $1,200 in bonus bets\nBetRivers promo code SPORTSRIV unlocks 2nd chance bet for CBK games including Duke vs. Arkansas\nThe BetRivers promo code SPORTSRIV gives new users a 2nd chance bet up to $500 depending on your state.\nIf your first bet settles as a loss, BetRivers will refund your account in bonus bets. For example, if you bet $100 on Duke and it fails to cover against Arkansas, BetRivers will credit your account with $100 in bonus bets.\nClaim here: BetRivers promo code SPORTSRIV for 2nd chance bet up to $500\nUse sports betting promos and bonuses on Tennessee vs. North Carolina odds: Spread, moneyline & total\nCheck out live odds for Volunteers vs. Tar Heels across the sports betting industry:\nADD metabet game tile code here when it becomes available\nThis is another huge game for North Carolina, which lost to Villanova in OT and beat Arkansas down to wrap up Battle4Atlantis play in the Bahamas last week. UNC thrives with its fast-paced offense. Consider a bet on the home team or the OVER here.\nCompare and contrast: Caesars Sportsbook vs. DraftKings | BetMGM vs. FanDuel | Caesars vs. BetMGM\n\nThis article, authored by Kris Johnson, was published by Sporting News on 2023-11-29 under the category 'sports'.\n\n","id":432}
{"title":"College Bowl Odds, Spreads, Money Lines and Totals - NCAAF 2023 Bowl Season","context":"## College Bowl Odds, Spreads, Money Lines and Totals - NCAAF 2023 Bowl Season\n\nCollege Bowl odds are posted at the best college football betting sites. Along with game odds, sportsbooks will offer a wider variety of prop bets to match the hype surrounding College Bowl odds, the College Football Playoff, and National Championship games.\nBowl season had been going the way of the underdog up until Tuesday’s triple header. All three favorites won straight up and ATS; the OVER was 3-0 on the day.\nBettors could be seeing a new trend developing; we’ll find out Wednesday, starting with the Military Bowl at 2 p.m. ET. Let's review the odds for some of the upcoming games and the CFP Semifinals.\nLatest College Bowl odds\nMilitary Bowl Presented by GoBowling.com: Virginia Tech vs. Tulane\nThe game will take place at the Navy-Marine Corps Memorial Stadium in Annapolis, MD. Kickoff is scheduled for 2 p.m. ET on Wednesday, Dec. 27. The game will be broadcast on ESPN.\nFor more on the Military Bowl click here!\nDuke’s Mayo Bowl: UNC vs. West Virginia\nThe game will take place at Bank of America Stadium in Charlotte, NC. Kickoff is scheduled for 5:30 p.m. ET on Wednesday, Dec. 27. The game will be broadcast on ESPN.\nFor more on the Duke's Mayo Bowl click here!\nDIRECTV Holiday Bowl: Louisville vs. USC\nThe game will take place at Petco Park in San Diego, CA. Kickoff is scheduled for 8 p.m. ET on Wednesday, Dec. 27. The game will be broadcast on FOX.\nFor more on the Holiday Bowl click here!\nTaxAct Texas Bowl: Texas A&M vs. Oklahoma State\nThe game will take place at NRG Stadium in Houston, TX. Kickoff is scheduled for 9 p.m. ET on Wednesday, Dec. 27. The game will be broadcast on ESPN.\nFor more on the Texas Bowl click here!\nWasabi Fenway Bowl: SMU vs. Boston College\nThe game will take place at Fenway Park in Boston, MA. Kickoff is scheduled for 11 a.m. ET on Thursday, Dec. 27. The game will be broadcast on ESPN.\nFor more on the Wasabi Fenway Bowl click here!\nBad Boy Mowers Pinstripe Bowl: Rutgers vs. Miami\nThe game will take place at Yankee Stadium in Bronx, NY. Kickoff is scheduled for 2:15 p.m. ET on Thursday, Dec. 27. The game will be broadcast on ESPN.\nFor more on the Bad Boy Mowers Pinstripe Bowl click here!\nPop-Tarts Bowl: North Carolina State vs. Kansas State\nThe game will take place at Camping World Stadium in Orlando, FL. Kickoff is scheduled for 5:45 p.m. ET on Thursday, Dec. 27. The game will be broadcast on ESPN.\nFor more on the Pop-Tarts Bowl click here!\nValero Alamo Bowl: Arizona vs. Oklahoma\nThe game will take place at the Alamodome in San Antonio, TX. Kickoff is scheduled for 9:15 p.m. ET on Thursday, Dec. 27. The game will be broadcast on ESPN.\nFor more on the Alamo Bowl click here!\nCollege Bowl game results\nFavorites are 11-11 SU, 7-15 ATS.\nThe Over is 13-9\nMyrtle Beach Bowl: Georgia Southern 21 Ohio 41\nCricket Celebration Bowl: Howard 26 Florida A&M 30\nR+L Carriers New Orleans Bowl: Jacksonville State 34 Louisiana-Lafayette 31 (OT)\nAvocados From Mexico Cure Bowl: Miami (OH) 9 Appalachian State 13\nIsleta New Mexico Bowl: New Mexico State 10 Fresno State 37\nStarco Brands LA Bowl: UCLA 35 Boise State 22\nRadiance Technologies Independence Bowl: Cal 12 Texas Tech 34\nFamous Toastery Bowl: Western Kentucky 38 Old Dominion 35\nScooter’s Coffee Frisco Bowl: UTSA 35 Marshall 17\nRoofClaim.com Boca Raton Bowl: USF 45 Syracuse 0\nUnion Home Mortgage Gasparilla Bowl: Georgia Tech 30 UCF 17\n76 Birmingham Bowl: Troy 10 Duke 17\nCamelia Bowl: Arkansas State 19 Northern Illinois 21\nLockheed Martin Armed Forces Bowl: James Madison 21 Air Force 31\nFamous Idaho Potato Bowl: Georgia State 45 Utah State 22\n68 Ventures Bowl: South Alabama 59 Eastern Michigan 10\nSRS Distribution Las Vegas Bowl: Utah 7 Northwestern 14\nEasyPost Hawai’I Bowl: Coastal Carolina 24 San Jose State 14\nQuick Lane Bowl: Minnesota 30 Bowling Green 24\nSERVPRO First Responder Bowl: Texas State 45 Rice 21\nGuaranteed Rate Bowl: Kansas 49 UNLV 36\nCFP Semifinal odds\nRose Bowl presented by Prudential: Alabama vs. Michigan\nThe game will take place at the Rose Bowl in Pasadena, CA. Kickoff is scheduled for 5 p.m. ET and the game will be broadcast on ESPN.\nFor more on the opening lines for the Rose Bowl click here! Interested in Touchdown props? Click here!\nAllstate Sugar Bowl: Texas vs. Washington\nThe game will take place at the Caesars Superdome in New Orleans, LA. Kickoff is scheduled for 8:45 p.m. ET and the game will be broadcast on ESPN.\nFor more on the Sugar Bowl opening lines click here! For more on Sugar Bowl TD props click here!\nCollege Football Playoff National Championship odds\nHere are the latest odds to win the college football national title. If you see odds you like, click them to visit the corresponding sportsbook, open an account, and start betting.\nWhat bets can I make on the CFP and bowl games?\nBecause of football’s popularity at top online betting sites, most bowl games will feature expanded selections of betting markets. These are the common college football betting lines:\nBowl game moneylines: The moneyline is the simplest bet you can make on a college football bowl game. Your only responsibility is to choose which team you believe will win. The favorites are indicated by negative odds, while the underdog will have positive odds.\nThe moneyline is the simplest bet you can make on a college football bowl game. Your only responsibility is to choose which team you believe will win. The favorites are indicated by negative odds, while the underdog will have positive odds. Bowl game point spreads: In point spread betting, you’re wagering on the game with a spread factored in. The favorite must win by the point spread or more, while the underdog needs to either lose by fewer points than the spread or win the game outright.\nIn point spread betting, you’re wagering on the game with a spread factored in. The favorite must win by the point spread or more, while the underdog needs to either lose by fewer points than the spread or win the game outright. Bowl game totals: The totals bet, commonly known as the over\/under, requires you to determine whether the combined score of both teams will end up over or under a predicted total. With this bet type, you’re not concerned with which team wins or loses the game.\nThe totals bet, commonly known as the over\/under, requires you to determine whether the combined score of both teams will end up over or under a predicted total. With this bet type, you’re not concerned with which team wins or loses the game. Bowl game props: These can be team or individual player prop bets, such as which team is winning at halftime or the total number of receptions a player collects. Consider them side bets made with the sportsbook about events or statistical milestones that happen in the game.\nThese can be team or individual player prop bets, such as which team is winning at halftime or the total number of receptions a player collects. Consider them side bets made with the sportsbook about events or statistical milestones that happen in the game. Bowl game parlays: Parlays are multi-leg bets on a single bet slip. All parts of the parlay must be successful for the bet to win. These offer larger payouts, but the chances of winning compared with those of an individual bet are greatly reduced.\nHow to bet on college football bowl games\nBetting on NCAA football bowl games has never been easier, thanks to online betting sites sprouting up across the country.\nCreate an account with any of the best sports betting apps to start betting. It’s a quick process. Below, we outline the steps for opening your own account.\nChoose your sportsbook: If you’re not sure which sportsbook is the right fit for you, browse our reviews to see the pros and cons of each, as well as the current offerings for new customers. When you find the sportsbook that best suits your needs, simply click on a link from our site to visit the homepage of your chosen sportsbook. Register for an account: On the homepage, you’ll find a button that says “sign up” or “register.” Once you click that, you’ll be taken to a form for providing personal information such as your name, birth date, email address, and the last four digits of your Social Security number. You’ll also be required to accept the sportsbook terms and conditions, which we recommend you read. Collect your welcome bonus: As a new customer, you’ll receive a welcome bonus. This varies from sportsbook to sportsbook, so do some homework before deciding where you want to register. Read through the playthrough requirements for any sports betting bonus or promo so you’re aware of any restrictions it may involve. Make a deposit: Now that you have an account, you need to fund it by making a deposit with the sportsbook. Online betting sites have a variety of ways you can fund your account or make withdrawals. Start betting: Now, you can place a bet. Simply click on a bet to add it to your bet slip, adjust how much you want to wager, and then finalize your bet.\nSee more:\nWhat is the College Football Playoff?\nThe College Football Playoff starts with the New Year’s Six bowl games, of which two act as semifinal games to determine which teams will play in the National Championship.\nThose six games, also known as the NY6, include:\nRose Bowl Game presented by Capital One (Pasadena, California)\nAllstate Sugar Bowl (New Orleans, Louisiana)\nPlayStation Fiesta Bowl (Glendale, Arizona)\nChick-fil-A Peach Bowl (Atlanta, Georgia)\nGoodyear Cotton Bowl Classic (Arlington, Texas)\nCapital One Orange Bowl (Miami Gardens, Florida)\nThese six games are the most iconic and important bowl games in all of college football and usually invite the top-rated teams in the country to play. Currently, two of them, on a rotating basis, act as the semifinal games for the CFP.\nHowever, that will expand to include quarterfinal games as of the 2024-25 season when the CFP expands to a 12-team format.\nHow does a team qualify for the NY6 bowl games?\nA selection committee ranks the best four teams in the country and selects them for the College Football Playoff semifinal games. Those teams compete for a chance to play in the National Championship.\nThe other four NY6 bowl games are typically given to champions from the Power Five conferences and the top-rated teams and champions from the Group of Five conferences.\nWhat is the College Football Playoff National Championship?\nThe CFP National Championship is the final game in the NCAA Division I Football Bowl Subdivision season, crowning the country’s best team. The winners of the two CFP semifinal games square off in this contest, usually slated for a Monday in early January.\nThe game, which started in 2014 after replacing the Bowl Championship Series, attracts millions of viewers. That popularity also makes it one of the most-wagered-on sporting events in the country.\nThe championship games are scheduled as follows for the next few years:\n2023-24: Jan. 8 in Houston\nJan. 8 in Houston 2024-25: Jan. 20 in Atlanta\nJan. 20 in Atlanta 2025-26: Jan. 19 in Miami\nAgain, you can see the schedule being pushed later into January once the CFP field expands to 12 teams in 2024-25.\nWhich schools have won the CFP National Championship?\nThe College Football Playoff National Championship has been taking place since 2015. Here are the previous winners.\n2022-23 season: Georgia Bulldogs\nGeorgia Bulldogs 2021-22 season: Georgia Bulldogs\nGeorgia Bulldogs 2020-21 season: Alabama Crimson Tide\nAlabama Crimson Tide 2019-20 season: LSU Tigers\nLSU Tigers 2018-19 season: Clemson Tigers\nClemson Tigers 2017-18 season: Alabama Crimson Tide\nAlabama Crimson Tide 2016-17 season: Clemson Tigers\nClemson Tigers 2015-16 season: Alabama Crimson Tide\nAlabama Crimson Tide 2014-15 season: Ohio State Buckeyes\nCollege bowl games FAQ\nHow many college bowl games are there annually?\nThe bowl game season lasts three weeks and consists of 43 games, including the NCAA football national championship.\nWhat are the New Year’s Six bowl games?\nThe New Year’s Six is a series of high-profile bowl games. They include:\nRose Bowl Game presented by Capital One (Pasadena, California)\nAllstate Sugar Bowl (New Orleans)\nPlayStation Fiesta Bowl (Glendale, Arizona)\nChick-fil-A Peach Bowl (Atlanta)\nGoodyear Cotton Bowl Classic (Arlington, Texas)\nCapital One Orange Bowl (Miami Gardens, Florida)\nWhat is the best time to bet on the College Football National Championship?\nChoosing when to bet on the NCAA football national championship comes down to risk versus reward. Making your bets when the lines are first released gives you the best odds and potential winnings but with precious little information.\nYou might back a team that’s clearly not going to win by Week 4.\nThe longer you wait, the clearer the picture becomes, thanks to data and team performance, but the odds tighten up because sportsbooks are using that same information to make adjustments. You’ll have a more educated choice, but the odds will be less favorable and your payout smaller.\n\nThis article, authored by Travis Pulver, was published by Sporting News on 2023-12-15 under the category 'sports'.\n\n","id":433}
{"title":"Dear Disney: If you want to last another century, lay off the legacy","context":"## Dear Disney: If you want to last another century, lay off the legacy\n\nWalt Disney Animation’s newest movie, Wish, is the culmination of the studio’s celebration of its own centennial. That project stretched throughout 2023, through projects like the short Once Upon a Studio, specialized merchandise drops centered around each decade the company has been around, and the rebrand of the iconic Disney castle logo. But Wish leans so hard on celebrating the better Disney films that came before it that it doesn’t have much identity of its own. It’s openly a nostalgia-fest, pretty much on par with the other ways the company celebrated its 100-year anniversary.\nIn 2023, Disney drilled in harder than ever on looking admiringly at its own history. And why shouldn’t it? The company has a full century of beloved movies, characters, and storytelling to mine for big emotion. Even people who’ve outgrown Disney probably still have residual fondness for at least one of the animated movies they watched in their youth. But nostalgia-bait isn’t limited to Disney’s big birthday celebration: It’s basically what the company has been selling for decades now.\nWhile living in and echoing its own past has been profitable for Disney, it isn’t sustainable. And ultimately, harping so hard on its own glory days is pretty antithetical to Disney’s legacy. In order to move forward, it needs to shed the nostalgia — or at least not make it the company’s primary selling point.\nNostalgia is safe\nFrom a moneymaking standpoint, it’s easy to see why Disney sticks to legacy-linked projects: They’re all but guaranteed to make bank. Disney’s live-action remakes and sequels consistently get mixed to poor reviews, but they make hundreds of millions of dollars. People will pay to see their faves on screens again, or to try to share their happy childhood memories with their own children.\nAt least, they will until they get tired of the diminished returns. The live-action remakes might make a lot of money in the short run, but all they’re really doing is reiterating what Disney has done in the past, without meaningfully adding to the original movies’ legacy.\nRemember the Disney sequel era? When Disney pumped out cheap direct-to-home-video titles based on every beloved Disney movie from The Fox and the Hound to The Lion King? Disney tries not to. After John Lasseter took over as Disney’s chief creative officer in 2006, he canned the whole DTV department a year later, reportedly denouncing the way cheaply made sequels diminished the Disney brand. Even though Disney loves to celebrate its past, the studio rarely references this era.\nEven with a much higher budget and flashier visuals, the live-action remake fad Disney has been riding for the past decade is still contributing to the feeling of nostalgia oversaturation. And the studio’s many spinoffs and reboots don’t help, either. Some of these legacy projects have been good, but even so, the sheer volume of them just doesn’t seem built to last.\nOne of the most recent Disney live-action projects announced is a rendition of 2016’s animated hit Moana — a great movie that hasn’t even really had a chance to build its own legacy. The kids who watched it when it first came out are mostly still kids. But Disney is now assuming that anything it makes will have an instant legacy, without actually letting the nostalgia naturally brew on its own.\nDisney’s brand management of Star Wars, Marvel, Fox, the Muppets, and a host of other properties only emphasizes this oversaturation. The Disney empire stretches far and wide these days, and characters like Baby Yoda and Tony Stark sit alongside Mickey Mouse and Cinderella in theme parks, on Disney Plus promotional material, and on Bob Iger’s X header. Disney plays up “Disney Magic” as part of its brand. But when every major franchise in America is lumped together as Disney magic, what’s left?\nInnovation is Disney’s real legacy\nOver the past 100 years, Disney has taken some big, risky swings, and has fumbled many, many times. From the dark and dreary Black Cauldron, which almost bankrupted the studio in 1985, to the off-kilter adventure movies of the early 2000s, the studio’s mold-breaking passion projects have often been megaflops. But at the same time, some of the company’s most memorable movies have stemmed from these risks.\nThe original 1940 Fantasia was one of Walt Disney’s most ambitious passion projects turned box-office failures, but the Sorcerer Mickey short is as iconic as the mouse himself. Lilo & Stitch was so damn weird that the filmmakers basically hid it from the rest of the company; it ended up making back more than three times its budget, and more importantly, turning Stitch into one of the studio’s most memorable characters. And even The Little Mermaid, the film that kickstarted the Disney Renaissance, was a risk; a big Broadway-style musical of its type just hadn’t been done in animation before.\nAfter all, Walt Disney himself famously pushed for progress and innovation, especially in the studio’s creative endeavors, even when that translated into poor financial decisions. What’s made his studio so special over the past century is how it’s looked forward, trying new things even in the face of failure and taking chances that other production houses couldn’t afford or risk. The company’s biggest legacy isn’t the princesses, the theme parks, or even Mickey Mouse: It’s how all those elements started out as daring projects that no one else was doing.\nAnd yet Disney and its fans apparently keep forgetting that, and keep clinging to the past with such ardor that it does their idol’s legacy a disservice.\nThere’s a time and place for the past\nNostalgia isn’t a bad thing, nor is it entirely at odds with Walt Disney. Even in his quest for innovation, Walt was a nostalgic guy who idealized “the good old days,” to the point where he modeled the entrances of his theme parks after how his hometown looked at the turn of the 20th century. I, certainly, am not immune to Disney nostalgia. I love Disney. I have multiple Disney-themed plushies. I teared up when I watched Once Upon a Studio. I launched an entire yearlong content package so I could celebrate Disney.\nBut nostalgia is a potent ingredient, and it works best in the Disney recipe for success when it’s on the side: in celebratory shorts, theme-park parades, and collectible merchandise. Not when it’s the main offering. For most of the past century, Walt Disney Studios was a movie studio first, and a storefront, streaming service, and theme-park empire second.\nIt feels like that balance has shifted over the last decade. And if Disney wants to last another century, and make things that actually spark new nostalgia down the line, it should go back to embracing fresh, different ideas.\nHardcore Disney fans aren’t always keen on new things. They cry out for a return to their favorites, the memory of watching a Disney movie for the first time. Maybe that means demanding animated Disney movies have proper villains again. Maybe it means asking for more musicals — or fewer of them. Maybe it’s lamenting the loss of traditional 2D animation. Maybe it’s specifically missing the animated musical sequences of the Disney Renaissance. There are even people who yearn for a return to the animal-focused movies of the 1970s. Whatever that Disney draw is, it’s different for every single person.\nAnd because Disney fans have so many separate, individualized desires, it’s impossible for the company to focus on meeting every single one of them. Besides, more often than not, even though people cry out for the good old days, what they’re really missing is the feeling of discovering something new — that first viewing of a movie that will become a lasting favorite. Trying to check off all the items on a checklist that doesn’t even really describe what people want… that doesn’t make good movies. It barely makes tolerable ones.\nWith 100 years of creative life under its belt, Walt Disney Studios has a lot to be proud of. But Mickey Mouse didn’t become a staple overnight. Before Mickey was an icon, before the Disney Princess brand was even a thing, before Disney owned a million other entertainment companies, Disney filmmakers were trying daring things, while making a lot of costly mistakes along the way. But each of those mistakes was an opportunity, a legacy of its own that helped usher in the great movies the studio is known for.\nThat’s not a message that executives and shareholders want to hear. But you don’t get to a hundred-year legacy by playing it safe. You need to have faith and trust in storytelling, in the creative minds behind the great movies, in the power of progress. And a little pixie dust doesn’t hurt, either.\n\nThis article, authored by Petrana Radulovic, was published by Polygon on 2023-12-12 under the category 'entertainment'.\n\n","id":434}
{"title":"Twitch is the best way to watch sports, when you can actually watch sports on Twitch","context":"## Twitch is the best way to watch sports, when you can actually watch sports on Twitch\n\nTwitch is the best way to watch sports, when you can actually watch sports on Twitch\nShare All sharing options for: Twitch is the best way to watch sports, when you can actually watch sports on Twitch\nNeed a new way to watch sports? Twitch might be exactly what you’ve been looking for.\nIt’s no secret that fans have historically consumed sports through live events and cable TV, but as media consumption has shifted, many — especially in younger generations — have sought out sports content on social platforms.\nTwitch in particular has become a platform where sports streamers and fans have flocked. During the COVID-19 shutdowns in 2020, athletes and sports leagues around the world joined the platform to stream video games when live sports were temporarily on hiatus — and years later, some of them are still active. WNBA player Aerial Powers regularly streams herself playing games like NBA 2K and Apex Legends, while Argentinian former soccer player Sergio Agüero uses his channel to livestream Kings League and Queens League games. Organizations like the NBA, the NFL, and the UFC have their own Twitch channels where they promote and share content. For instance, the UFC runs watch-along streams hosted by former mixed martial artist, boxer, and kickboxer Jens Pulver.\nPolygon is celebrating TwitchCon 2023 with a package of stories covering streaming trends and news from the show. Check it out!\nIn recent years, Twitch has introduced a TwitchSports channel as well as a stand-alone sports category to help users find live sporting events and sports-related content. On the stand-alone sports category page — which, as of publication, has 2.7 million followers — users can find creators commentating and analyzing various sports, reaction and watch-along streams, some live sports feeds, and streams of creators playing sports video games. Take a look and you’ll see everything from motorsports and soccer to tennis, volleyball, and even pickleball.\nEnterpriseAppsToday reported that in 2023, Twitch’s “Sports” category registered around 8 million hours of watch time. YPulse survey research from April found that 66% of Gen Zers are tuning into platforms like Twitch to follow their favorite sports. “In contrast to the more spectator-oriented sports watching of earlier generations, Gen Z has evolved the experience into an interactive digital experience through social and streaming platforms,” says Anastasia Pelot, YPulse’s content marketing manager.\nWhile livestreams of major league games are less common to find on Twitch due to broadcast rights, some leagues — nationally and globally — have experimented with streaming games in recent years. The NBA signed a deal with Twitch in 2017 to stream minor league games while giving fans the chance to interact with each other. The two also teamed up in 2019 for a separate deal to exclusively stream USA Basketball games globally. When Amazon began airing Thursday Night Football games last fall, Nielsen reported a total viewership figure of 13 million for its first exclusive game, which included U.S. Prime Video subscribers who streamed on Twitch.\nTwitch creator EsfandTV, who requested to go by Esfand for this story, is a streamer with 1.2 million followers who follow not only for gaming content, but for his sports streaming as well. He says that broadcast rights are one of the aspects hindering Twitch from becoming a full-blown sports streaming platform. Leagues still own the rights when it comes to where sports are aired, and Esfand says they need to adapt if they want to reach young and international sports fans.\n“The NBA is king,” Esfand says. “When it comes to hockey, the NHL is king. But what’s happening is these different leagues, they are the boss. They’re the governing body. They have all the rights to everything and when it comes to content, they can be in control.”\nEsfand says if done properly, a league can partner with a streamer that has a large audience and find a way to allow rights to reduce the barrier to entry for users. “You can’t just block it out in certain markets,” Esfand says. “When I did a stream [of a football game], I think Canada couldn’t watch. Most of Europe couldn’t watch.”\nSome leagues have partnered with streamers and have yielded successful results: LiveMode and FIFA partnered with Brazilian streamer Casimito to broadcast the 2022 World Cup on Twitch in Latin America, while the Men in Blazers podcast hosted its popular live watch-along shows for some World Cup matches in the U.S. Earlier this year, Casimito also struck a deal to stream the 2023 Women’s World Cup on his channel. The NBA also signed a deal in 2021 with Alexandre “Gaules” Borba Chiqueta and Budweiser to stream games in Brazilian markets.\n“These are the things that, if they’re done the right way, you are now attracting the younger audience who is not watching cable TV as much anymore,” Esfand says.\nIn place of regularly streaming games, Esfand has found other ways to engage with fans on his channel. Esfand’s Tailgate Tour, where he visits college towns and showcases college football culture — everything from the tailgating atmosphere to the energy inside the stadium — resonates strongly with young and global fans, especially those who might not be familiar with American college traditions.\nIn April, he livestreamed Esfand’s Draft Night Extravaganza on Twitch. The broadcast coincided with the first day of the NFL draft and featured a mix of Twitch creators like Will Neff and Erobb221 as well as current and former NFL players including Austin Ekeler, Micah Parsons, and Kenny Vaccaro, where they provided analysis and commentary on draft picks.\n“I have people that have been watching me for years playing World of Warcraft or doing something that isn’t football, but they’re actually huge football fans”\nIn some cases, fans preferred Esfand’s show to the traditional broadcast. “I havent watched or cared about football in like 10 years but i still watched this whole stream and loved it,” one viewer commented on YouTube, where the Twitch stream was uploaded after airing.\nAnother user wrote, “I love all things football and I pretty much had the draft on TV muted while watching your stream.”\nEsfand says he feels fortunate he’s been able to stream more sports content on his channel over the last few years, to the point where people have recognized him solely for his football content. He adds that it’s been interesting seeing fans evolve from those that were fans of his gaming streams to ones who are sports fans, or discovering gaming fans who are also sports fans.\n“I have people that have been watching me for years playing World of Warcraft or doing something that isn’t football, but they’re actually huge football fans,” Esfand says. “A big part of Twitch is that people like watching streamers they can relate to. Because what happens is, it’s not just about the streamer; it’s also about the streamer’s chat. Now they are getting involved in the community, whether it’s just through chat itself or through Discord.”\nAlex Casassovici, founder and CEO of Azarus, a company that works with online creators to enhance the streaming experience, says that livestreaming sports and sports-related content on platforms like Twitch creates a more intimate experience for streamers and fans alike.\n“I think what we’re looking at is either a very curated kind of managed channel, and more grassroots-like, creator-led experiences,” Casassovici says. “That’s clearly something that can be differentiated when it comes to streaming.”\nTwitch seems to see value when it comes to investing in sports streamers. A few years ago, the platform launched the Sports Accelerator Program to support sports content creators wanting to get into “sports talk,” like podcasts, talk shows, reaction streams, sidecasts, watch-alongs, and more, through live workshops and by providing opportunities to network and expand their viewership.\nU.K.-based Keira Megan, who goes by keirameganxx on Twitch and was previously part of the Sports Accelerator Program, has been on the platform for about a year and a half with a focus on soccer and motorsports like Formula 1. While Formula 1 has always been primarily popular in Europe, it’s seen growth among new fans in the United States in recent years, thanks in part to docuseries like Netflix’s Drive to Survive.\nWhile she doesn’t stream actual races or games due to broadcast rights, Megan hosts watch-along streams for fans who want to hear her commentary. Megan says that while she doesn’t have as many followers on Twitch as she does on her YouTube channel, there are elements of Twitch she prefers to YouTube, including the ability to be herself and engage with fans more closely.\n“People want to know what you want to say,” Megan says. “They come into my Twitch channel and ask me about the race. They asked me three days later about a [soccer] match. They want to talk about it. I think Twitch is good for that. I think it’s good for one-on-one. I find that Twitch is where I’m the most engaged with my audiences, and they feel closest to me.”\n\nThis article, authored by Saleah Blancaflor, was published by Polygon on 2023-10-20 under the category 'entertainment'.\n\n","id":435}
{"title":"Creation of quantum dots wins 2023 chemistry Nobel","context":"## Creation of quantum dots wins 2023 chemistry Nobel\n\nListen to this story: Have feedback on the audio version of this story? Let us know!\nTypically, matter made of the same kinds of atoms arranged in the same way has the same properties. But tiny specks called quantum dots are special. They can contain the same molecules yet have different colors and other qualities depending on their size. The ability to make a whole rainbow of quantum dots simply by tweaking their size makes the dots highly useful. They light up TV screens and help doctors see inside the body. Now, the 2023 Nobel Prize in chemistry honors three scientists who discovered and created quantum dots.\nOne of those scientists is Moungi Bawendi. He’s a chemist at the Massachusetts Institute of Technology (MIT) in Cambridge. The second winner is chemist Louis Brus. He’s based at Columbia University in New York City. The final winner is Alexei Ekimov. This physicist now works at Nanocrystals Technology, Inc., in Briarcliff Manor, N.Y.\nThe trio will split a prize of 11 million Swedish kronor, or about $1 million. The Royal Swedish Academy of Sciences announced the honor October 4.\nChemist Moungi Bawendi (left), chemist Louis Brus (middle) and physicist Alexei Ekimov (right) have split the 2023 Nobel prize in chemistry. MIT, Columbia University, Nexdot\nA new kind of material\n“Quantum dots are a new class of materials, different from molecules,” said Heiner Linke. A member of the Nobel committee, he spoke at the award announcement.\nQuantum dots are each a few billionths of a meter across. At such a tiny scale, their qualities are governed by the weird laws of quantum mechanics. Those quantum laws rule that changing the dots’ size alters their properties. That includes how the dots interact with light and electricity. It also includes their magnetic properties and at what temperature they melt.\nOne useful quality that changes with a quantum dot’s size is its color. Usually, “if you want to make different colors with molecules, you would choose a new molecule,” Linke said. That is, a new set of atoms arranged in a different structure.\nBut changing a quantum dot’s size can change its color without changing its molecules. Quantum dots give off fluorescent light of different colors when they are bathed in laser light. Smaller dots give off bluer light. Bigger dots give off redder light.\nDots of the same size made from different materials may give off slightly different colors. Quantum dots are usually made from semiconductors. Such materials include graphene, selenite or metal sulfides. By adjusting the sizes and materials of quantum dots, chemists can alter their properties for a huge range of uses.\nPossible after all\nScientists suspected that nanoparticles’ sizes could alter their properties nearly a century ago. But at the time, it seemed impossible to actually make such particles. To do that, researchers would need a material with a perfect crystal structure. They’d also have to be able to control the size of that tiny speck extremely precisely. So precisely, in fact, that they’d have to sculpt the particle one layer of atoms at a time.\nThen, in the early 1980s, Ekimov and Brus each showed this could be done. The two did not work together. Ekimov created quantum dots with glass. Adding copper chloride to the glass produced tiny crystals. Ekimov then showed that the size of those crystals was linked to the color of the glass.\nBrus made a similar discovery. He showed that there was a link between size and color for nanosize particles floating in a solution or in a gas.\nThose discoveries stirred up intense interest in how such dots could be used. But making quantum dots for specific uses would require precisely controlling the dots’ size.\nEducators and Parents, Sign Up for The Cheat Sheet Weekly updates to help you use Science News Explores in the learning environment Client key* E-mail Address* Go Thank you for signing up! There was a problem signing you up.\nA decade later, Bawendi devised a method to do just that. His technique allowed him to stop the growth of tiny crystals in a solution when they reached a desired size. Here’s how it worked. He first injected chemicals into a solution that instantly formed tiny crystals. Then, he tweaked the temperature of the solution to halt the crystals’ growth.\n“I’m deeply honored and surprised and shocked by the announcement this morning,” Bawendi said October 4. He spoke at an MIT news conference. “I’m especially honored to share this with Lou Brus,” Bawendi said of his mentor. “I tried to emulate his scholarship and his mentoring style as a professor myself when I came to MIT.”\nBawendi started working on quantum dots after meeting Brus. The two worked at Nokia Bell Labs, headquartered in Murray Hill, N.J. There, researchers needed high-quality quantum dots to study the physics of nanoparticles.\n“It wasn’t because I wanted to make the best quantum dots possible for application,” Bawendi said. “It was because we needed to make the best possible quantum dots to study them.” It took years of trial and error to work out the method.\nIn this microscope image, quantum dots light up mouse intestines. Red and green represent proteins illuminated by fluorescing quantum dots. Provided by Thermo Fisher Scientific. Image by Thomas Deerinck and Mark Ellisman\/National Center for Microscopy and Imaging Research\nApplications abound\nBawendi’s work made it possible to manufacture quantum dots with specific sizes — and therefore specific properties. This opened up a world of possible uses for the dots.\nFor one thing, quantum dots can be used to subtly change the color of LED lights. This can dramatically improve the lights’ energy efficiency.\nQuantum dots are also useful in medicine. They can be injected into the body and attached to cells from the body’s immune system. Such cells swarm cancerous tissues. By tagging the cells with fluorescent quantum dots, surgeons can spot even hard-to-see tumors inside the body.\nQuantum dots can also be tuned to absorb different colors of light. So they could be used to build solar panels that soak up sunlight well in different conditions. The dots may even be used to build quantum computers. Such computers promise to run much faster than any normal computer ever could.\nThis year’s chemistry Nobel is well-deserved, says Warren Chan. He’s a biomedical engineer and chemist at the University of Toronto in Canada. “They’re the ones who built the foundation,” Chan says of the winners. “I’m really happy that the field is getting credit for really changing the world.”\nChan and his colleagues found one of the first uses for quantum dots in the 1990s. Their group used quantum dots to tag cells in lab experiments. But the Nobel committee doesn’t just look at past impacts of a discovery, Chan notes. They also consider the effects a discovery may have in the future. And quantum dots could have a whole medley of uses not yet explored. Chan’s team, for instance, is now using quantum dots to detect infections such as flu and HIV.\n“I was absolutely thrilled to see this,” says Judith Giordan. She’s the president of the American Chemical Society. “We have three people recognized who brought this technology from a dream, a hope, a theoretical construct … all the way through synthesis and manufacture.”\n\nThis article, authored by Tina Hesman Saey, was published by Science News For Students on 2023-10-04 under the category 'science'.\n\n","id":436}
{"title":"Hottest seat on each NFC team: Buns burning for these four head coaches","context":"## Hottest seat on each NFC team: Buns burning for these four head coaches\n\nEven the Philadelphia Eagles and Dallas Cowboys – two of the NFL's best teams – have hot seats. No seats, however, may be more sizzling than those occupied by two head coaches in the NFC South, one in the NFC North and another (surprisingly) in the NFC West.\nHere is the hottest seat on each NFC team as determined by Yardbarker NFL writers.\nNFC East\nDALLAS COWBOYS | Cornerback Trevon Diggs: In September, Diggs suffered a season-ending ACL injury. His replacement, DaRon Bland, has wowed us with an NFL-record five pick-sixes. There's no way Bland can go back to slot corner in 2024, so the heat will be on Diggs next season as a probable replacement for Stephon Gilmore at left cornerback.\nNEW YORK GIANTS | Quarterback Daniel Jones: Out for the season with an ACL injury, Jones has no way to dissuade Giants ownership from taking a quarterback high in the QB-rich 2024 NFL Draft. New York can (and will) get out of his $160M contract in 2025.\nPHILADELPHIA EAGLES | Wide receiver Quez Watkins: Philadelphia’s supposed No. 3 receiver has a measly four catches for 21 yards. While he missed five games with a hamstring injury, Olamide Zaccheaus and Julio Jones combined for 132 yards receiving and three touchdowns.\nWASHINGTON COMMANDERS | Owner Josh Harris: He oversaw the controversial “Process” as owner of the Philadelphia 76ers. He’ll need a better plan this offseason when “I’m not Dan Snyder” stops working. At 4-8, the Commanders are floundering in his first season of ownership. — Bruce Ewing\nNFC West\nARIZONA CARDINALS | Quarterback Kyler Murray: The inconsistent Murray has five more games this season to prove to a new front office and coaching staff that he is the long-term answer at quarterback. If he doesn’t show them what they want to see, the Cardinals have the draft capital (including two first-round picks) to land a franchise quarterback at the top of the QB-rich 2024 NFL Draft.\nLOS ANGELES RAMS | Wide receiver Cooper Kupp: At his peak, he was one of the best offensive players in the league, but age (30) and injuries (appearing in 16 of a possible 28 games the past two seasons) have hurt his production. He has been a non-factor over the past five games (12 catches for 127 yards) while young receivers Puka Nacua and Tutu Atwell have stepped up.\nSAN FRANCISCO 49ERS | Head coach Kyle Shanahan: The 49ers have done almost everything possible under Shanahan except win a Super Bowl. Fair or not, not winning a title with a stacked roster — especially on offense (Christian McCaffrey, Deebo Samuel, Brock Purdy, George Kittle) — would be a massive disappointment. His job is in zero danger, but his rep may be.\nSEATTLE SEAHAWKS | Quarterback Geno Smith: The Seahawks passed on drafting a QB in 2023 and re-signed Smith, but he has taken a significant step back. Entering Thursday's game against Dallas, his completion percentage was down from 2022 (69.8 to 65.4 percent) despite the impressive offensive weapons around him. Seattle has an out in his contract after this season that would only carry a $17.4 million dead-cap number, per Spotrac. — Adam Gretz\nNFC North\nCHICAGO BEARS | Head coach Matt Eberflus: The Bears have only one division win during Eberflus' tenure and his seven wins are the fewest by a Bears head coach through his first 29 games. In his second season as HC, the defense has improved, but positive results are hard to come by behind a lackluster offense ranked 19th in yards (323.2) and 21st in points per game (20.2).\nDETROIT LIONS | Defensive coordinator Aaron Glenn: The Lions finished near the bottom of the NFL in points against (31st and 28th) the past two seasons and are on pace to do so again for the third time in as many years under Glenn (24th, 23.5). Furthermore, the unit has regressed in 2023, with opponents averaging 29 points per game since Week 7 (five games).\nGREEN BAY PACKERS | Wide receiver Christian Watson: The popular choice to emerge as the team's No. 1 wideout, he has underachieved in his second season, outshined by fellow 2022 draftee Romeo Doubs (seven TDs) and rookie Jayden Reed (five TDs). Watson had his best game in Week 12 (five receptions, 94 yards, one TD), but was nearly invisible before that, recording 16 catches (257 yards) and two TDs over seven games.\nMINNESOTA VIKINGS | Running back Alexander Mattison: He has floundered in his first season as the starter, producing zero rushing TDs on a career-best 13.2 attempts a game and ranking 22nd among qualified backs in yards per carry (3.8). He's still getting more snaps than second-year RB Ty Chandler, but the Vikings will likely look for a replacement this offseason if Mattison doesn't show more. — Mike Santa Barbara\nNFC South\nATLANTA FALCONS | Quarterback Desmond Ridder: The Falcons have a golden path toward a division crown, but Ridder’s two-interception performance against the Saints in Week 12 was another reminder Atlanta isn’t a legitimate contender with him. He’ll finish the season leading the Falcons, who will probably get a home playoff game, but the clock is ticking on Ridder’s time as an NFL starter.\nCAROLINA PANTHERS | General manager Scott Fitterer: Owner David Tepper should have the hottest seat, but he isn’t going to fire himself. Instead, when he runs out of people on the sidelines to fire, he’ll take out his frustration on a GM (partly) responsible for constructing the least impressive roster in football.\nNEW ORLEANS SAINTS | Head coach Dennis Allen: New Orleans' 5-6 record against the league’s easiest schedule is bad. What's worse, however, is running back Alvin Kamara’s concerning claim after a 24-15 loss to the Falcons that the team doesn’t have an identity. Allen — who has a 20-44 record as head coach of the Raiders and Saints — needs a playoff appearance or there could be big changes in New Orleans.\nTAMPA BAY BUCCANEERS | Head coach Todd Bowles: At 4-7, the Bucs are only a game back of first in the division, but they are fading fast, going 1-6 in their past seven games. The team’s lapses on defense (363.7 YPG\/27th) – supposedly Bowles' area of expertise – are most concerning. — Eric Smithling\n\nThis article, authored by Yardbarker Staff, was published by Yardbarker on 2023-11-30 under the category 'sports'.\n\n","id":437}
{"title":"Manchester divided as ten Hag pressure mounts after United Hammered, Ange-ball pays off again as Spurs sink Everton","context":"## Manchester divided as ten Hag pressure mounts after United Hammered, Ange-ball pays off again as Spurs sink Everton\n\nGoals from West Ham’s Jarrod Bowen and Mohammed Kudus extended Manchester United’s miserable run in the English Premier League.\nBowen bundled home at the second attempt in the 72nd minute, his 11th league goal this season, and Kudus struck his fourth goal in as many games to settle matters.\nIt was another worrying setback for manager Erik ten Hag as United suffered a 13th defeat in 26 games in all competitions.\nFacebook Twitter Whatsapp Reddit Email Share\nA defensive howler from Manchester United and Mohammed Kudus capitalises! ????\n\nWhat a finish from the West Ham man, but Kobbie Mainoo won't want to see this one back… ????\n\nStream LIVE, or on-demand after, here ???? https:\/\/t.co\/09W1bq24Ur#OptusSport #PL pic.twitter.com\/IcKGdmJv4O — Optus Sport (@OptusSport) December 23, 2023\nManchester United legend Peter Schmeichel lashed the team’s lack of a plan and blasted them for looking slow against the Hammers.\n“It was just in many ways irrelevant. There was no plan to it,” he said. “West Ham got an easy win which is a little bit silly to say.\n“When I look at the team, I don’t know what the identity of the team is. What is the style of play, what’s the plan?\n“He needs to take a step back, ten Hag, and say what do I need to do with these players I have available in order to first of all stop leaking goals, because that’s a problem, and secondly, score goals – how do I get the next goal? Four games without a goal, it’s a long time.”\nAdvertisement\nDEADLOCK BROKEN! West Ham lead against Manchester United! ????\n\nThat assist from Lucas Paquetá though… ????\n\nStream LIVE, or on-demand after, here ???? https:\/\/t.co\/09W1bq24Ur#OptusSport #PL pic.twitter.com\/Qqq7zugQmj — Optus Sport (@OptusSport) December 23, 2023\nTen Hag tried to put a positive spin on the performance by claiming to BBC that they were the better side before the first goal.\n“I think it was a decent 72 minutes where we didn’t take our chances. We should’ve gone in the lead but we didn’t and then it was one moment of switching off,” he said.\n“At this moment we are not top, but we have seen last week against the top of this league we were head-to-head. We didn’t score, we had the best opportunities of the game.\n“There we defended very well for 90 minutes, that has to be always our standard like what we did there. You have to bring that to every game on the pitch.”\nLiverpool and Arsenal played out a thrilling 1-1 draw at Anfield that ensures the London side will top the English Premier League on Christmas Day.\nGabriel gives Arsenal a three and a half minute lead at Liverpool! ????\n\nThis top-of-the-table clash explodes into life early – and that's the Gunners' fastest ever goal at Anfield in #PL history! ⚡️\n\nStream LIVE, or on-demand after, here ???? https:\/\/t.co\/wdM7tdgfb9#OptusSport pic.twitter.com\/n7dqm1qnUH — Optus Sport (@OptusSport) December 23, 2023\nAdvertisement\nArsenal led through defender Gabriel’s fourth-minute header from Martin Odegaard’s free kick on Saturday (local time), but Mohamed Salah beat David Raya at his near post to level in the 29th.\nLiverpool came closest in the second half and hit the woodwork twice, through Trent Alexander-Arnold and substitute Harvey Elliott.\nMikel Arteta’s team go into Christmas a point clear of Liverpool and third-placed Aston Villa.\nLiverpool defender Kostas Tsimikas broke his collarbone when he collided with Jurgen Klopp on the sideline.\nTsimikas was challenged by Arsenal forward Bukayo Saka and stumbled into Klopp, who fell on top of him.\nKlopp said Tsimikas’ collarbone was “definitely broken”, adding he will be “out for a long time.”\nAndros Townsend headed the winner for Luton Town as they beat Newcastle United in their first match since captain Tom Lockyer suffered a cardiac arrest agasint Bournemouth a week earlier.\nAdvertisement\nPURE ANGE-BALL! Richarlison scores against his old club to give Tottenham the lead! ????\n\n\"What a superb goal from Spurs – they just passed their way through Everton!\" ????\n\nStream #PLGoalRush LIVE, or on-demand after, here ???? https:\/\/t.co\/qE2Kd4Kh3N#OptusSport #PL pic.twitter.com\/uRXhc07AAo — Optus Sport (@OptusSport) December 23, 2023\nRicharlison scored for a third consecutive match against his old club Everton as Ange Postecoglou’s Tottenham ensured they would be in the EPL top four at Christmas after a hard-fought 2-1 home win.\nSean Dyche’s visitors crucially had a Dominic Calvert-Lewin effort ruled out by VAR in the 51st minute which could have changed the complexion of the match.\nSon Heung-min added to Richarlison’s opener and Andre Gomes scored a later consolation for Everton.\nBurnley took all three points with a deserved 2-0 victory over hosts Fulham as Rebecca Welch became the first female referee to take charge of an EPL match.\nWilson Odobert and Sander Berge scored to lift Burnley off the bottom of the table.\nDominic Solanke scored a hat-trick to earn Bournemouth a 3-2 win at Nottingham Forest and ruin Nuno Espirito Santo’s first game in charge at the City Ground.\nAdvertisement\nForest, who scored through Anthony Elanga and Chris Wood, had defender Willy Boly controversially sent off in the first half.\nThey were level until Solanke headed home in the fifth minute of stoppage time.\n© AAP\n\nThis article, authored by The Roar, was published by The Roar | Sports Writers Blog on 2023-12-23 under the category 'sports'.\n\n","id":438}
{"title":"Jets vs. Raiders live score, updates, highlights from NFL 'Sunday Night Football' game","context":"## Jets vs. Raiders live score, updates, highlights from NFL 'Sunday Night Football' game\n\nIf you tuned into \"Sunday Night Football\" expecting to see some offense, you tuned in on the wrong weekend.\nThe Jets and Raiders were locked into an old-school, defense-heavy primetime clash that featured nothing but six field goals through the first three quarters of the game. It wasn't until 50 seconds into the fourth quarter that Las Vegas finally picked up the first touchdown, with Michael Mayer making a leaping grab in the end zone to put the Raiders up 16-9.\nIn such a low-scoring game, that touchdown felt, even as early as it was, that it could be a game-winner. And indeed, it was as the Raiders held the Jets to just a field goal the rest of the game and picked off Zach Wilson late to stymy New York in a 16-12 win.\nMORE: What to know about Raiders 'SNF' hero Robert Spillane\nIt wasn't exactly a quarterback showdown that many might have expected in the preseason when this game appeared to be Aaron Rodgers vs. Jimmy Garoppolo. Instead, Wilson went 23-for-39 with 263 yards, no touchdowns and a pick (rushing four times for 54 yards) while Aidan O'Connell completed 16-of-27 passes for 153 yards, a touchdown and an interception.\nThe Raiders largely turned to running back Josh Jacobs, who set season-best marks with 27 carries for 116 yards, while the Jets' running back duo of Breece Hall and Dalvin Cook was held to just 17 rushes for 54 yards.\nThe win for the Raiders already marks their second in as many games since the firing of Josh McDaniels, with interim coach Antonio Pierce getting off to an undefeated 2-0 start to his career. It also vaults the Raiders into a deep AFC playoff race, with Las Vegas joining the now five AFC wild-card contenders with at least five wins.\nFor the Jets, it marked a second straight game without a touchdown, and gives them their second consecutive loss before hitting the road to face the Bills in Week 11.\nMORE: Revisiting Antonio Pierce's NFL playing career\nSporting News tracked all the scores and highlights from Jets vs. Raiders on \"Sunday Night Football.\" Check out all of the key moments you might have missed.\nJets vs. Raiders final score\n1 2 3 4 F Jets 6 3 0 3 12 Raiders 3 3 3 7 16\nJets vs. Raiders results, highlights from 'Sunday Night Football'\n(All times Eastern)\nFourth quarter\n11:26 p.m.: Wilson's final pass after being chased out of the pocket is batted down, and the Raiders hang on to win 16-12.\n11:24 p.m.: It's time for Hail Marys, and the first to Gipson sails out of bounds. With five seconds left, the Raiders call their second timeout.\n11:22 p.m.: Wilson spikes the first pass with no one open, then connects with Conklin on a dump-off for nine yards. He goes back to Conklin with the clock rolling, and the tight end makes an impressive leaping grab at the Raiders' 45. The Jets use their last timeout with 12 seconds left.\nA big pass to Tyler Conklin gets the Jets into opposing territory\n\n📺: #NYJvsLV on NBC\n📱: Stream on #NFLPlus https:\/\/t.co\/lfCP1NFAnO pic.twitter.com\/oW0Nb8335s — NFL (@NFL) November 13, 2023\n11:20 p.m.: Even after backing up five yards, Cole still boots the ball too far. He tries to angle it toward the sideline, and it bounces into the end zone for a touchback. Jets will get the ball at the 20 with 53 seconds left.\n11:19 p.m.: Raiders opt to trust O'Connell to put the game away and have him attempt a pass, but his pass attempt to Mayer is batted down by Jermaine Johnson. That saves the Jets a timeout and means they will get the ball back after a punt. Raiders take a delay of game penalty before the kick.\n11:18 p.m.: Jacobs is stuffed for no gain, and the Jets use their second timeout. 1:05 left, and the Raiders facing a pivotal third-and-5.\n11:17 p.m.: Jacobs gets five, and the Jets call a quick timeout.\n11:16 p.m.: Hall can only get a pair of yards on a check down to the right out to the 20. The next play, Wilson tries to get the ball out to Lazard and is picked off by Robert Spillane, who returns the ball out to the Raiders' 40. With 1:14 and the Jets having three timeouts, this one's all but over.\n11:11 p.m.: Wilson misses Lazard over the middle, then goes back to Conklin, who makes the low catch two yards shy of the first down marker. Wilson connects with Wilson again for six up to the 22 to bring up a fresh set of downs and the two-minute warning.\nGarrett Wilson bobbled it but still hung on for the first down\n\n📺: #NYJvsLV on NBC\n📱: Stream on #NFLPlus https:\/\/t.co\/lfCP1NFAnO pic.twitter.com\/pTmdt9OLNK — NFL (@NFL) November 13, 2023\n11:10 p.m.: The drive stays alive as Wilson dumps the ball off to Conklin, who stretches across for the first down at the 36.\n11:08 p.m.: Uzomah makes a strong effort catching a pass, staying up after a big hit and powering his way up six yards. Play stops for an injury to Jakorian Bennett. Wilson tries a deep shot toward the end zone to Garrett Wilson, but in double coverage, the pass is broken up.\n11:07 p.m.: New York keeps moving down the field, as after a three-yard catch from Garrett Wilson, Hall catches a quick pass underneath, makes some defenders miss and takes it up 10 yards to the Raiders 46.\n11:06 p.m.: The call on the field stands, and the Jets immediately work to pay off the turnover as Zach Wilson starts the drive with a nice throw across the middle of the field to Lazard for 17 yards to the Jets 41.\n11:03 p.m.: Costly turnover for the Raiders. Just as it felt the Raiders were inching toward putting the game away, Jacobs loses a fumble at the Jets' 25, and it's recovered by Ashtyn Davis. The turnover is being reviewed, and would be a massive swing if it stands.\nJamien Sherwood forces the fumble and the Jets take over!\n\n📺: #NYJvsLV on NBC\n📱: Stream on #NFLPlus https:\/\/t.co\/lfCP1NFAnO pic.twitter.com\/g9gWv0UKIT — NFL (@NFL) November 13, 2023\n11:01 p.m.: Zamir White gets his first carry of the day and appears to lose the football after gaining five, but the Raiders recover it. Jacobs gets the next handoff and appeared to be bottled up, but the line pushes him ahead for seven yards for a first down up to the Jets 29. Las Vegas grinding away the clock now with 6:14 left to play.\n11 p.m.: Gutsy call by Pierce and the Raiders, who fake a sneak and instead hand the ball off to Carter, who races around the left end and speeds past the defense for 15 yards and a first down up to the Jets 41.\n15 yards on 4th and inches. That equals a first down.\n\n📺: #NYJvsLV on NBC\n📱: Stream on #NFLPlus https:\/\/t.co\/lfCP1NFAnO pic.twitter.com\/ZJPCx6eHpq — NFL (@NFL) November 13, 2023\n10:58 p.m.: Facing a third-and-8, O'Connell fires the ball out to Austin Hooper, who is brought down just shy of the first down. The Raiders will have a decision to make on a fourth-and-1 from the Las Vegas 44. C.J. Mosley was injured on the play, and has to come off the field.\n10:56 p.m.: O'Connell tries a deep shot to Adams to start the drive, but the star receiver is double-covered. Jacobs gets Las Vegas back on schedule by racing his way up the middle for nine yards to set up a third-and-1, just stumbling short. He picks up that yard on a carry the next play to keep the chains moving.\n10:54 p.m.: Raiders will start at the 25 with 11:58 to play.\n10:51 p.m. Jets scoring play: The Jets offense stalls after a throw from Garrett Wilson on a trick play to Lazard misses, then a low throw from Zach Wilson to Cook that's missed as well. Wilson escapes pressure from the Raiders and manages a yard, but the call is to Zuerlein to boot the field goal. Raiders 16, Jets 12\n10:48 p.m.: Trading explosive plays now. First Jacobs with the big run, now Hall catches a screen pass, and he bursts down the left sideline for 35 yards to the Las Vegas 40. Then Garrett Wilson makes a wide-open grab for 13 to the Raiders' 28.\nBreece Hall just turned the screen pass into a 35-yard gain 😳\n\n📺: #NYJvsLV on NBC\n📱: Stream on #NFLPlus https:\/\/t.co\/lfCP1NFAnO pic.twitter.com\/aCOdKjJEkr — NFL (@NFL) November 13, 2023\n10:47 p.m.: Jets start at the 25.\n10:45 p.m. Raiders scoring play: O'Connell fakes a sweep to Jacobs and throws a touchdown pass to a leaping Mayer in the end zone. First touchdown of the game comes with 14:10 left. Raiders 16, Jets 9\nThird quarter\n10:41 p.m.: Mayer drops a pass on first down, then Jacobs explodes down the field, racing up 40 yards to the Jets' 13. Carter punches out the football at the end of the run, but it rolls harmlessly out of bounds. Jacobs takes the next carry for five yards to wind down the third quarter with the Raiders now at the Jets' 8.\n10:35 p.m.: Wilson to Wilson gains five to start the drive, but Zach is brought down the next play on a sack and the ball got loose. Mekhi Becton jumps on the ball to avoid disaster. Wilson tries to get the first down the next play with a deep shot to Taylor down the middle but it sails well over his head. New York punts, and Carter returns the ball 10 yards to the Raiders' 46 as Las Vegas again gets favorable field position to start a drive.\n10:34 p.m.: Gipson attempts a kickoff return, but is brought down at the Jets 13 for a short return.\n10:29 p.m. Raiders scoring play: Offense keeps trying to go through Jacobs, with him getting blown up for a loss of four before getting five yards on a toss to the right. But O'Connell way overthrows Adams, and the Raiders have to settle for the 40-yard field goal to tie the game with 2:36 left in the third quarter. Adams was furious there wasn't a penalty. All kicks so far tonight. Jets 9, Raiders 9\n10:27 p.m.: O'Connell rifles a quick pass out to Hunter Renfrow, who races up and gets near the line of scrimmage but is just inches shy of the line. The Raiders opt to go for it and hand the ball to Jacobs, who finds a hole on the right side and gets the necessary yardage to the Jets 23 for the first.\n10:26 p.m.: For the second time today, O'Connell takes a bad sack out to the Jets 42 that takes the Raiders out of field-goal range, but Jacobs catches a short pass and runs it up — ruled a carry since it was a lateral — for 12 yards to bring up a much more manageable third-and-6.\n10:25 p.m.: Following a rush of no gain by Jacobs, Meyers makes a catch in front of a few defenders and makes them miss to pick up eight yards. O'Connell then goes with a pop pass to Jacobs, who bursts to the right sideline for three yards and the first down to the Jets 34.\n10:19 p.m.: Quick three-and-out by the Jets, as Wilson steps up and fires an incompletion and Hall is brought down for a loss of a yard by Butler. After a false start to make it third-and-16, Wilson escapes out on the right side and manages to get 13 yards before stumbling and fall three shy of the first. Las Vegas gets an excellent return by Carter along the sideline, as he takes the punt from the Raiders 23 up to the Jets 46 for a 31-yard return.\n10:14 p.m.: O'Connell tries to throw a tight end screen to Mayer, but has to spike it as his tight end was well contained. Gipson returns the punt five yards up to the Jets' 15 as the Jets prepare for their next drive.\n10:11 p.m.: Impressive solo tackle by Quinnen Williams getting to Jacobs almost as soon as he gets the handoff in the backfield for a loss of three. Tre Tucker gets an end-around for nine yards to set up a much more manageable third-and-4. O'Connell scrambles for five to the left and gets the yardage, but for once, a penalty goes against the Raiders as a holding flag brings up a third-and-14 for the Raiders.\n10:05 p.m.: Conklin gets a nice reception that would have brought up a fourth-and-4. The Jets are flagged for holding, which is accepted by the Raiders rather than taking the punt. Wilson gets a quick pass out to Malik Taylor for six yards, and now the Jets will punt. DeAndre Carter returns the punt six yards from the Raiders' 25 to 31, where Las Vegas will start its first drive of the second half.\n10:04 p.m.: A low incompletion by Wilson to Wilson and a pickup of just two from Hall gets the Jets' drive off to a slow start. Wilson appeared to get a first down with a throw out to Gipson for 12 yards, but Carter is flagged for a chop block that vaults the Jets back to a third-and-21 at their own 14. Another rough penalty for the Jets, who now have six penalties for 68 yards.\n10:02 p.m.: The Jets will begin the second half from their own 25 on a touchback.\nSecond quarter\n9:45 p.m. Raiders scoring play: O'Connell misses Adams on back-to-back passes, and the Raiders opt to turn the ball to Jacobs for a yard before using their final timeout. Daniel Carlson drills the 54-yard field goal to make this a three-point game at the end of the first half. Jets 9, Raiders 6\n9:43 p.m.: This time, a brutal Jets penalty on defense. O'Connell gets a pass out to Mayer for five yards, but Bryce Huff is flagged for roughing the passer that moves the Raiders all the way to the Jets 37 with 21 seconds.\n9:42 p.m.: Raiders start a bit conservative with a run of six by Jacobs before O'Connell gets a quick pass out to Adams on the left side, giving the receiver space to pick up nine yards before going out of bounds to stop the clock with 32 seconds left in the half. He then dumps off a quick pass to Jacobs, who picks up eight before going out and stopping the clock at 26 seconds.\n9:39 p.m.: Conklin makes a catch up the middle for eight yards, but on the next play, Wilson tries to scramble out of the pocket and has to run for a loss of a yard. Wilson then fires incomplete to Allen Lazard, who was racing down the left sideline. Jets punt the ball into the end zone for a touchback.\n9:38 p.m.: Following a run of seven by Hall, Zach Wilson misses a pass attempt out to Garrett Wilson. Then the QB scrambles out to his left and takes off down the left sideline for 20 yards to the Jets' 41. He's now the team's leading rusher with two carries for 40 yards on the ground.\n9:36 p.m.: Jets take the fair catch at their own 14. They've got 1:52 to make something happen.\n9:34 p.m.: A pair of promising passing plays go for naught. Jakobi Meyers makes a few defenders miss on a nice catch for 13 yards, then O'Connell fires a strike to Adams for a pickup of 18 yards. But the Jets' pass-rush finally gets home as O'Connell is sacked, pressured into throwing out of bounds then sacked again. Raiders pushed from the New York 26 all the way back to the Jets' 46, and will now likely have to punt coming out of the two-minute warning.\n9:29 p.m.: Jacobs came into the drive with just three total carries, but he's now carried it five straight times for 20 yards. O'Connell then picks up the third-and-1 by sneaking it for three yards.\n9:27 p.m.: Three straight runs by Jacobs, punctuated by an impressive, shifty, five-yard run gets the Raiders the first down up to the Las Vegas 31.\n9:22 p.m.: Needing only a yard, the Jets' backs come up short on both attempts, with Cook and Hall both being bottled up at the line of scrimmage for no gain. Jets decide to punt the ball from their own 38, and it goes into the end zone for a touchback. Raiders back on offense from their own 20 with 7:18 left in the half.\n9:20 p.m.: Cook bounces out to the right, and gets out to the 29 for a pickup of 10. He follows that up by speeding to the left and racing up for nine yards to the Jets' 38 before he's brought down by Crosby.\n9:16 p.m.: A pair of runs by Jacobs nets the Raiders just one yard, and O'Connell's deep shot to Adams is well past his intended target. The Raiders go three-and-out, and after an out-of-bounds punt from AJ Cole, the Jets will start at their own 19.\n9:15 p.m.: Raiders will start from their own 25.\n9:15 p.m.: Robertson has been ruled out with a concussion, per the team.\n9:12 p.m. Jets scoring play: Wilson attempts a checkdown to Michael Carter, but the ball is tipped by Adam Butler. New York once again has to settle for a field goal. Jets 9, Raiders 3\n9:09 p.m.: Hall runs for a yard, then is stuffed for no gain trying to get to the outside by Crosby. The Jets use their first timeout before the third-and-goal play from Las Vegas' 12-yard line.\n9:08 p.m.: Stop if you've heard this before: good Jets play, bad Jets penalty. Hall ran for three yards up the middle for a touchdown, but Uzomah was flagged for holding a second time as he tried to block Maxx Crosby and free up space for Hall along the right side. Now a first-and-goal from the Raiders 13.\n9:06 p.m.: Garrett Wilson makes a leaping grab for seven yards before Zach Wilson makes a stellar run along the right sideline. He initially was ruled to be in the end zone, but review confirmed he stepped out at the 3-yard line, making it a 20-yard run from the QB. First-and-goal now for the Jets.\nStepped out at the 3, but Zach Wilson used his legs to get near the end zone 💨\n\n📺: #NYJvsLV on NBC\n📱: Stream on #NFLPlus https:\/\/t.co\/lfCP1NFAnO pic.twitter.com\/DZKQE2yZvd — NFL (@NFL) November 13, 2023\n9:05 p.m.: Raiders corner Amik Robertson had to be helped off the field and walked to the sideline. Appeared to be in the fencing response while on the ground.\n9:02 p.m.: Another big Jets play overturned by a penalty. Hall appeared to have the first down for 11 yards, but Laken Tomlinson is flagged for holding. Jets will face a second-and-19.\nFirst quarter\n8:58 p.m.: Hall picks up a yard to bring the quarter to an end.\n8:56 p.m.: O'Connell goes from nearly losing a fumble to throwing an interception right at Jordan Whitehead, who returns the pick out to the Raiders' 26. Raiders are challenging the interception, but since all turnovers are reviewed, their timeout is used.\n8:55 p.m.: Near-disaster to start the drive for the Raiders, as O'Connell muffs the snap under center. He falls on the ball to limit it to just a one-yard loss.\n8:54 p.m.: Raiders will start from their own 25 after a touchback.\n8:51 p.m. Jets scoring play: Wilson threads the needle out to Garrett Wilson, but the receiver can't hang on. Tyler Conklin makes a quick grab for five yards, but the Jets again have to settle for three from Zuerlein. Jets 6, Raiders 3\n8:49 p.m.: Now, Garrett Wilson's getting involved in the running game, taking an end around for 11 yards. However, C.J. Uzomah is called for holding that moves the play back to a second-and-18.\n8:47 p.m.: Garrett Wilson gets back into the passing game, first catching a quick pass on the outside for five yards, then taking a short pass from Wilson up eight yards to the Raiders' 32 for another first down.\n8:45 p.m.: After a pair of runs that picked up six yards from Hall, Wilson throws a deep pass out to Gipson down the right sideline, picking up 24 yards to the Raiders' 45. Jets again using big strikes to move down the field.\n8:44 p.m.: Jets will start their second drive at their own 25 with 6:15 to go in the first quarter.\n8:39 p.m. Raiders scoring play: That penalty winds up stunting the drive. Adams makes an impressive, one-handed grab for eight yards and Michael Mayer picks up seven on a grab over the middle, but he's stopped just short. The Raiders also settle for a field goal, this one from 41 yards out to even the game. Jets 3, Raiders 3\n8:38 p.m.: Right after the big play, Adams is flagged for offensive pass interference on a swing pass to Jacobs. That will move the Raiders back, and bring up a first-and-20.\n8:37 p.m.: Josh Jacobs' first carry is stuffed for only two. But the first big connection between O'Connell and Adams vaults the Raiders up to the Jets' 31 for 42 yards on a nice deep pass over the middle of the field.\nAidan O'Connell stumbled and still found Davante for 42 yards\n\n📺: #NYJvsLV on NBC\n📱: Stream on #NFLPlus https:\/\/t.co\/lfCP1NFAnO pic.twitter.com\/qc06xFF0aa — NFL (@NFL) November 13, 2023\n8:35 p.m.: DeAndre Carter returns the kickoff to the Raiders' 25 to start the drive.\n8:31 p.m. Jets scoring play: Dalvin Cook has an impressive seven-yard run, but on third down, Wilson's quick pass to Gipson is dropped. The Jets have to settle for three from Greg Zuerlein. Jets 3, Raiders 0\n8:30 p.m.: Odd play after the explosive. Wilson is brought down, and as he's going down, he tries to flip the ball out. It initially looked like it could've been a fumble, but it is called for intentional grounding. That will bring up a second-and-20 for New York.\n8:29 p.m.: On a play action, the Wilson-Wilson connection is an explosive one, as the receiver catches a hard pass over the middle and streaks down the right sideline before finally being brought down at the Raiders' 26 for a gain of 41.\nPlenty of room to run after the catch for the defending OROY 😤\n\n📺: #NYJvsLV on NBC\n📱: Stream on #NFLPlus https:\/\/t.co\/lfCP1NFAnO pic.twitter.com\/eQjJRa6EAY — NFL (@NFL) November 13, 2023\n8:28 p.m.: Zach Wilson to Garrett Wilson, with an impressive throw and catch threading the needle between a pair of defenders on the left side for six yards and a first down. Jets decline the offsides penalty on the Raiders.\n8:27 p.m.: Breece Hall gets the call twice to start the drive and powers his way up the middle for four on the first run, then is stuffed for only a yard on the next play.\n8:25 p.m.: O'Connell tries to feed Davante Adams to start the game. He misses Adams on the first drive, then connects with him for gains of six and three. Adams is tackled just shy of the line, however, and the Raiders have to punt. Xavier Gipson calls for a fair catch at the Jets' 22.\n8:23 p.m.: The Raiders will start the game with the ball on offense, and will open at their own 25.\n8:10 p.m.: Rodgers might be looking better and better each week. But no, he will not be playing against the Raiders tonight.\nJust had to be sure 😂\n\n(Via: @nyjets) pic.twitter.com\/cBHbnGaC73 — Sunday Night Football on NBC (@SNFonNBC) November 13, 2023\nWhat channel is Jets vs. Raiders on today?\nGame: Jets at Raiders\nJets at Raiders Date: Sunday, Nov. 12\nSunday, Nov. 12 TV channel: NBC\nNBC Live stream: Peacock, NBCSports.com, Fubo (U.S.) | DAZN (Canada)\nNew York and Las Vegas will face off on \"Sunday Night Football,\" which is carried by NBC. Mike Tirico will handle play-by-play with Cris Collinsworth providing commentary. Melissa Stark will report from the sidelines.\nThose hoping to stream the game can find it on Peacock or NBCSports.com with a cable subscription. Fubo, which offers a free trial, will carry NBC's broadcast. DAZN carries all NFL games in Canada.\nJets vs. Raiders start time\nDate: Sunday, Nov. 12\nSunday, Nov. 12 Start time: 8:20 p.m. ET\nThe Jets and Raiders will start their \"Sunday Night Football\" game at 8:20 p.m. ET, from Allegiant Stadium in Las Vegas.\n\nThis article, authored by Edward Sutelan, was published by Sporting News on 2023-11-12 under the category 'sports'.\n\n","id":439}