{"title":"Inside the $US2.3b venue that will transform the concert industry","context":"## Inside the $US2.3b venue that will transform the concert industry\n\nBreathtaking is fair. Like the ABBA Voyage show in London, it is hard to capture in words. In many ways, it’s a conventional space: there is tiered seating inside, and wallet-bruising bar snacks and merchandise for sale outside. Some parts of the rock concert experience will never change. But when the lights go down, everything changes. Around you, Sphere splits open to reveal a succession of environments, each more stunning than the one before. Though the structure is familiar - the audience seated in rows, the band on a single, central stage - the effect is overwhelming. In U2’s show, we journey through a succession of environments referencing the band’s creative history. For other projects, such as Darren Aronofsky’s Postcard From Earth, the Sphere’s sound system uses “haptics” to make the audience feel the sounds. U2 perform at the Sphere in Las Vegas. Credit: Stufish Entertainment Architects These are the technical specs: an interior 16K x 16K spherical video surface, the highest-resolution LED screen ever made with 268,435,456 pixels, and an exterior covered by 1.2 million hockey-puck-sized LEDs. There are 157,000 ultra-directional speakers – the boffins call it “beam-forming acoustics” – and there are “infrasound haptics”, which means the soundwaves are shaped to create both vibrations and waves of air pressure.\nThe comparison to ABBA’s show in London is perhaps the only approximate one: both are wholly enveloping experiences where the lights, sound and special effects are blended to push the audience’s senses to the limit. They differ in one key way; ABBA pushes its effects out toward you, largely to play smoke and mirrors with the on-stage simulacrums. Sphere, in contrast, more wholly and subtly envelops you. “They are both legacy projects made by artists who have the career and track record to be able to look at these things objectively in a way that a younger performer perhaps wouldn’t because it takes an entire lifetime of experience to make those kinds of choices and make it work,” Williams says. The two shows also share British music stage architecture firm Stufish whose work ranges from the Queen’s Platinum Jubilee, tours for Beyoncé and Jay-Z, Michael Bublé, Elton John and Madonna as well as the ABBA Arena in London. Stufish partner Ric Lipson (along with artist Es Devlin and producer Brian Eno) collaborated on the U2 project for Sphere. “With the ABBA Arena, it’s absolutely designed for that show, but you could also imagine that building having another avatar show in there, or indeed a live performance where people would use the technology that’s in the building as an immersive environment,” Lipson says.\n“The Sphere does a similar thing, [in that] you have a fully immersive space, the video screen in the Sphere is vast, it has a huge number of pixels, and you can immerse the audience within this environment.” So what does all this mean for the concert industry, which has historically built its lucrative concert spin-off industry on the conversion of sports venues to rock concert stages? It certainly means the future is looking a little more ... spherical? And, from a technological perspective, a little more plug-and-play. “It opens you up to thinking about performances in different ways, both from a creative point of view, from a business point of view, from a sustainability point of view, and the ability to not have to bring your own structure and screen and [sound system],” Lipson says. ABBA’s simulacrums on stage at ABBA Arena in London. Credit: Johan Persson “We have Adele in Caesar’s Palace right now, which again is another large show that immerses the audience, but we bring everything in and every time we load that show out, it takes a week or so,” Lipson adds. “What’s interesting about the Sphere idea is that they are planning multiple spheres, and then you can think about shows being able to move from sphere to sphere.\n“Both [the U2 and ABBA] shows are taking a bold stab at the next-generation way of doing shows,” Lipson says, but notes that the traditional blueprint of iconic artist and audience remains key. “I’m sitting in a regular arena right now with Madonna, we are doing a very exciting show that pushes the limits of a pop show balancing staging and audience, and we are doing things that will feel fresh for her audience and for the show.” Critically, says Lipson, the staging for the U2 show is elementary in real terms, despite its technological complexity. “And what’s interesting is that the Sphere, like ABBA Arena, is only touching the sides of what you can do,” he says. “In five years’ time and 10 years’ time, two years’ time, whenever the technology shifts, you’ll be able to do more.” By the numbers ... U2 perform at the Sphere in Las Vegas. Credit: Stufish Entertainment Architects The screens, for example, are a bespoke assembly of state-of-the-art screens. But behind those screens are “a whole new kind of speaker,” Lipson says. “In a regular show, the speakers are at one end pushing the sound down the room, so it’s louder at the stage end and quieter further away. [But here] because everybody’s sort of getting their own feed, everybody’s getting an equal volume. So hearing the show in there, sonically, may be better than anywhere.” When the Sphere venue is in cinema mode, it utilises the full range of haptics, that is its ability to shape sound into both vibrations that will literally shake your seat, but also waves of pressure that can be felt. To those, the haptic systems add both artificial wind and a range of scents, paired to key moments, such as scenes of rocket launches or wild storms. Scratch ’n sniff, anyone?\nAs far back as the 1950s, Hollywood used three synchronised 35mm projectors to send a single image into a huge, deeply curved screen and called it Cinerama. It clocked in at just 146-degrees, well short of the Sphere’s 270-degree view. Another 1950s technology, Circle-Vision 360, essentially nine cameras positioned in an outward-facing circle, was used to create 360-degree film images, the most famous of which was Disneyland’s America the Beautiful film. Drawing a little less fanfare than U2’s debut on the Sphere stage was the premiere of Darren Aronofsky’s Postcard From Earth, a 50-minute 18K resolution film shot to fit the 270-degree wraparound screen, using an 18K Big Sky camera, and featuring sequences shot in Greece, India, Mexico and the USA. The Big Sky, in layman’s terms, delivers an image that is about 40 times greater in resolution than a 4K television screen. From Vegas to the desert ... U2 perform at the Sphere. Credit: Stufish Entertainment Architects Like Lipson, Williams is cautious about becoming lost in the dramatic differences of scale, particularly when it is the storytelling of the bands and their discographies that are the key draw for the audience. The same principles apply, Williams says, whether the show is U2 at Sphere or, in another of his shows, Australian playwright Suzie Miller’s Prima Facie, starring Jodie Comer, on the substantially smaller stages of London’s Harold Pinter Theatre and Broadway’s John Golden Theatre. The Sphere on the Las Vegas skyline. Credit: Las Vegas Review-Journal via AP\n\nThis article, authored by Michael Idato, was published by The Sydney Morning Herald on 2023-10-19 under the category 'entertainment'.\n\n","id":560}
{"title":"‘As clinical as it gets’: Unbeaten Aussie moves to 24-0 with stunning first-round KO of hapless Englishman","context":"## ‘As clinical as it gets’: Unbeaten Aussie moves to 24-0 with stunning first-round KO of hapless Englishman\n\nJai Opetaia has taken his frustrations out on a hapless Ellis Zorro, the unbeaten Australian delivering a brutal first-round knockout in Saudi Arabia, while Kiwi heavyweight Joseph Parker stunned former champ Deontay Wilder to ruin his chances of facing Anthony Joshua.\nCruiserweight Opetaia was forced to vacate his IBF world title belt to take his place on the mega-card in Riyadh early on Sunday morning (AEDT).\nIn a bout reportedly worth $680,000 to the Australian, he wasted little time, a huge left hand obliterating Zorro with four seconds remaining in the first round.\nFacebook Twitter Whatsapp Reddit Email Share\nThe punch sent the dazed Englishman into the ropes and on to the canvas, the outclassed Zorro eventually able to offer a sheepish smile in what was his first loss in 18 professional fights.\nThe former Olympian moved to 24-0 with 19 stoppages and retained his Ring Magazine belt to cap a week of drama that saw Opetaia stripped of his IBF status in controversial circumstances.\n“I train for 12 rounds, was prepared for 12 and if the knockout comes, it comes,” Opetaia said.\n“He was a bit too hesitant and he got clipped, that’s the way it goes.”\nCommentator Sergio Mora described the one-punch knockout as “devastating and scary” while fellow pundit Mike Costello added: “At any weight, at any level that’s as clinical as it gets in this sport”.\nAdvertisement\n“He dismissed Zorro with the minimum of fuss and the maximum of power,” he added.\nOpetaia broke his jaw twice on the way to upsetting Mairis Briedis to win the IBF and Ring belts last year before enduring a frustrating wait to defend them 14 months later.\nMultiple opponents have dodged the 28-year-old, who the IBF demanded fight Briedis next despite the injured Latvian being happy to delay their bout until he is fit early next year.\n“I did, but look at this place, beautiful, I’m happy to be here,” Opetaia said when asked if he had vented his frustrations in the ring.\n“I’m pumped; first round knockout, I’m ready for the next fight.\n“The last 18 months is just part of the journey. I’m here in the ring now and that’s all that matters.\nAdvertisement\n“These dudes (promoters) put the people in front of me and I just knock them out.”\nOpetaia’s next fight could be on the Tyson Fury-Oleksandr Usyk card in Riyadh on February 17.\nPromoter Eddie Hearn said the Australian had the potential to replicate Usyk’s career and unify the cruiserweight division before moving up to the heavyweights.\n“Every fight man knows,” Hearn said of the man regarded as the No.1 cruiserweight in the world.\n“I believe Jai’s going to do the exact same thing (as Usyk) … we’re talking about a pound-for-pound talent,” Hearn said.\nDubbed the ‘Day of Reckoning’, the Middle East card features heavyweight stars Joshua, Wilder, Parker and light heavyweight champion Dimitri Bivol.\nParker’s victory over Wilder came before Joshua stopped Otto Wallin with a fifth-round TKO in a heavyweight double-header.\nAdvertisement\nThe bouts at Kingdom Arena in Riyadh were expected to set up a March bout between Wilder and Joshua.\nInstead, it appears Parker is in a position to step up in March, with the winner of that fight hoping to get a shot at the undisputed championship, which will be decided on February 17 when Tyson Fury and Oleksandr Usyk meet in Saudi Arabia.\nThe heavyweight division hasn’t been unified this century.\nThe 31-year-old Parker, a big underdog according to FanDuel Sportsbook, looked the better fighter throughout, while the 38-year-old Wilder looked his age in a match-up of former heavyweight champions.\nParker (34-3-0) dominated from the start, landing powerful punches with his right hand while keeping Wilder on his heels with a smart and methodical approach.\n“Dangerous fight, tough fight, we trained very hard for this,” Parker said.\n“We had great momentum coming into this fight. The strategy was to stay calm, stay relaxed, stay focused … every minute of every round. This is a great finish to the year.”\nAdvertisement\nThere was only one round in which Wilder got the better of Parker.\n“My timing was off a little bit,” Wilder said.\n“He did a great job of avoiding a lot of my punches. I did feel like I had the upper hand, but things happen. We move on to the next step.”\nIn the main event, Wallin’s corner called for the stoppage at the end of the fifth round.\nJoshua, a strong favourite, needed more than just a victory to convince sceptics his best days weren’t behind him.\nThe British boxer earned some style points against the 33-year-old Wallin, who is from Sweden.\nJoshua (27-3-0) hadn’t looked the same since holding the WBA, IBF and WBO titles. But the 34-year-old delivered a throwback performance, jabbing and moving forward with confidence while backing down Wallin (26-2-0).\nAdvertisement\nA strong right-left combination in the fifth round eventually led to the stoppage.\n“Just another fight. I respect Otto,” Joshua said.\n“Not so much a throwback, just another day in the office. I’m just a gifted fighter that has a special gift and I use it to the best of my ability.\n“We just want to do whatever it takes to be victorious. All I want to be is just be victorious for as long as I can. I’m searching for greatness.”\nEarlier, Dmitrii Bivol defeated Lyndon Arthur in a unanimous decision that saw all three judges score it a 12-round sweep for the IBO light heavyweight and WBA super light heavyweight belts.\nThe early card also included five knockouts.\nAfter Opetaia, Daniel Dubois (20-2-0) registered a 10th-round TKO of Jarrell Miller (26-1-1) with eight seconds left in the final round.\nAdvertisement\nAgit Kabayel (24-0-0) scored a fourth-round TKO of Arslanbek Makhmudov (18-1-0) in a scheduled 10-round heavyweight bout.\nFilip Hrgovic (17-0-0) stopped Mark De Mori (41-3-2) with a first-round TKO, and Frank Sanchez (24-0-0) opened the night with a seventh-round knockout of Junior Fa (20-3-0).\n© AAP\n\nThis article, authored by News, was published by The Roar | Sports Writers Blog on 2023-12-23 under the category 'sports'.\n\n","id":561}
{"title":"'Angels, demons, spirits and souls do exist,' says exorcist priest who warns against Ouija board use","context":"## 'Angels, demons, spirits and souls do exist,' says exorcist priest who warns against Ouija board use\n\nOuija boards and other attempts to converse with the dead are spiritually dangerous practices that should not be viewed as innocent fun, an exorcist priest told Fox News Digital.\n\"We too often forget that there is much more to this world than meets the eye,\" Fr. Dan Reehil told Fox News Digital. \"Angels, demons, spirits and souls do exist and they can have an impact on our life.\"\nRehill is a priest of the Diocese of Nashville. In 2018, he received exorcism training at Ateneo Pontificio Regina Apostolorum in Rome, and was installed as the exorcist of the Diocese of Nashville that same year.\nDO ANGELS EXIST? OVER HALF OF AMERICANS SAY YES, STUDY FINDS: ‘COMFORT AND REASSURANCE’\nAn exorcist, said Reehil, \"is a priest chosen and installed by a bishop to exercise the office of deliverance ministry. Exorcism is a specific form of prayer that the [Catholic] Church uses against the power of the devil.\"\nThe Catholic Church distinguishes between two forms of exorcisms, said Reehil. Exorcisms are either \"major\" or \"minor.\"\n\"A major exorcism is performed only for one, who is demonstrably possessed by a demon or demons, and may only be performed by a priest the bishop has specifically permitted to do so,\" said Reehil.\nConversely, a minor exorcism is associated with sacraments and blessings, said Reehil.\n\"Demonologists distinguish three levels of demonic incursion,\" explained Reehil. These three levels are temptation, obsession (which is also called \"oppression\") and possession.\n'HALLOW' PRAYER APP ACCOMPLISHED ITS GOAL DURING THE GOP DEBATE, COMPANY SAYS: 'PRAY WITH ME REAL QUICK'\nTemptation, said Reehil, is something experienced by everyone.\nObsession is \"when demons torment people physically, spiritually, mentally or emotionally, or some combination of these.\"\nPossession, which is arguably the most well-known of the three levels, is when a demon or demons \"take physical possession of a person's body and make use of its faculties,\" said Reehil.\n\"Possession is usually intermittent, almost never an uninterrupted possessing of the person’s body,\" he added.\nAttempting occult practices, such as purportedly trying to contact the dead via an Ouija board, are a way to open oneself up to demonic activity inadvertently, said Reehil.\n\"Demons lie and impersonate dead people,\" said Reehil. \"When asking a board for information about a deceased person, or a life decision, they are all too happy to embed themselves into your life. Using an Ouija board is inviting a demon into your life, whether the person has that intention or not.\"\nThe Ouija board was first developed in the late 19th century as a parlor game; these were formerly called \"talking boards.\"\nAt the time, séances and other spiritual practices were quite popular activities.\nAS CATHOLIC CHURCH FACES PRECARIOUS CULTURAL TIME, BISHOP ROBERT BARRON OF MINNESOTA MODELS THOUGHTFUL FAITH\nThe board consists of an alphabet, the words \"yes,\" \"no,\" \"goodbye,\" and the numbers zero through nine.\nTo operate the board, a person places their hands on a \"planchette,\" which spirits purportedly move to spell out answers to questions.\nIn 1890, a Baltimore spiritualist and medium named Helen Peters asked the talking board what she should call it, said the website for the Talking Board Historical Society. The board responded \"O-U-I-J-A,\" which it said meant \"good luck.\"\nThe Ouija board was patented the following year.\nLegend regarding the Ouija board's patent says that Peters accompanied attorney Elijah Bond to the patent office, where the two were instructed by the patent officer to prove that the board worked by spelling out his name, said Smithsonian Magazine.\nTHE EXORCIST, CHUCKY AND NEW HORRIFIC HAUNTS HIT UNIVERSAL STUDIOS ORLANDO'S HALLOWEEN HORROR NIGHTS\nPeters reportedly asked spirits for assistance, and then spelled out the patent officer's name.\nIt is unclear if Bond or Peters somehow knew the patent officer's name ahead of time, but the patent was awarded on Feb. 10, 1891, by a \"white-faced and visibly shaken patent officer,\" said the magazine.\nThe boards were then mass-produced by the Kennard Novelty Company, which was sold to Parker Brothers in 1967.\nToday, the Ouija board is produced by Hasbro, which markets the product as a way to communicate with the \"spirit world.\" Fox News Digital reached out to Hasbro for comment but did not hear back by publication time.\n\"Enter the world of the mysterious and mystifying with the Ouija board! You've got questions and the spirit world has answers — and the uncanny Ouija board is your way to get them,\" said the Hasbro website.\nHALLOWEEN HORROR MOVIE HOMES AND THE STORIES BEHIND THEM: WOULD YOU DARE TO VISIT?\n\"What do you want to know? Ask your question with a friend using the planchette that comes with the board, but be patient and concentrate because the spirits can't be rushed. Handle the Ouija board with respect and it won't disappoint you,\" said the website.\nWhile the Ouija board is marketed as a toy or board game, Reehil, from his point of view, disagrees with this characterization.\nDivination and other occult practices are condemned by the Bible numerous times, said Fr. Reehil.\n\"Ouija boards should not be viewed in the same way as a typical board game,\" he said. \"Although it is advertised as a game, it is far from it,\" he added. \"Rather, it is a form of divination.\"\nDivination and other occult practices are condemned by the Bible numerous times, Reehil noted.\n\"The very action of using [the Ouija board] has profound spiritual consequences [that are] beyond our control,\" he said.\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\nPerhaps the most famous instance of purported demonic possession connected to Ouija board usage was the case of \"Roland Doe,\" a young teenage boy from Maryland, who underwent numerous major exorcisms in 1949, said Reehil.\nDoe's story was adapted into the 1971 book \"The Exorcist\" by William Peter Blatty, which was then made into the 1973 movie starring Ellen Burstyn and Linda Blair.\nReehil told Fox News Digital that he has personally seen six cases of demonic oppression that stemmed from Ouija board usage.\n\"The victims were left with night terrors, suicidal ideation, despair — and one man was impaled with chicken bones in his leg that flew across the kitchen,\" he said.\n\"Stay away from all forms of occult practices — and stay close to God.\"\n\"Once the deliverance prayers were prayed, and the participants renounced all participation with the demons, the demonic activity ceased,\" he also said.\n\"Whenever we seek to engage demons, we move away from the One True God,\" said Reehil.\nCLICK HERE TO GET THE FOX NEWS APP\nAdded the priest, \"Stay away from all forms of occult practices — and stay close to God.\"\nFor more Lifestyle articles, visit www.foxnews.com\/lifestyle.\n\nThis article was published by FOX News - Lifestyle on 2023-10-30 under the category 'entertainment'.\n\n","id":562}
{"title":"The best horror movies you can watch right now","context":"## The best horror movies you can watch right now\n\nYour time is precious, and your options are endless. The good news: We watch it all so you don’t have to. Polygon’s What to Watch highlights the best, the funniest, the scariest, and the most exciting in movies, TV, and everything in between. Stop scrolling, start watching!\nWhether it’s something gory and macabre, silly and irreverent, or eerie and unsettling, the genre of horror is as rich and varied as the multitude of ghosts, ghoulies, and homicidal maniacs that go bump in the night.\nLooking for the best horror films available to stream on Netflix, Hulu, Max, and Paramount Plus? No worries, we’ve got the goods. We’ve combed through the libraries of each of the major streaming platforms to bring you a list of our most recommended horror movies. Here are the best horror movies you can stream right now, from old classics to new hits. Our latest update added Encounters of the Spooky Kind.\nEditor’s pick: Encounters of the Spooky Kind\nDirector: Sammo Hung\nCast: Sammo Hung, Chung Fat, Dick Wei\nWhere to watch: Criterion Channel\nThis Halloween, I had one goal: Finally watch Sammo Hung’s jiangshi (Chinese hopping vampire) martial arts comedy Encounters of the Spooky Kind. It was finally added to streaming via the Criterion Channel earlier this fall after years of being unavailable digitally. And reader, my priorities were correct, because this movie is an absolute blast.\nBest known for his collaborations with childhood friends Jackie Chan and Yuen Biao, Sammo’s excellence as a director, choreographer, and performer are on full display in what is frequently a one-man show.\nSammo directed the movie, co-wrote it, choreographed the action, and stars as Bold Cheung, a pedicab driver and skilled martial artist who’s also kind of a dolt. He is dared to spend the night in a haunted house with a hopping vampire — a dare he accepts, because he is “Bold” Cheung, after all. What follows is a Looney Tunes-style slapstick action horror movie with legitimate scares (the vampire makeup is terrific: gray with a gross texture, like a wet papier-mâché mask), dazzling rhythmic martial arts choreography, and perfectly placed dashes of comedy (there’s even an extended Duck Soup homage).\nSammo is truly one of the greatest directors to ever do it, but he doesn’t get the proper credit globally because of the genres (and nation) he’s primarily worked in. The jaw-dropping choreography and onslaught of funny bits are outstanding, but it’s his skill with the camera that has always separated Sammo from his counterparts.\nBringing it back to his old friend Yuen Biao for a second — Biao co-stars as the silent vampire, and does a terrific job selling the undead creature’s fight sequences with stiff limbs and startling hops. This movie is colorful, funny, scary, tense, and an incredibly fun time. If you like the Evil Dead movies, this is one you must check out; Sam Raimi basically directly ripped one of Spooky Kind’s fight sequences for Evil Dead II. —Pete Volk\nAlone\nDirector: John Hyams\nCast: Jules Willcox, Marc Menchaca, Anthony Heald\nWhere to watch: Hulu, Kanopy\nA taut spine-chiller from John Hyams (Universal Soldier: Day of Reckoning), Alone is your classic woman-on-the-run thriller. Jessica (Jules Willcox), a recent widow, is in the midst of moving. If that wasn’t enough stress, a creepy man (Marc Menchaca) appears to be following her on the road. After he slashes her tires, she crashes and wakes up in his basement. What follows is a tightly crafted thriller with great performances, outstanding direction, and enough tension to keep your heart pounding throughout the 98-minute running time. —Pete Volk\nAnnihilation\nDirector: Alex Garland\nCast: Natalie Portman, Jennifer Jason Leigh, Gina Rodriguez\nWhere to watch: Netflix\nAnnihilation might be the creepiest movie about plants ever made (with all due respect to The Ruins.)\nAnnihilation follows a group of scientists (played by a phenomenal group of actors) investigating an area struck by a meteor. The area that was hit has slowly spread and grown into what’s now known as The Shimmer, an area where nature seems to be taking over everything around it, but it’s a different kind of nature; strange, unnaturally green plants grow over everything, and creatures (animals and humans) slowly merge with the vegetation around them. At the center of all of this is a lighthouse the group must reach. Annihilation helps realize this strange Earth-but-not incredibly well, with beautiful and haunting production design and a finale as memorable as any horror movie on this list. — Austen Goslin\nClimax\nDirector: Gaspar Noé\nCast: Sofia Boutella, Romain Guillermic, Souheila Yacoub\nWhere to watch: Showtime\nClimax isn’t for the faint-of-heart — and we’re saying that in the context of a horror movies list. The movie is set at an all-night dance party inside a gymnasium, which turns sour after someone spikes the sangria with a little too much LSD. Climax is told in beautifully disorienting long takes that go from dozens of minutes of uninterrupted and propulsive dance sequences to hazy walks through hallways as the camera mimics the dizzy stumbling of the movie’s characters. As the psychedelics kick in, so too do some of the attendees’ long-held feuds, leading to disastrous and horrifying consequences. It’s rare that a movie truly defies description, but if you’ve got a strong stomach and a will to see something you haven’t before, Climax is the perfect movie for you. —AG\nCrimes of the Future\nDirector: David Cronenberg\nCast: Viggo Mortensen, Léa Seydoux, Kristen Stewart\nWhere to watch: Hulu\nMicroplastics: They’re everywhere!\nThey’re in our lungs, our blood, our food and drinking water; even the air we breathe. What the fuck is it doing to our bodies? We don’t really know, but David Cronenberg’s 2022 body horror drama sure has an idea of what it might mean for our children. Crimes of the Future imagines a world where humans have lost the ability to feel pain. In addition to that, several people have developed a disturbing disorder which causes their bodies to spontaneously spawn new organs.\nThis new reality has spawned a trend: Live surgery, wherein performance artists plagued with this condition tear into their own bodies in an effort to shape meaning out of this strange new biological fact. Viggo Mortensen stars as Saul Tenser, a world-renowned performance artist who, alongside his partner Caprice (Léa Seydoux), stands on the cutting edge — both literally and figuratively — of this cultural phenomenon. When Saul’s activities catch the attention of a mysterious group of evolutionary activists, as well as the lascivious eye of a government employee named Timlin (Kristen Stewart), he’s forced to confront what he — and everyone else around him — is changing into, and whether what that is can even be considered “human” anymore.\nAs macabre as it is moving, grotesque as it is sensuous; Crimes of the Future is an exquisite work of science fiction horror where surgery is the new sex and our very bodies have rebelled against us for the incalculable destruction we have inflicted on the planet. It’s a film that exists in intimate conversation with the anxieties of our present, as well as one that represents a stunning return to form for one of cinema’s most forward-thinking directors. Howard Shore’s growling, guttural score is engrossing, while the leading trio of performances by Mortensen, Seydoux, and Stewart are a virtual match made in heaven in bringing to life this speculative slice of post-human hell on Earth. In short: It’s a great film and highly recommended, but whatever you do, don’t see it on a full stomach. Trust me. —Toussaint Egan\nCure\nDirector: Kiyoshi Kurosawa\nCast: Kōji Yakusho, Tsuyoshi Ujiki, Anna Nakagawa\nWhere to watch: Criterion Channel\nKiyoshi Kurosawa’s 1997 horror masterpiece Cure follows Kenichi Takabe (Kōji Yakusho), a Japanese detective frustrated by an inexplicable rash of seemingly unconnected murders that nevertheless all appear to be connected, despite none of the perpetrators having known each other or having any recollection as to what possessed them to do it. When Takabe’s investigation leads him to a suspect, a student of psychology and mesmerism known as Mamiya (Masato Hagiwara), he finds himself plunged into a conspiracy that threatens to engulf anyone who gets too close.\nIn Cure, violence is less an act of premeditation or passion as it is a virus, coursing its way through the bloodstream of society, corrupting innocent bystanders not unlike aberrant cancer cells attacking from within without ever understanding why they did so in the first place. How do you confront a horror like that, much less stop it? The answer is as simple as it is terrifying: You can’t. —TE\nEyes Without a Face\nDirector: Georges Franju\nCast: Pierre Brasseur, Édith Scob, Alida Valli\nWhere to watch: Max, The Criterion Channel\nGeorges Franju’s influential 1960 film is a master class in supernatural fantasy horror. An unsettling tale about a plastic surgeon (played by Pierre Brasseur) who kidnaps young women and performs surgery on them to try and find a face replacement for his daughter (Édith Scob), Eyes Without a Face is equal parts haunting and beautiful. Scob’s iconic face mask in the movie was later referenced in her role in the also-excellent Holy Motors many decades later. —PV\nHellraiser\nDirector: Clive Barker\nCast: Andrew Robinson, Clare Higgins, Ashley Laurence\nWhere to watch: Prime Video, AMC+, Shudder, Tubi, Pluto, Hoopla\nClive Barker’s 1987 directorial debut adapts his 1986 novella The Hellbound Heart to tell the story of Larry (Andrew Robinson) and Julia Cotton (Clare Higgins). The Cottons are a married couple who move into the home of Larry’s recently deceased brother, Frank (Sean Chapman), with whom Julia had a previous affair. After inadvertently being resurrected by a drop of blood spilled by Larry on the floor of the house’s attic, Frank seduces Julia into luring new men to the house so that he can drain their life force and fully regain his mortal form. Surrounding this core narrative is the the story of the Lament Configuration, a puzzle box Frank acquired before his untimely death. When solved, it conjures hellish beings known as Cenobites to the mortal plane of existence, which indulge in hellish exercises of sadomasochistic mutilation. Easily the best and most enduring of the Hellraiser movie series, Barker’s 1987 original is a must-watch for horror fans. —TE\nHereditary\nDirector: Ari Aster\nCast: Toni Collette, Alex Wolff, Milly Shapiro\nWhere to watch: Max\nHereditary is a victim of its own success. The poster child for the misguided term “elevated horror,” and the subject of more than a few memes (particularly around telephone poles), the thing that often gets lost about Hereditary is that it’s actually really fucking good. And it’s damn scary too.\nThe movie follows Annie Graham, a difficult mother of two, who just lost her mom. During the funeral service, Annie notices quite a few people are here to mourn the mother she thought had no friends. She eventually learns this group of old people all belonged to the same bizarre semi-cult her mother did. And that’s where the witchy stuff starts.\nFrom there everything descends into a complicated mishmash of tightly coiled family drama, supernatural plotting, and years-old resentments, and it’s absolutely excellent. Who’s to say which is scarier in this movie, the verbal immolation or the literal one?\nEven if you’ve seen it already, you probably owe this movie a rewatch. You definitely remember that it’s good, but you probably don’t remember just how great it really is. Hereditary is elegantly creepy, right up until the point that it becomes terrifying. You can’t really ask any more from a horror movie than that. —Austen Goslin\nThe Host\nDirector: Bong Joon-ho\nCast: Song Kang-ho, Byun Hee-bong, Park Hae-il\nWhere to watch: Max, Roku Channel, Hoopla, Kanopy\nThe Host was Bong Joon-ho’s follow-up to the smash success serial killer drama Memories of Murder. A critical and commercial success, it was the highest-grossing South Korean film ever after its release and won Best Film at the Asian Film Awards and the Blue Dragon Film Awards.\nYears after chemicals are dumped into the Han River, a huge mutated fish monster emerges and kidnaps a young girl. Her father (Song Kang-ho) sets out to find and rescue her, before being kidnapped by the American scientists responsible for its existence. A fun monster thriller that doubles as insightful commentary on U.S. intervention, ecological disasters, and much more, The Host is a high mark in Bong’s impressive filmography. —PV\nHouse\nDirector: Nobuhiko Obayashi\nCast: Kimiko Ikegami, Miki Jinbo, Kumiko Ohba\nWhere to watch: Max, Criterion Channel\nFew movies are as weird and excellent as Nobuhiko Obayashi’s House.\nThe bizarre ghost story follows a group of school girls who take a vacation to a haunted mansion in the countryside of Japan. Everything starts off well enough, but before long the kids are being attacked by demonic gates, getting eaten by pianos, or opening portals to hell — all with visually an inventive silliness few movies have ever matched. House isn’t all that scary, but it is weird in all the best ways, and nothing else looks or feels like it. — AG\nIn the Mouth of Madness\nDirector: John Carpenter\nCast: Sam Neill, Julie Carmen, Jurgen Prochnow\nWhere to watch: YouTube\nAmong the wildest movies John Carpenter has ever made (and that’s saying something), In the Mouth of Madness follows insurance investigator John Trent (Sam Neill), who is hired to find a missing fame horror novelist. Things become increasingly unhinged as the plots of the author’s books and the various monsters seem to invade the real world. Neill, a staple of this list, is absolutely fantastic responding to the horrors of hell, slowly becoming exactly as off-kilter as they are. By the time the movie makes it to the third act, the door to hell is halfway open and Trent is ready to dive headfirst into the void, which is honestly how every movie’s third act should go.\nThis is also the third in Carpenter’s apocalypse trilogy, which also includes two other stone-cold classics, The Thing and Prince of Darkness. They aren’t on this list, but you should watch them anyway. — AG\nLet the Right One In\nDirector: Tomas Alfredson\nCast: Kåre Hedebrant, Lina Leandersson, Per Ragnar\nWhere to watch: Hulu, Prime Video, Roku Channel, Crackle, Hoopla, Kanopy\nA 12-year-old Swedish boy finds a friend in a vampire who looks roughly his age, but is actually an old vampire permanently trapped in the body of a young child. The film is kaleidoscopic, each viewing revealing something different than the last. The first time I saw the film, I was a pessimistic college student, and I read the central relationship as a warning about the parasitic nature of love. After college, the children’s bond reminded me of the impermanence of youth, and why growing up is a mixed blessing. This past year, I was far more focused on the girl’s relationship with her caretaker, an older man who sacrifices everything for her existence.\nThe film was adapted from John Ajvide Lindqvist’s 2004 novel of the same name, which inspired not just this Swedish film, but a 2010 American adaptation, a comic-book prequel, and two stage plays. The latter has its own legacy — it was adapted by the magnificent National Theater of Scotland, and it eventually had a run at St. Ann’s Warehouse in 2015. Few books inspire so much additional great art. So I suppose I’m recommending the book just as much as the film. —Chris Plante\nMalignant\nDirector: James Wan\nCast: Annabelle Wallis, Maddie Hasson, George Young\nWhere to watch: Max\nThere was just no way to see it coming. After the Conjuring and Insidious franchises, plus blockbuster turns with Furious 7 and Aquaman, James Wan could have cashed in chips to make another moody franchise-starter to stretch his jump-scare muscles. Instead, he made Malignant, a high-emotion giallo stuffed into dingy ’90s direct-to-video pastiche like some kind of horror-movie turducken. Wan pulls back the layers in an almost tedious fashion: The pregnant Madison (Annabelle Wallis) is first the victim of domestic abuse, then she encounters another killer, and then she starts dealing with psychotic episodes tied to her childhood imaginary friend Gabriel, and theeeeen it’s revealed… Well, please go behold it.\nStrung together with a melodramatic cover of The Pixies’ “Where Is My Mind,” reveling in horror tropes to the point of parody, the final twists of Malignant are some of the most gratifying lunacy of the year, and the acrobatic actor Marina Mazepa brings it all home in a display of gruesome ballet. I won’t explain anything more out of fear of spoilers — just get on the Malignant train. Wan put his dream (nightmare?) on screen for us all to enjoy. —Matt Patches\nThe Mist\nDirector: Frank Darabont\nCast: Thomas Jane, Marcia Gay Harden, Laurie Holden\nWhere to watch: Digital rental\/purchase\nAny fan of Stephen King worth their salt knows that the so-called king of horror has a lot of movie adaptations of his work. Few films have managed to eclipse, let alone successfully adapt, King’s capacity for horror storytelling, with the exception of (a) Stanley Kubrick’s The Shining and (b) Frank Darabont’s The Mist.\nDarabont’s third adaptation of a Stephen King story, the film stars Thomas Jane (The Expanse) as a Hollywood poster artist living in Maine who, along with his wife and son and the rest of his neighbors, takes shelter in a supermarket in the wake of a mysterious storm that covers the town in a deadly mist.\nSupernatural, otherworldly horrors abound throughout The Mist, but the greatest horror of all is — you guessed it — humanity itself, as seen in the way the townspeople succumb to the temptation to scapegoat those among themselves under the influence of a local religious fanatic. The ending is a gut-punch and sincerely one of the most chilling in any mainstream horror film of its time. If you’ve managed to go unspoiled until now, I won’t ruin the surprise, but needless to say, it’s worth it. —TE\nNight of the Living Dead\nDirector: George A. Romero\nCast: Duane Jones, Judith O’Dea, Marilyn Eastman\nWhere to watch: Max, Peacock, MGM Plus, Paramount Plus, Roku Channel\nThe movie that launched the modern zombie film in the United States, George A. Romero’s debut feature was written, directed, photographed, and edited by the nascent zombie film master on a shoestring budget, which only adds to the eerie atmosphere and grounded terror. In this film, a group of survivors hide out in an abandoned house in western Pennsylvania at the start of a zombie apocalypse. Led by the level-headed Ben (Duane Jones), the group not only has to deal with the conflict of zombies trying to break in, but internal conflicts stemming from disagreements on how to handle their precarious predicament.\nNight of the Living Dead is the first example of Romero’s typical blend of jaw-dropping (and stomach-churning) practical effects and astute social commentary. Fun fact: This movie came out a month before the MPAA film rating system, which meant a heaping amount of controversy when children were able to see the quite graphic movie in theaters. And another fun fact: Night of the Living Dead was never copyrighted and is in the public domain because of an error by the original theatrical distributor. —PV\nPossession\nDirector: Andrzej Żuławski\nCast: Isabelle Adjani, Sam Neill, Heinz Bennent\nWhere to watch: Shudder, AMC Plus, Metrograph\nOutside of the most ardent of cinephile circles, Andrzej Żuławski isn’t a name that inspires enthusiastic recognition in the United States. Known for his transgressive brand of arthouse cinema, Żuławski’s career was stymied by Communist authorities in his homeland of Poland, with many of his early films being either heavily censored, banned, or, in one instance, nearly destroyed upon release. It also doesn’t help that the few films of his that have been released in the States have since gone out of print — though that appears to be changing soon.\nIf you do know Żuławski’s name, it’s likely for his 1981 psychological horror film Possession, a film whose cult status among horror connoisseurs has only been amplified in the decades since its release by its difficulty to obtain on physical media or to view online. Fortunately for everyone, that’s no longer the case.\nSet in Cold War-era West Berlin, Żuławski’s film stars Jurassic Park’s Sam Neill as Mark, a Russian spy who returns home to find that his wife, Anna (Isabelle Adjani), has left him and wants a divorce. When Anna refuses to divulge why, only saying that she has not left him for someone else, Mark grows suspicious and has her tailed. What he eventually discovers is a horrifying secret beyond his comprehension, one which awakens a long-dormant wellspring of anxiety, resentment, and despair between the two that threatens to tear apart not only their small family, but their very sanity as well.\nInspired by Żuławski’s own tumultuous divorce in 1976 and his subsequent struggles with suicidal ideation, Possession blurs the line between the autobiographical and the phantasmagorical, with hysterical performances by Neill and Adjani that vacillate between disturbing, comical, and disquietingly sympathetic. An inspiration for everything from Ari Aster’s Midsommar to the 2016 music video for Massive Attack’s “Voodoo in My Blood,” Possession is an essential watch for any serious horror fan. —TE\n[REC]\nDirectors: Jaume Balaguero, Paco Plaza\nCast: Manuela Velasco, Ferran Terraza, Martha Carbonell\nWhere to watch: Prime Video\nOne of the best and most disturbing found-footage movies ever, [REC] follows a TV reporter and camera person who follow emergency workers into an apartment building, only to discover the dark truth inside: Some of the residents are turning into monsters. Set squarely in the zombie-craze of the mid-2000s, [REC]’s undead creatures owe quite a bit to the raving cannibal infected of 28 Days Later, but the Spanish movie’s flesh-eaters are quite a bit creepier and more disturbed than their predecessors. While many found-footage movies obscure their scariest moments, [REC] uses the format to enhance its creeping dread and drag out the character’s slow careful exploration of the apartment building, ramping the tension up to 11 just in time for the downright terrifying finale. — AG\nSputnik\nDirector: Egor Abramenko\nCast: Oksana Akinshina, Fedor Bondarchuk, Pyotr Fyodorov\nWhere to watch: Hulu\nIf you’re hungry for a great piece of contemporary Russian sci-fi horror (i.e., something not directed by either Andrei Tarkovsky or Yakov Protazanov), then Egor Abramenko’s 2020 directorial debut is just the film you’re looking for.\nSet during 1983 at the height of Cold War tensions, Sputnik (which for your information is Russian for “fellow traveler”) centers on Tatyana (Oskana Akinshina), an uncompromising young psychiatrist with a staunch attitude with regard to the ends justifying the means. Tatyana is recruited by the Soviet military to treat Konstantin (Pyotr Fyodorov), a wounded cosmonaut and the lone survivor of a mysterious satellite crash. Only upon arriving at the remote hospital facility housing the patient and interacting with him does Tatyana come to realize the horrifying truth: Konstantin did not in fact return from space alone; rather, his body has now become the unwitting host to an organism unlike anything seen on Earth. Caught between her duty to study the creature and her desire to save Konstantin from further harm, Tatyana must make a hard decision upon which the very survival of all humanity may rest.\nWhat makes Abramenko’s debut so compelling is how it takes the basic premise of the “trolley problem” thought experiment and twists it repeatedly (and successfully) to dramatic emotional effect. Akinshina (The Bourne Supremacy) delivers a convincing and compelling performance as Tatyana, a woman forced to confront and overcome the uncompromising attitude that had once assured her success but now threatens to endanger not only another man’s life, but potentially the lives of everyone on the planet along with her own soul. Fyodorov, for his own part, delivers a sympathetically complex (and on occasion, implicitly sinister) performance as Konstantin, a Russian “hero” torn between his perceived duty to his country and his emotional obligation to a loved one he all but abandoned before embarking on his most recent mission. The creature design in this movie is terrific, as is the cinematography and the film’s score.\nHaving previously been slated for a world premiere at the 2020 Tribeca Film Festival and subsequently dumped on video-on-demand in the wake of the COVID-19 pandemic, Sputnik is exactly the kind of horror movie this list was intended to spotlight: a kind of rare gem of intellectually and viscerally stimulating horror that otherwise goes unappreciated if not given the opportunity to shine. —TE\nSuspiria\nDirector: Dario Argento\nCast: Jessica Harper, Stefania Casini, Flavio Bucci\nWhere to watch: Tubi, Kanopy\nOne of the best-looking movies of all time with one of the best soundtracks of all time. What’s better than that?\nDario Argento’s Suspiria tells the story of Suzy Bannion, an American dancer who moves to Germany to study at the prestigious Tanz Akademie. It just so happens that the academy is run by witches. As the facade of the school unravels, Suzy’s fellow students slowly start going missing or dropping dead in increasingly bizarre and horrible ways.\nWhile the plot for Suspiria is interesting, what really makes the movie great is how it looks and how it sounds. Everything about the production design, the costumes, and the colors is eccentric in ways no other horror movie has ever matched. Couple all that with the incredible and haunting soundtrack from European rock band Goblin, and Suspiria becomes an unforgettable horror classic that everyone should see at least once. — AG\nThe Texas Chain Saw Massacre\nDirector: Tobe Hooper\nCast: Marilyn Burns, Gunnar Hansen, Allen Danziger\nWhere to watch: Peacock, Shudder, AMC Plus, Tubi, Freevee\nAnother shoestring production gone huge, Tobe Hooper’s 1974 masterpiece made over $30 million at the box office on a budget of around $140,000. The movie follows a group of friends who find themselves hunted by a family of cannibals in the middle of Texas, and is a chilling, violent fever dream that permanently lodges itself in the minds of those who watch it.\nEight films have followed, including a Netflix version in 2022, but the original stands out as an unhinged encapsulation of pure chaos and terror. At a tight 83 minutes, the original Texas Chain Saw Massacre is well worth the small time investment to catch up on one of the most influential horror movies ever made. —PV\nThe Thing\nDirector: John Carpenter\nCast: Kurt Russell, Wilford Brimley, Keith David\nWhere to watch: Peacock\nJohn Carpenter’s postmodern creature feature takes the idea of alien monsters and makes them simultaneously more recognizable and more gross and unworldly than in any other movie in history. The Thing, the second adaptation of the excellent novella Who Goes There?, remains thrilling, terrifying, and absolutely disgusting more than 40 years after its release.\nThe Thing follows a group of researchers working at an Antarctic base. Suddenly, a dog from a local Norwegian camp rushes into their base, with Norwegian men hot on its heels, trying to kill it by any means necessary. However, once the American crew takes the dog in and shelters it, they discover it’s an alien that can transform into any living creature, mimicking it perfectly — and that makes every one of them a suspect.\nIt’s one of the great paranoid thriller premises of all time, but it just so happens to also be filled with gross and fantastic alien gore. There’s nothing quite like The Thing. —AG\nThe Unfriended movies\nDirector: Levan “Leo” Gabriadze (Unfriended); Stephen Susco (Unfriended: Dark Web)\nCast: Shelley Hennig, Moses Storm, Renee Olstead (Unfriended); Colin Woodell, Rebecca Rittenhouse, Betty Gabriel (Unfriended: Dark Web)\nWhere to watch: Criterion Channel (Unfriended); Digital rental\/purchase (Both movies)\nAs many people have learned over the past few years, there aren’t that many things scarier than a video call you can’t leave.\nA masterfully contained horror movie that makes full use of its (at the time) groundbreaking gimmick, Unfriended is a tense teen horror movie that takes place entirely on a character’s laptop screen. Definitely watch it on a laptop if you can, and check out the very good sequel Unfriended: Dark Web if you dug this one. —PV\nFrom our list of the best horror movies on Netflix:\nLevan Gabriadze’s Unfriended pulls the audiences through the screen — almost literally. Viewed entirely from the perspective of a computer desktop, 2014 supernatural horror film centers around a Skype call between a group of high school students who are joined by an unknown presence known only as “billie227.” What at first appears to be a prank swiftly morphs into something much more horrific, as the mysterious stranger begins to reveal terrifying secrets about each of the friends before killing them off one by one. Unfriended is thoroughly gripping extrapolation of our always-online world, a world where vengeful poltergeists and doxxing exist side by side and no secret or offense goes undiscovered or unpunished. —TE\nUs\nDirector: Jordan Peele\nCast: Lupita Nyong’o, Winston Duke, Elisabeth Moss\nWhere to watch: Netflix\nJordan Peele’s already a horror master just three movies into his career, but Us probably still doesn’t have the reputation it deserves. His 2019 psychological slasher had the unfortunate fate of following up the cultural phenomenon of Get Out, so it had a hard time breaking through, in the way that sophomore projects often do. But taken on its own terms, Us is a fantastic little horror movie with tons of atmosphere and an underground society’s worth of great scares.\nThe movie follows the Wilson family, whose vacation is interrupted by the arrival of a group of doppelgängers who match up with each member of the family perfectly. The clones, it turns out, are called Tethered, and where they come from is very complicated. But before any kind of explanation of the Tethered, what we see is a parade of violent attacks, home invasions, and some very tense encounters between Lupita Nyong’o and herself.\nUs may not be Peele’s best movie, but it is a fascinating mix of slasher thrills and world- building, supported by a fantastic cast all operating at their A games. While the entire cast is great, Elizabeth Moss is a particular standout for her extremely brief but extraordinarily loathsome role as one of the family’s friends. Her performance gives this movie so much of its weird off-kilter vibe, and leads to some of its most unstintingly and gleefully over-the-top violence. Alongside the terrifying tone, Peele manages to build an entire second world underneath our own, and will give you a very unhealthy fear of what you’re really seeing when you look in the mirror. —AG\n\nThis article, authored by Toussaint Egan, was published by Polygon on 2023-09-28 under the category 'entertainment'.\n\n","id":563}
{"title":"EU lawmakers bag late night deal on ‘global first’ AI rules","context":"## EU lawmakers bag late night deal on ‘global first’ AI rules\n\nAfter marathon ‘final’ talks which stretched to almost three days European Union lawmakers have tonight clinched a political deal on a risk-based framework for regulating artificial intelligence. The file was originally proposed back in April 2021 but it’s taken months of tricky three-way negotiations to get a deal over the line. The development means a pan-EU AI law is definitively on the way.\nGiving a triumphant but exhausted press conference in the small hours of Friday night\/Saturday morning local time key representatives for the European Parliament, Council and the Commission — the bloc’s co-legislators — hailed the agreement as hard fought, a milestone achievement and historic, respectively.\nTaking to X to tweet the news, the EU’s president, Ursula von der Leyen — who made delivering a regulation to promote “trustworthy” AI a key priority of her term when she took up the post in late 2019 — also lauded the political agreement as a “global first”.\nThe 🇪🇺 AI Act is a global first. A unique legal framework for the development of AI you can trust. And for the safety and fundamental rights of people and businesses. A commitment we took in our political guidelines – and we delivered. I welcome today's political agreement. — Ursula von der Leyen (@vonderleyen) December 8, 2023\nProhibitions\nFull details of what’s been agreed won’t be entirely confirmed until a final text is compiled and made public, which may take some weeks. But a press release put out by the European Parliament confirms the deal reached with the Council includes a total prohibition on the use of AI for:\nbiometric categorisation systems that use sensitive characteristics (e.g. political, religious, philosophical beliefs, sexual orientation, race);\nuntargeted scraping of facial images from the internet or CCTV footage to create facial recognition databases;\nemotion recognition in the workplace and educational institutions;\nsocial scoring based on social behaviour or personal characteristics;\nAI systems that manipulate human behaviour to circumvent their free will;\nAI used to exploit the vulnerabilities of people (due to their age, disability, social or economic situation).\nThe use of remote biometric identification technology in public places by law enforcement has not been completely banned — but the parliament said negotiators had agreed on a series of safeguards and narrow exceptions to limit use of technologies such as facial recognition. This includes a requirement for prior judicial authorisation — and with uses limited to a “strictly defined” lists of crime.\nRetrospective (non-real-time) use of remote biometric ID AIs will be limited to “the targeted search of a person convicted or suspected of having committed a serious crime”. While real-time use of this intrusive AI tech will be limited in time and location, and can only be used for the following purposes:\ntargeted searches of victims (abduction, trafficking, sexual exploitation),\nprevention of a specific and present terrorist threat, or\nthe localisation or identification of a person suspected of having committed one of the specific crimes mentioned in the regulation (e.g. terrorism, trafficking, sexual exploitation, murder, kidnapping, rape, armed robbery, participation in a criminal organisation, environmental crime).\nThe Council’s press release on the deal emphasizes that the provisional agreement “clarifies that the regulation does not apply to areas outside the scope of EU law and should not, in any case, affect member states’ competences in national security or any entity entrusted with tasks in this area”. It also confirms the AI act will not apply to systems exclusively for military or defence purposes.\n“Similarly, the agreement provides that the regulation would not apply to AI systems used for the sole purpose of research and innovation, or for people using AI for non-professional reasons,” the Council added.\nCivil society groups have reacted sceptically — raising concerns the agreed limitations on state agencies’ use of biometric identification technologies will not go far enough to safeguard human rights. Digital rights group EDRi, which was among those pushing for a full ban on remote biometrics, said that whilst the deal contains “some limited gains for human rights”, it looks like “a shell of the AI law Europe really needs”.\nReal-time public facial recognition (RBI): disappointingly, but not surprisingly, member states resisted a full ban. The Parliament fought hard to narrow exceptions and add more safeguards, but it doesn't look like it will be enough to stop widespread biometric mass surveillance; — Ella Jakubowska (@ellajakubowska1) December 9, 2023\nRules for ‘high risk’ AIs, and general purpose AIs\nThe package agreed also includes obligations for AI systems that are classified as “high risk” owing to having “significant potential harm to health, safety, fundamental rights, environment, democracy and the rule of law”.\n“MEPs successfully managed to include a mandatory fundamental rights impact assessment, among other requirements, applicable also to the insurance and banking sectors. AI systems used to influence the outcome of elections and voter behaviour, are also classified as high-risk,” the parliament wrote. “Citizens will have a right to launch complaints about AI systems and receive explanations about decisions based on high-risk AI systems that impact their rights.”\nThere was also agreement on a “two-tier” system of guardrails to be applied to “general” AI systems, such as the so-called foundational models underpinning the viral boom in generative AI applications like ChatGPT.\nAs we reported earlier, the deal reached on foundational models\/general purpose AIs (GPAIs) includes some transparency requirements for what co-legislators referred to as “low tier” AIs — meaning model makers must draw up technical documentation and produce (and publish) detailed summaries about the content used for training in order to support compliance with EU copyright law. For “high-impact” GPAIs (defined as the cumulative amount of compute used for their training measured in floating point operations is greater than 10^25) with so-called “systemic risk” there are more stringent obligations.\n“If these models meet certain criteria they will have to conduct model evaluations, assess and mitigate systemic risks, conduct adversarial testing, report to the Commission on serious incidents, ensure cybersecurity and report on their energy efficiency,” the parliament wrote. “MEPs also insisted that, until harmonised EU standards are published, GPAIs with systemic risk may rely on codes of practice to comply with the regulation.”\nThe Commission has been working with industry on a stop-gap AI Pact for some months — and it confirmed today this is intended to plug the practice gap until the AI Act comes into force.\nWhile foundational models\/GPAIs that have been commercialized face regulation under the Act, R&D is not intended to be in scope of the law — and fully open sourced models will have lighter regulatory requirements than closed source, per today’s pronouncements.\nThe package agreed also promotes regulatory sandboxes and real-world-testing being established by national authorities to support startups and SMEs to develop and train AIs before placement on the market.\nPenalties and entry into force\nPenalties for non-compliance can lead to fines ranging from €35 million or 7% of global turnover to €7.5 million or 1.5 % of turnover, depending on the infringement and size of the company, per the parliament.\nThe Council’s PR further stipulates that the higher sanction (7%) would apply for violations of the banned AI applications, while penalties of 1.5% would be levied for the supply of incorrect information. Additionally, it says sanctions of 3% could be imposed for violations of other AI Act obligations but also notes that the provisional agreement allows for “more proportionate caps” on administrative fines for SMEs and start-ups in case of infringements. So there looks to be some scope for AI startups to face smaller penalties for infringements than AI giants may invite.\nThe deal agreed today also allows for a phased entry into force after the law is adopted — with six months allowed until rules on prohibited use cases kick in; 12 months for transparency and governance requirements; and 24 months for all other requirements. So the full force of the EU’s AI Act may not be felt until 2026.\nCarme Artigas, Spain’s secretary of state for digital and AI issues, who led the Council’s negotiations on the file as the country has held the rotating Council presidency since the summer, hailed the agreement on the heavily contested file as “the biggest milestone in the history of digital information in Europe”; both for the bloc’s single digital market — but also, she suggested, “for the world”.\n“We have achieved the first international regulation for artificial intelligence in the world,” she announced during a post-midnight press conference to confirm the political agreement, adding: “We feel very proud.”\nThe law will support European developers, startups and future scale-ups by giving them “legal certainty with technical certainty”, she predicted.\nSpeaking on behalf of the European Parliament, co-rapporteurs Dragoș Tudorache and Brando Benifei said their objective had been to deliver AI legislation that would ensure the ecosystem developed with a “human centric approach” which respects fundamental rights and European values.\nTheir assessment of the outcome was equally upbeat — citing the inclusion in the agreed text of a total ban on the use of AI for predictive policing and for biometric categorization as major wins.\n“Finally we got in the right track, defending fundamental rights to the necessity that is there for our democracies to endure such incredible changes,” said Benifei, who just a few weeks ago was sounding doubtful a deal could be found. “We are the first ones in the world to have a horizontal legislation that has this direction on fundamental rights, that supports the development of AI in our continent, and that is up to date to the frontier of the artificial intelligence with the most powerful models under clear obligation. So I think we delivered.”\n“We have always been questioned whether there is enough protection, whether there is enough stimulant for innovation in this text, and I can say, this balance is there,” added Tudorache. “We have safeguards, we have all the provisions that we need, the redress that we need in giving trust to our citizens in the interaction with AI, in the products in the services that they will interact with from now on.\n“We now have to use this blueprint to seek now global convergence because this is a global challenge for everyone. And I think that with the work that we’ve done, as difficult as it was — and it was difficult, this was a marathon negotiation by all standards, looking at all precedents so far — but I think we delivered.”\nThe EU’s internal market commissioner, Thierry Breton, also chipped in with his two euro-cents — describing the agreement clinched a little before midnight Brussels’ time as “historic”. “It is a full package. It is a complete deal. And this is why we spent so much time,” he intoned. “This is balancing user safety, innovation for startups, while also respecting… our fundamental rights and our European values.”\nClear road ahead?\nDespite the EU very visibly patting itself on the back tonight on securing a deal on ‘world-first’ AI rules, it’s not quite yet the end of the road for the bloc’s lawmaking process as there are still some formal steps to go — not least the final text will face votes in the parliament and the Council to adopt it. But given how much division and disagreement there has been over how (or even whether) to regulate AI the biggest obstacles have been dismantled with this political deal and the path to passing the EU AI Act in the coming months looks clear.\nThe Commission is certainly projecting confidence. Per Breton, work to implement the agreement starts immediately with the set up of an AI Office within the EU’s executive — which will have the job of coordinating with the Member State oversight bodies that will need to enforce the rules on AI firms; and overseeing the most advanced AI models, including by contributing to fostering standards and testing practices. A scientific panel of independent experts will be appointed to advise the AI Office about GPAI models. “We will welcome new colleagues… a lot of them,” said Breton. “We will work — starting tomorrow — to get ready.”\nOpposition to the inclusion in the AI package of tiered rules for general purpose AIs has been led, in recent weeks, by France — and French AI startup Mistral, which had been lobbying for a total carve out from obligations for foundational models\/GPAIs. In the event the deal agreed by the Spanish presidency does contain some obligations for GPAIs and foundation models. So it’s not the total carve out Mistral and its lobbyists have been pushing for.\nResponding to news of the political deal last night, France’s digital minister’s office put out a statement attributed to Jean-Noël Barrot which said (translated from French using AI): “We will be carefully analyzing the compromise reached today, and in the coming weeks we will ensure that the text preserves Europe’s ability to develop its own artificial intelligence technologies, and safeguards its strategic autonomy.”\nIt remains unclear how much of a carve out Mistral’s business might enjoy under the deal agreed. Asked about this during the press conference, Artigas suggested the French AI startup would — once commercialized — be likely to fit in the “low tier” for GPAIs, meaning it would have only limited transparency obligations, since she said it does not hit the high capacity compute threshold triggering the systemic risk obligations (as she said it’s using what’s thought to be 10^23 of compute, not 10^25).\nHowever, as Mistral is currently still in an R&D and pre-training phase for their models, she said they would be excluded from even the low tier compliance requirements.\nThis report was updated to include the response from the French digital ministry; link to the Council’s PR; and with additional details from the presser — including remarks about how the law might apply to Mistral. We also added details on civil society’s response\n\nThis article, authored by Natasha Lomas, was published by TechCrunch on 2023-12-09 under the category 'technology'.\n\n","id":564}
{"title":"Mysterious dog respiratory illness: What to know","context":"## Mysterious dog respiratory illness: What to know\n\nThe mysterious respiratory illness that may have sickened scores of dogs across the country could be caused by a new type of bacterial infection that may be very good at evading the canine immune system, researchers say. Some dogs have died from the illness, which starts with causes a cough that can last for weeks, runny eyes and sneezing.\nIn a development that might help shed light on the illness, which has affected a variety of dog breeds, researchers at the University of New Hampshire’s Veterinary Diagnosis Laboratory and the Hubbard Center for Genome Studies told NBC News they have identified a pathogen that might be what’s making pets sick.\nThrough a genetic sequencing of samples from an initial group of 30 dogs from New Hampshire who were infected last year and then an additional 40 from Rhode Island and Massachusetts who got sick this year, the researchers say they have discovered a previously unknown germ.\nThe pathogen is “a funky bacterium,” said Dr. David Needle, pathology section chief at the College of Life Sciences and Agriculture at the University of New Hampshire. “It’s smaller than a normal bacterium in its size and in the size of its genome. Long story short, it’s a weird bacterium that can be tough to find and sequence.”\nThe germ “is new as a potential cause of disease, but it is likely to be— or to have evolved from — a component of the dog microbiome,” he said. Dogs as well as humans have multiple types of harmless bacteria and other microorganisms living both inside and outside the body. In the gut, they are thought to aid in digestion.\nThe bacterium was discovered after a painstaking search.\n“After initial sequencing showed there were no known viral, bacterial or fungal pathogens, time consuming and dogged work by graduate student Lawrence Gordon showed that 21 of the initial 30 samples from New Hampshire had some genetic material from one atypical bacterial species,” Needle said.\nThe UNH team is sharing its results prior to publishing a research article, hoping they will give veterinarians some information as they deal with other respiratory syndrome outbreaks, he said.\nScientists aren’t even sure yet whether the same bug is making dogs sick across the nation. Many researchers have wondered whether it was a bacterial or a viral pathogen. One thing veterinarians do know is that the germ is something they don’t recognize.\nMike Stepien, a spokesperson for the USDA Animal and Plant Health Inspection Service (APHIS), said in an email Wednesday the agency is working with multiple state animal health officials and diagnostic labs regarding the respiratory illness in dogs that, \"in rare cases, has progressed rapidly to death.\"\n\"APHIS and partners have not yet definitively identified the cause of illness,\" Stepien responded in an email. \"There are no reports of human illness affiliated with these cases at this time.\"\nNew Hampshire is one of a handful of states that have reported cases of the respiratory infection in dogs.\nThe Oregon Agriculture Department has received more than 200 case reports from veterinarians around the state since the beginning of August, spokesperson Andrea Cantu-Schomus said in an email. A very small percentage of the dogs have died, Cantu-Schomus said.\nOther states with possible cases include:\nIn conversations with veterinarians, Dr. Karl E. Jandrey, a professor of clinical small animal emergency and critical care at the University of California, Davis, School of Veterinary Medicine, has heard of potential cases in North Carolina, Rhode Island and Virginia, as well.\nBecause there is no test yet for the illness and because many of the symptoms are similar to other respiratory infections, such as canine influenza and Bordetella (kennel cough), it’s unknown exactly how many dogs have been affected. With hundreds of cases identified by symptoms reported only in Oregon, it’s likely there are thousands.\nNormally, to determine what antibiotics might work best against a particular type of bacteria, labs grow the bugs in a petri dish and then try to kill them with various medications. Needle and his colleagues have not been able to grow the new bacteria in the lab. Nevertheless, its structure offers some clues about which medications might be the best choice to fight it, he said. The antibiotic doxycycline may be effective, he suggested.\nIf it turns out that the New Hampshire researchers have found the right microbe, that may explain why some dogs are getting very sick, said Jandrey.\nSmaller pathogens are likely to have an easier time making it past a dog’s defenses in the upper respiratory tract and getting down into the lungs, he said. “If it goes into the lungs, there’s a risk of pneumonia,” he added.\nWhat are the dog infection symptoms?\nAccording to Oregon’s Cantu-Schomus, the dogs’ illnesses largely develop in three ways:\nAs an inflammation of the tubes that connect the throat to the lungs that is minimally or not responsive to antibiotics.\nAs chronic pneumonia that is minimally or not responsive to antibiotics.\nAs acute pneumonia that rapidly becomes severe and often leads to severe illness or possibly death in as little as 24 to 36 hours.\nIf a dog has a cough that won’t quit and other respiratory symptoms, it’s recommended that the owner contact a veterinarian right away.\nWhile the respiratory symptoms seem to be like a viral illness, testing has been negative for a virus, Cantu-Schomus said.\nIt’s very unlikely that the cause will turn out to be viral, said Colin Parrish, a professor of virology at the College of Veterinary Medicine at Cornell University. “With the sequencing methods people use to look for unknown viruses, its signature would have been clear in a few days,” he added.\nSo it’s possible that the New Hampshire scientists could have hit upon the right pathogen, although their results need to be confirmed by more research, he said.\nWhat owners should do\nThe American Kennel Club’s chief veterinarian offered advice for both dog owners and their vets.\nFirst, owners should make sure their pets are fully vaccinated and boosted against the known canine diseases, said Dr. Jerry Klein, a practicing vet for 35 years and who was emergency department head emeritus at MedVet Chicago and currently works at the McKillip Animal Hospital in Chicago.\nKlein recommends that veterinarians suggest a full respiratory panel when people bring in sick dogs, but acknowledges that may be an expense some owners can’t afford.\nIf a dog’s veterinarian doesn’t suggest the panel, then owners should request it; that will help determine if the germ is one that vets already know about or is something new.\nPeople can call their local emergency vets to find out if there has been an increase in respiratory infections coming in for treatment, Klein said.\n“That would be a way to find out whether there’s been an uptick in your area,” he said. “If there is, then they should try to protect against exposure by avoiding grooming establishments and daycare.”\nKlein also recommends that groomers and daycare facilities not allow dogs to share food and water dishes.\nEven though a record number of Americans are expected to travel during the holiday season, experts recommend that dog owners keep their pets out of kennels and other areas, such as dog parks, where infection might be more likely because of crowded conditions and close contact.\n“When you congregate a bunch of animals together, there’s a larger likelihood of getting an infectious disease from other dogs,” said Dr. Kurt Williams, director of the Oregon Veterinary Diagnostic Lab at the Carlson College of Veterinary Medicine at Oregon State University.\nStill, he said, there are some facilities where you are less likely to have a problem because of how they are designed.\n“I’ve been telling people to work closely with their vet,” Williams said. “And to make sure their dog has all the vaccines available, in particular those for respiratory diseases we are familiar with.”\nAnother option is for owners to hire a house sitter, Needle said. “Or hire a dog walker,” he added. “It might not be perfect, but it’s better than nothing. Also, you might want to consider having Thanksgiving at home.”\nUltimately, your dog might be happier at home with a house sitter or a dog walker stopping by multiple times during the day than going to a kennel, Jandrey said.\n“It’s best to leave them in their own environment,” he added.\nThis article was originally published on NBCNews.com\n\nThis article was published by Yahoo News on 2023-11-21 under the category 'science'.\n\n","id":565}
{"title":"Dangerous 'superbugs' are a growing threat, and antibiotics can't stop their rise. What can?","context":"## Dangerous 'superbugs' are a growing threat, and antibiotics can't stop their rise. What can?\n\nBacteria's rising resistance to antibiotics is making the drugs obsolete. Scientists are fighting back with viruses (pictured), CRISPR, designer molecules and cell-slicing enzymes.\nThe bacteria may have entered her flesh along with shrapnel from the bomb detonated in Brussels Airport in 2016. Or perhaps the microbes hitched a ride on the surgical instruments used to treat her wounds. Either way, the \"superbug\" refused to be vanquished, despite years of antibiotic treatment.\nThe woman had survived a terrorist attack but was held hostage by drug-resistant Klebsiella pneumoniae, a bacterial strain often picked up by surgery patients in hospitals. Only by combining antibiotics with a new, experimental treatment did doctors finally rid her of the superbug .\nDevastating drug-resistant bacterial infections like this one are all too common, and they represent an ever-growing threat to global health. In 2019, antibiotic-resistant bacteria directly killed roughly 1.27 million people worldwide and contributed to an additional 3.68 million deaths. In the U.S. alone, drug-resistant bacteria and fungi together cause an estimated 2.8 million infections and 35,000 deaths each year.\nAnd the problem is getting worse: Seven of the 18 concerning bacteria tracked by the Centers for Disease Control and Prevention (CDC) are becoming more resistant to common antibiotics considered essential for maintaining public health. Meanwhile, drug companies have been slow to make new antibiotics capable of beating the microbes. Fewer than 30 antibiotics currently in the development pipeline target \"priority\" bacteria , as defined by the World Health Organization (WHO), and most of those drugs are still vulnerable to resistance, just like their predecessors.\nThis table of select antibiotic-resistant bacteria demonstrates how rapidly important types of resistance developed after the approval and release of new antibiotics. (Image credit: Centers for Disease Control and Prevention. Adapted by Live Science from the CDC's \"Select Germs Showing Resistance Over Time\" Fact Sheet.)\nSo some scientists are looking beyond traditional antibiotics for new weapons that won't fuel the rise of superbugs. Their emerging arsenal features viruses that kill bacteria; CRISPR; and microbe-slaying molecules. They hope that these experimental treatments, some of which have been tested in patients, will kill superbugs without promoting resistance.\n\"The vision, for me, is that we move beyond antibiotics and really just see a much broader palate of options,\" Chase Beisel, leader of the RNA synthetic biology research group at the Helmholtz Institute for RNA-based Infection Research in Germany, told Live Science.\nBut until these new therapeutics are ready for prime time, the world needs to curtail its overuse and misuse of antibiotics, which experts say is speeding up the rate at which these lifesaving drugs become obsolete.\nRelated: Superbugs are on the rise. How can we prevent antibiotics from becoming obsolete?\nHow antibiotic resistance emerges and spreads\nAntibiotics either directly kill bacteria or slow their growth , leaving the immune system to finish the job. The drugs work in several ways — by preventing bacteria from building sturdy walls or making copies of their DNA , for instance. Growth-slowing antibiotics usually disrupt ribosomes, the factories in which bacterial cells make proteins.\nMany antibiotics shoot for the exact same molecular targets , and so-called broad-spectrum antibiotics' mechanisms are so universal that they work on both major classes of bacteria : gram-positive and gram-negative, which are distinguished by the makeup and thickness of their cell walls. Broad-spectrum antibiotics, in particular, pressure both harmful and helpful bacteria in the body to evolve defensive strategies that eject or disable the drugs, or else alter their targets.\nDrug-resistant bacteria can transfer their resistance to additional bacteria in several ways. (Image credit: Centers for Disease Control and Prevention. Adapted by Live Science from the CDC's \"How Resistance Moves Directly Germ to Germ\" Fact Sheet.)\nBacteria can pick up such defenses through random DNA mutations, or by swapping \"resistance genes\" with other bacteria via a process called horizontal gene transfer. By making these gene transfers, bacteria can quickly spread such mutations to additional bacterial populations in the body and in the environment.\nThe misuse of antibiotics in health care, as well as in agriculture, has given bacteria endless opportunities to develop resistance, raising the chance that once-treatable infections will become life-threatening.\nRelated: New 'concerning' strain of drug-resistant gonorrhea found in U.S. for 1st time\nHarnessing viruses to fight bacteria\nOne of the proposed alternatives to antibiotics was first conceived more than a century ago, before the 1928 discovery of penicillin. Called phage therapy, it uses bacteria-infecting viruses called bacteriophages, or simply \"phages,\" which typically kill the germs by invading their cells and splitting them open from the inside.\nPhages can also pressure bacteria into giving up key tools in their drug resistance tool kits. For example, a phage called U136B can have this effect on E. coli. To infiltrate E. coli, the phage uses an efflux pump, a protein E. coli normally uses to pump antibiotics out of the cell. If the E. coli tries to change this pump to escape the phage, it reduces the bacterium's ability to pump out antibiotics.\n\"If phage therapy were used at a global scale ... it would not lead to the same problem of widespread resistance.\" Paul Turner, Yale University\nAnd unlike with antibiotics, bacteria are unlikely to gain widespread resistance to phage therapy , said Paul Turner , director of the Center for Phage Biology and Therapy at Yale University.\nTurner and other experts have concluded that, \"if phage therapy were used at a global scale, that it would not lead to the same problem of widespread resistance to it, the way that antibiotic use has led to that problem,\" he told Live Science.\nHere's why: Antibiotic resistance has been dramatically accelerated by the misuse and overuse of antibiotics , especially broad-spectrum antibiotics that work on a variety of bacteria. Phages, by contrast, can have much narrower targets than even narrow-spectrum antibiotics — for instance, targeting a protein found in only one or a few strains within one bacterial species.\nRelated: New drugs could stymie superbugs by freezing evolution\nThe target bacterium can still evolve resistance to an individual phage — but by picking the right combination of phages, scientists can make it so that the bacterium's evolution comes at a cost, Turner said. This cost might be a decrease in virulence or an increased vulnerability to antibiotics.\n(Image credit: Graphic made by Olha Pohrebniak via Getty Images. Adapted by Live Science.)\nTo date, phage therapy has mostly been tested through a regulatory framework known as \"compassionate use\" in patients like the Brussels Airport bombing victim, whose infections had no other treatment options. Phage therapy has shown success in these settings, and in a recent observational study of 100 patients who received phages alongside antibiotics.\nSo far in clinical trials, though, phage therapy generally hasn't worked better than standard antibiotics or a placebo. Topline results from two recent trials hint at the treatment's effectiveness in specific lung and foot infections, but the full results have yet to be released.\nSuccess in future trials will be key to getting phages into the clinic, Turner said. Those trials will have to show the therapy works for multiple types of infections, determine dosage and confirm phage therapies don't hurt helpful bacteria in the body, he added.\nTurning bacteria's defenses against them\nThe CRISPR-Cas system can be used to snip DNA at precise locations. Here, a Cas enzyme (dark pink) is preparing to cut through a target DNA strand (blue) and is being told where to cut by an RNA strand (yellow). (Image credit: Meletios Verras via Getty Images)\nAlthough made famous as a powerful gene-editing tool, CRISPR technology was actually adapted from an immune system found in many bacteria: CRISPR-Cas.\nThe key components of this immune system include molecular scissors, known as Cas proteins, and a memory bank of DNA snippets that a bacterium has collected from phages that once infected it. By tapping its memory bank, CRISPR-Cas can guide its lethal scissors to a precise point in an invading phage's DNA and snip it like a piece of ribbon.\n\"The CRISPR machinery gets into a set of cells, but only those that have the sequence or sequences you picked will be attacked and killed.\" Chase Beisel, HIRI\nOn occasion, though, rather than attacking phages, CRISPR-Cas can accidentally go after the bacterial cell's own DNA , triggering a lethal autoimmune reaction. This phenomenon inspired Beisel and his colleagues to explore using CRISPR-Cas to shred bacterial cells' DNA.\n\"The real draw of it is that it is a sequence-specific tool,\" meaning it targets only the DNA you tell it to, and not sequences present in other bacteria, Beisel told Live Science. So, once administered to a patient, \"the CRISPR machinery gets into a set of cells, but only those that have the sequence or sequences you picked will be attacked and killed.\"\nHow do you get CRISPR-Cas into the right bacteria? Various research groups are testing different delivery methods, but at present, the best strategy seems to be loading CRISPR machinery into a phage that infects the target bacterium, Beisel said.\nRelated: Scientists invent 'shape-shifting' antibiotic to fight deadly superbugs\nBeisel is a co-founder and scientific adviser of Locus Biosciences, a biotech company that's currently testing a CRISPR-enhanced phage therapy in a midstage, roughly 800-person trial. This approach couples the bacteria-killing prowess of phages with the ability of CRISPR-Cas to destroy essential bacterial genes. As with CRISPR-less phage therapies, clinical trials are needed to determine the treatment's safety profile and appropriate dosing.\n\"I can see these [treatments] coming about in the five- to 10-year time frame,\" Beisel said.\nDesigner molecules to kill bacteria\nBeyond phages and CRISPR, scientists are developing antibiotic alternatives that harness bacteria-slaying peptides — short chains of protein building blocks— and enzymes, specialized proteins that jump-start chemical reactions. These molecules differ from antibiotics because they can kill a very narrow range of bacteria by targeting bacterial proteins that cannot easily gain resistance to their attacks.\nLab-made molecules called peptide nucleic acids (PNAs) are some of the most promising candidates. These engineered molecules can be designed to block bacterial cells from building essential proteins that are crucial to their survival. PNAs do this by latching onto specific mRNA, genetic molecules that carry the instructions for building proteins from the cell's control center to its protein construction sites. PNAs cannot enter bacterial cells on their own, though, so they're typically attached to other peptides that easily pass through the bacterial cell wall.\nBy targeting proteins that cells cannot change without harming themselves, PNAs can avoid triggering drug resistance, Beisel explained. The engineered molecules could also be made to target proteins that directly contribute to antibiotic resistance, for example, the efflux pumps used to push antibiotics out of cells or the enzymes capable of disabling the drugs. By emptying a germ's drug resistance tool kit, PNAs can then make it vulnerable to standard treatments.\nOne approach for killing bacteria is to use lysins, or enzymes that tear open bacterial cell membranes and cause the microbes' contents to spill out. (Image credit: KATERYNA KON\/SCIENCE PHOTO LIBRARY via Getty Images)\nAntibacterial PNAs are still being tested in lab dishes and animals and have not yet moved into human trials. And, scientists need to make sure PNA-based treatments don't inadvertently mess with human cells or helpful bacteria.\nRelated: 'Death screams' of swarming bacteria help their comrades survive antibiotic attacks\nIn addition to peptides like PNAs, enzymes called lysins are another promising treatment option. Lysins are used in nature by phages to split bacteria open from the inside. They act like tiny swords that slice through the outer wall of a bacterial cell, spilling its guts. The molecular sabers are unlikely to promote resistance because bacteria cannot easily change the essential cell-wall components that lysins target.\nLysins slaughter bacteria quickly upon contact, and they can be very specific, killing some types of bacteria while sparing others. Furthermore, lysins can be tweaked in the lab to change which bacteria they target, boost their potency and improve their durability in the body.\nSome lysins have entered mid- and late-stage human trials with hundreds of participants, in which they've been tested as supplementary treatments to antibiotics but garnered mixed results.\nAntibiotic stewardship can save lives, in the meantime\nUntil these next-gen bacteria slayers make it to market, immediate measures must be taken to stall the rise of superbugs, by preventing the misuse of antibiotics that pressures bacteria to evolve resistance in the first place.\n\"By reducing individual risk, you anticipate that you will drop the overall population-level risk.\" Dr. Shruti Gohil, INSPIRE-ASP Trials\nFor example, doctors can be more diligent about confirming that bacteria, not viruses, are behind a patient's infection before prescribing antibiotics, said Dr. Shruti Gohil , a lead investigator of four INSPIRE-ASP Trials , federally funded research aimed at improving hospitals' antibiotic use. Other safeguards can include auditing doctors' prescriptions to see if narrower-spectrum drugs could be used instead of broad ones, or requiring special clearance for the broadest-spectrum drugs. These steps are essential not only in hospitals but everywhere antibiotics are prescribed, from primary care to dentistry, Gohil said.\nEach interaction between a doctor and their patient matters.\nGohil stressed that \"by reducing individual risk, you anticipate that you will drop the overall population-level risk,\" and eventually slash the prevalence of multidrug-resistant bugs.\n\nThis article was published by Live Science: The Most Interesting Articles on 2023-10-01 under the category 'science'.\n\n","id":566}
{"title":"The 26 best Amazon Prime Day deals you can still shop for today","context":"## The 26 best Amazon Prime Day deals you can still shop for today\n\nEngadget has been testing and reviewing consumer tech since 2004. Our stories may include affiliate links; if you buy something through a link, we may earn a commission. Read more about how we evaluate products.\nAmazon's October Prime Day sale officially ended on Wednesday, but a few of the deals are still live as we head into the weekend. If you were hoping to check off a few more names from your holiday gift list or buy something for yourself at a discount, see what remains on sale below. We combed through our coverage over the past few days to find the best of what's left. While Amazon has returned most of their own devices, like Echos and Kindles, back to their full prices, a handful of products from other brands like Google, Samsung and Anker, have maintained the lows they hit on Prime Day. Here are the best deals from Prime Big Deal Days that you can still get right now.\nSamsung Galaxy Watch 6\nThe new Samsung Galaxy Watch 6 went down to $269 for October Prime Day and it's still on sale. That's lowest price we've seen since it came out a few months ago. You can't get a better smartwatch than this one if you have an Android phone (bonus points if you have a Samsung phone), and it's smaller and lighter than previous versions. Samsung brought back the spinning bezel on the Classic version, which is which makes the software's UI easier to navigate, plus it has improved performance and updated health and fitness tracking tools.\nApple MacBook Air M2 (15-inch)\nPhoto by Nathan Ingraham \/ Engadget Apple MacBook Air (15-inch, M2) $1,049 $1,260 Save $211 The MacBook Air is the top pick in our guide to the best laptops, and this deal brings the entry-level 15-inch model back down to the best price we've seen. Other SKUs with more RAM and storage are also on sale. $1,049 at Amazon\nThe 15.3-inch version of Apple’s MacBook Air is still down to $1,049 for an entry-level model with 8GB of RAM and a 256GB SSD. That matches the best price we’ve seen and takes $250 off Apple’s list price. The MacBook Air is the top pick in our guide to the best laptops, and we gave the 15-inch model a review score of 96 earlier this year, as it covers just about all of the things we look for in a quality mainstream notebook. Compared to the 13.6-inch version, it also includes a more powerful speaker system and a slightly upgraded GPU. The SSD in this base configuration is technically slower than the one in higher-capacity SKUs, but that shouldn’t be a major problem unless you’re looking to do more complex work. In general, you wouldn’t buy the Air for things like high-res media editing, though its M2 chip is still plenty powerful for everyday tasks.\nIf you do need more storage space, the 512GB model with 8GB of RAM is on sale for a low of $1,249. Variants with double the RAM are up to $250 off as well. Meanwhile, the 13.6-inch MacBook Air isn’t discounted on Amazon, but it’s down to $899 at Best Buy. That’s $200 off the notebook’s list price.\nSony WF-1000XM5\nSony's WF-1000XM5 wireless earbuds went down to $278 for Prime Day and are still going for that price today. That's a $22 discount and their best price yet. We think these are the best wireless earbuds on the market right now. Sony improved upon it's already remarkable buds with a more comfortable fit, better sound quality and features likes adaptive sound and Speak-to-Chat.\nAmazon Fire TV Stick 4K\nThe previous generation of Fire TV Stick 4K dropped to $23 for the sale and is one of the few Amazon devices still on sale. It has the same processor, RAM and storage as the standard Fire TV Stick, but it can stream 4K HDR content in all its glory. It also supports Dolby Vision HDR and Dolby Atmos, while a picture-in-picture live view feature can show you feeds from compatible security cameras right on your TV screen.\nDo note, though, that this is the previous model of the streaming stick. The newly refreshed Fire TV Stick 4K isn't sale but has a faster processor and supports Wi-Fi 6.\nAnker Soundcore Motion +\nOne of the top Bluetooth options in our speaker guide is Anker’s Soundcore Motion +, which gives out good sound for its price point. The $100 MSRP is discounted to $70 if you clip the on-page copuon. That's a 30 percent discount and an all-time low. It has a bright and bassy output and offers EQ customization in the app. Plus it’s water-resistant, so you can take it to the park or on a hike and share your good taste in music with whoever is nearby.\nHyperX Cloud Stinger 2\nThe top budget pick in our gaming headphones buying guide, the HyperX Cloud Stinger 2, is on sale for $36. That’s a dollar more than it went for on Prime Day and only a modest $4 discount over its street price recently, but it's still close to lowest price we’ve seen. The Cloud Stinger 2 doesn’t have the most balanced or detailed sound, but its V-shaped signature gives action scenes a nice level of impact, and its mic quality belies the dirt-cheap price. The design is comfortable too, though it’s made from cheap-feeling plastic.\nShokz OpenRun Pro\nThe Shokz OpenRun Pro is down to $125 for Prime Big Deal Days, which is $25 more than the lowest price we’ve tracked but still $55 below its usual going rate. This is a recommended pair of bone conduction headphones, which means it hugs the side of your head and delivers sound by passing vibrations through your skull. (It’s not as uncomfortable as it sounds.) The main benefit is that this leaves your ear canals completely open, so you can enjoy a playlist or podcast without being shut out from the outside world. The downside, usually, is that you don’t get as full a sound as you would with a traditional pair. That’ll still be the case here, but we’ve found the OpenRun Pro to deliver more low-end depth than most of its peers. They’re fairly comfy and get up to 10 hours of battery life beyond that.\nLogitech G535\nIf you’re looking for a wireless headset, the Logitech G535 is back down to $80, which is about $25 below its average street price. This is an honorable mention in our gaming headsets guide, as we like its lightweight design, Bluetooth support and agreeable, relatively well-balanced sound. It forces you to crank the volume to reach a listenable level though, and its mic makes voices sound a little too thin. It also doesn't work with Xbox consoles. But if you really want a wireless gaming headset for less than $100, it’s well worth a look.\nSamsung Smart Monitor M8\nThe Samsung Smart Monitor M8 is down to just $500, which is $200 off its starting price (though it regularly sells for $600) and the lowest price we've seen thus far. This 32-inch display has built-in apps and allows you to access streaming services, just like you would on a smart TV. It can also act as a smart home hub, showing you your smart camera feeds and more. This discounted model is the updated 2023 version of the monitor that launched at CES 2022.\nGoogle Indoor Nest Security Cam\nA slew of Google Nest home security devices are still on sale the day after Prime, including the battery-powered Nest Cam that can go inside or outside your home. Typically priced at $180, the security cam dipped down to $120 for Amazon's October Prime Day event. The Nest Cam works with smart speakers and displays enabled with Alexa or the Google Assistant and can last up to seven months depending on how much activity it picks up. Its weather-resistant build and magnetic mount should make it easy to install on most surfaces. It sends live alerts to your phone and will even allow for on-demand check-ins without a subscription, though it only stores the last three hours for free. For six months of stored footage, you'll need a Nest Aware membership.\nGoogle Nest Thermostat\nGoogle Google Nest Thermostat $90 $130 Save $40 The Google Nest Thermostat lets you control your heating and cooling from anywhere and suggests tweaks to help you save money. This Black Friday deal takes $40 off the list price. $90 at Amazon\nIn other Google deals, the Nest Thermostat is on sale for just $90, which is only about $10 more than the lowest price we've tracked and $40 off Google's MSRP. This is Google's entry-level smart thermostat, but it still lets you control your heating and cooling from anywhere, suggests tweaks to help you save money, and in some cases, can entitle you to rebates from your utility provider. It's all relatively easy to program, and it works with Google's Nest Hub and other smart displays like the Echo Show.\nBeats Studio Pro\nThe Beats Studio Pro headphones are on sale for $180 right now. which is a dollar more than they sold for on Prime Day and still a sizable $170 discount. We reviewed these back in July when they came out and gave them a decent review score of 81. Unfortunately they didn't push any of the top picks from our our best headphones list off their pedestals. They aren't bad, however, offering pleasant, even-handed sound and good noise cancellation. Though Beats is now owned by Apple, these headphones still play nice with Android. There's no wear detection and the mostly plastic design isn’t super premium, but at this price, you may not care.\nTribit StormBox Micro 2\nThe Tribit StormBox Micro 2 is another small speaker we like that puts out decent volume for its size, and for Prime day it went down to $48, which is $12 off its usual going rate. Right now it's on sale for $60, but an on-page 15 percent coupon brings it back to that Prime Day low. This device has a strap on its back that works well on belts, backpacks, or even bike handlebars, so it’s easy to take on the road. And \"on the go\" is where the StormBox Micro 2 performs best, as it’s more about portable volume than pure fidelity.\nGoogle Nest Wi-Fi Pro 6E\nThe Google Nest Wi-Fi Pro 6E is holding strong at $300 right now for a pack of three routers. That's within a dollar of the lowest price it's sold for on Amazon. It's one of the best Wi-Fi 6 router systems you can get at the moment thanks to its easy setup process, convenient Google Assistant integrations and Matter and Thread support. If you're looking for a not-too expensive way to upgrade your home Wi-Fi system, and one that will take little time to set up, Google's is the one to get.\nRoku Streaming Stick 4K\nOur favorite streaming stick, the Roku Streaming Stick 4K, remains at $37 after the sale. It packs a ton of features into an affordable package, including 4K HDR streaming capabilities, Dolby Vision, AirPlay 2 and private listening when you have a pair of headphones. And since it's so small, it makes for a great travel entertainment device too.\nHisense U6K\nThe Hisense U6K is one of the more affordable TVs. And the 55- and 65-inch models are still down to $400 and $548, respectively. We’ve seen these deals before, but each matches an all-time low. The U6K is has received generally positive reviews around the web, as it's one of the few budget-level sets with quantum dots, full-array local dimming and a mini-LED backlight. All of that should help it deliver better contrast and color volume than most TVs in its price range. It’s not ideal for gaming though, as it’s limited to a 60Hz refresh rate and lacks HDMI 2.1 ports. In general, it can’t match the brightness or viewing angles of a more expensive set, but it looks to be a good buy if you’re on a tighter budget.\nFor a well-reviewed midrange model, the Hisense U8K provides much better contrast and peak brightness, plus more gaming-friendly features like ability to play 4K content at up to a 144Hz refresh rate. That one is down to $748 for a 55-inch model and $998 for a 65-inch set.\niRobot Roomba 694\niRobot's Roomba 694 dropped to $199 for Prime Day and stayed there. While that's still $20 more than the lowest we've seen it go, it's still a good deal on our favorite cheap robot vacuum. It's got strong suction power, an attractive design and easy to use app. It'll be a good option for robo-vac novices, or anyone that doesn't want to fuss too much with an automatic dirt sucker. It clears hard and carpeted floors well, and it automatically returns to its base once a cleaning job is finished so it can recharge.\nSamsung Pro Plus microSD\nThe Samsung Pro Plus microSD card is on sale for $20 right now. It's our top pick in our best microSD card guide because it was the most consistent of the ones we tested, with some of the best overall speeds and all of the important ratings that a good card should have: U3, V30 and A2. It'll be a great pick for your tablet, smartphone or Nintendo Switch, and it comes with a full-sized adapter in case you need to use it with a camera or connect it to your computer.\nCrucial MX500\nThe Crucial MX500 internal drive is on sale for $46 right now. It's been an Engadget favorite for a while thanks to its sequential read speeds of 560MB\/s and a standard 2.5-inch design that should make it easy to swap in for your desktop's or laptop's used-up drive.\nOther great deals for after Prime Day\nAnker 511 Charger\nAnker 511 Charger (Nano 3) $20 $23 Save $3 See at Amazon\nNew Apple Watches don’t come with power adapters, so if you’re looking for one that can deliver a quick charge, we recommend Anker's 511 (Nano 3) charging brick. It’s down to $20 which is a mild, $4 discount, but still a welcome price for a worthwhile smartwatch accessory.\nOtterBox Fast Charge Power Bank\nOtterBox Fast Charge Power Bank 15,000 mAh $36 $45 Save $9 See at Amazon\nThe OtterBox Fast Charge Power Bank is currently just $36 for the 15,000mAh capacity model, which is the version we tested and recommend in our portable battery guide. This pack looks sharp and delivers a fast and reliable charge via USB-C or USB-A.\nSanDisk 128GB microSDXC Card for Nintendo Switch\nSanDisk 128GB microSDXC-Card Licensed for Nintendo-Switch $18 $31 Save $13 See at Amazon\nIf you need more room on your Switch, SanDisk's officially licensed microSDXC card is a good pick, particularly when it’s on sale. Right now a 128GB model is within a dollar of its all-time low at just $18.\nSamsung Pro Plus microSD card\nSamsung Pro Plus microSD Memory Card + Reader $23 $38 Save $15 See at Amazon\nOur favorite microSD card for most people is the Samsung Pro Plus. It had the fastest sequential write speeds and random performance of any card we tested, and the USB reader that comes with included with this listing helps it reach higher speeds on compatible devices. It’s listed at $38 for the set (though it often goes for $25), and now Prime Day in October brings it to $23.\nFollow @EngadgetDeals on Twitter and subscribe to the Engadget Deals newsletter for the latest tech deals and buying advice.\n\nThis article, authored by Engadget, was published by Engadget on 2023-10-12 under the category 'technology'.\n\n","id":567}
{"title":"Colorado vs. Arizona State live score, updates, highlights from Week 6 college football game","context":"## Colorado vs. Arizona State live score, updates, highlights from Week 6 college football game\n\nColorado fans, you're back. For now.\nA 43-yard pass from Shedeur Sanders on the Buffaloes' final drive helped set up Alejandro Mata for the game-winning 43-yard field goal with 12 seconds left, delivering Colorado the 27-24 win over Arizona State for their first Pac-12 win of the season. It snaps their eight-game conference losing streak.\nSanders had a mediocre day by his lofty standards, but his 239 yards and a touchdown were enough in perhaps Colorado's most crucial game so far. It brought the team to 4-2, but had it lost, it would have been much harder for the Buffs to finish the season bowl eligible. A win gives them a leg up in a competitive conference, particularly facing four ranked teams down the stretch of the season.\nIf Colorado wants to solidify a bowl game, it'll have to fix many things, one of them being the offensive line. It allowed five sacks on Sanders, bringing the season total to a nation-leading 31. The defense picked up five sacks themselves to maintain pressure on Trenton Bourguet.\nFor Arizona State, Bourguet put all he could into Saturday's narrow loss. He's one of two healthy quarterbacks on the roster, and passed for 335 yards and a touchdown. The Sun Devils had a real shot at their first conference win. But as the game came to a close, Bourguet seemed roughed up and slow, though he did drive the team down the field 94 yards in 13 plays for the game-tying touchdown with 50 seconds left.\nLuckily for Arizona State, next week is a bye week. What's not so lucky is that it'll go on to play three ranked teams over the following three weeks.\nWe didn't see the worst of either team, though we didn't see the best either. Colorado needed a bounce back win and got one. Meanwhile Arizona State kept on struggling, falling to 1-5.\nMORE: Watch Colorado vs. Arizona State live with Fubo (free trial)\nThe Sporting News tracked updates and highlights from college football's Week 6 game between Colorado and Arizona State.\nColorado vs. Arizona State score\nQ1 Q2 Q3 Q4 Final Colorado 7 7 0 13 27 Arizona State 7 10 0 7 24\nColorado vs. Arizona State results, highlights from Week 6 game\nFINAL: Colorado 27, Arizona State 24\nColorado 27, Arizona State 24\n10:17 p.m. FIELD GOAL – Absolutely clutch. Mata makes a 43-yard field goal look easy to give Colorado the lead with 12 seconds on the clock.\n10:14 p.m. – Bullseye! Sanders finds Antonio on a 43-yard pass. Colorado takes over on the ASU 25.\nSHEDEUR TO ANTONIO FOR A HUGE GAIN 🦬@CUBuffsFootball pic.twitter.com\/tvfWjRWWAE — FOX College Football (@CFBONFOX) October 8, 2023\nColorado 24, Arizona State 24\n10:11 p.m. TOUCHDOWN – Don't count the Sun Devils out yet! Bourguet finds Troy Omeire on a 15-yard pass to tie it up. Only 50 seconds remain.\n9:48 p.m. – It's blocked! Carter Stoutmire gets in front of the 52-yard field goal attempt from Longhetto to deny a Sun Devil score.\n9:38 p.m. FIELD GOAL – Alejandro Mata nails a 42-yard field goal to extend Colorado's lead to seven. Ten minutes are left in the game.\n9:35 p.m. – That's a huge run for the Buffaloes! Weaver returns it 51 yards, only stopping after tripping himself up. Colorado is 25 yards away from another touchdown.\nColorado 21, Arizona State 17\n9:26 p.m. TOUCHDOWN – Colorado pulls ahead! Sanders finds Javon Antonio for a 9-yard touchdown, his first of the year. It's now a four-point lead for Colorado with 14 minutes to go.\nBuffs are up thanks to @7asavage\n\nCU 21, ASU 17\n\n📺 Pac-12 Network pic.twitter.com\/3R8w2Qdm9e — Colorado Buffaloes Football (@CUBuffsFootball) October 8, 2023\nEnd of third quarter: Colorado 14, Arizona State 17\n9:13 p.m. PENALTY – Sun Devils Ed Woods is ejected for targeting. He will miss the remainder of this game as well as the first half against Washington in two weeks.\n9:10 p.m. – That's the fourth sack allowed by the Colorado O-line. The Buffaloes now lead FBS with most sacks allowed this season at 30.\n8:52 p.m. – Skattebo is heating up under the sun. He's added 24 rushing yards from Arizona State's possession.\nEnd of second quarter: Colorado 14, Arizona Sate 17\nColorado 14, Arizona State 17\n8:20 p.m. FIELD GOAL – Dario Longhetto nails a 33-yard field goal to end the half. The Sun Devils have a narrow lead over the Buffs at the halfway mark.\nColorado 14, Arizona State 14\n8:14 p.m. TOUCHDOWN – Sanders ties it up! The QB keeps it for 16 yards and a touchdown. Less than a minute is left until halftime.\n8:09 p.m. – Sanders finds Jimmy Horn Jr. for 24 yards. Colorado is within striking distance, the ASU 39, with only two minutes left.\n8:06 p.m. – ASU's head coach Kenny Dillingham could not be more unhappy with the referees, who ruled Bourguet's run just short of a first down. It's fourth down for the Sun Devils.\nColorado 7, Arizona State 14\n7:48 p.m. TOUCHDOWN – Cam Skattebo pushes through the huddle for the score! It's his fifth rushing touchdown of the season. ASU now leads 14-7 with 6:38 left in the half.\n7:45 p.m. – Andre Johnson reaches over the pylon with one hand, but the ball is knocked out. The play is being reviewed for a touchdown.\n7:41 p.m. – Colorado is called offsides, giving Arizona State a first down at the Buffs' 48.\n7:34 p.m. – After scoring a touchdown on its opening possession, Arizona State has three straight three-and-outs.\n7:30 p.m. – The Sun Devils record their third sack of the day already, this time forcing fourth down for the Buffaloes. Safe to say their defense came prepared.\nEnd of first quarter: Colorado 7, Arizona State 7\nColorado 7, Arizona State 7\n7:17 p.m. TOUCHDOWN – The Buffs tie it up! Needing one yard on the fourth down, Sanders hands it off to Xavier Weaver who weaves his way into the end zone. Its 7-7 in Tempe with two minutes remaining in the first quarter.\nOn 4th & goal Xavier Weaver takes it in for @CUBuffsFootball 🦬\n\nThis game is tied 💪 pic.twitter.com\/bGwGZ7b0IF — FOX College Football (@CFBONFOX) October 7, 2023\n7:06 p.m. – Anthony Hankerson gets two first downs for the Buffs on a four-yard run and a 12-yard run.\n7:00 p.m. – It was a three-and-out for Colorado, and now it's a three-and-out for Arizona State.\n6:54 p.m. – Intentional grounding is called on Shedeur Sanders on first down.\nColorado 0, Arizona State 7\n6:47 p.m. TOUCHDOWN – The Sun Devils start quick, scoring a touchdown on its first drive behind Elijhah Badger's 48 yards. Its 7-0 just a few minutes in.\n6:35 p.m. – The game will begin on the Pac-12 Network Arizona due to the Washington State vs. UCLA game running long.\n6:10 p.m. – Starting safety Trevor Wood is out for Colorado. Good news is Shilo Sanders will start.\n6:05 p.m. – The Sun Devils are looking to end their eight-gam losing streak against FBS teams. Ironically, their last FBS win was against Colorado when Trenton Bourguet set a school record for most passing yards in a career start. He's expected to be Arizona State's starting QB tonight.\n5:50 p.m. – Colorado to debut new helmets in Tempe.\n5:20 p.m. – The Buffs have entered the chat.\nMORE: Best Colorado player prop odds for Week 6 college football matchup against Arizona State\nHow to watch Colorado vs. Arizona State\nDate : Saturday, Oct. 7\n: Saturday, Oct. 7 Time : 6:30 p.m. ET\n: 6:30 p.m. ET Location : Mountain America Stadium in Tempe, Arizona\n: Mountain America Stadium in Tempe, Arizona TV channel : Pac-12 Network\n: Pac-12 Network Live stream: Pac-12 Network, Fubo\nIt'll be a sold out Mountain America Stadium in Tempe. Colorado-Arizona State kicks off at 6:30 p.m. ET on Saturday, Oct. 7. Viewing is available only on Pac-12 Network for those who have the cable extension. Streaming the game is available through Fubo, which offers a free trial.\n\nThis article, authored by Emily Dozier, was published by Sporting News on 2023-10-07 under the category 'sports'.\n\n","id":568}
{"title":"Faith dilemma: How effective is positive thinking when life gets difficult? Pastor weighs in","context":"## Faith dilemma: How effective is positive thinking when life gets difficult? Pastor weighs in\n\nPastor Jesse Bradley of Auburn, Washington runs Grace Community Church.\nHe's ministered to many, many people struggling with a variety of faith dilemmas and issues in their lives.\nIn this month of October 2023, as Americans grapple with a variety of issues, he addressed the notion of positive thinking — and shared with Fox News Digital what it would \"look like to change your thinking and shift in a new direction.\"\nWASHINGTON PASTOR, ONCE GRAVELY ILL, SHARES HOW ‘THE POWER OF THE SECOND THOUGHT’ TRANSFORMED HIS LIFE\nSaid Pastor Bradley, \"Psychologists report that we have in between 6,000 and 60,000 thoughts a day, based on the person and situation. The National Science Foundation shares that up to 80% of our first thoughts are not helpful, even destructive.\"\nWhat happens is that \"when life is difficult, we can become flooded with thoughts that are drenched in fear, worry, stress, selfishness, impurity, selfishness and lies. We do not have to believe, harbor or entertain negative first thoughts. We can be proactive by intentionally choosing our second thought.\"\nIt is no accident that the pastor's new book, his second, is called \"The Power of the Second Thought.\"\nIt dives into the power of understanding that the first thoughts we have are not always the best — and that it's wise to take some time and get to the \"second thoughts,\" which can yield greater understanding.\nSTORYTELLER REVEALS HIS FAITH AT WORK: ‘I REFUSE TO TRY TO SCREW SOMEONE IN THE NAME OF BUSINESS’\nSaid Bradley to Fox News Digital in emailed comments this week, \"How can we choose a positive attitude and approach during the day? Reject and replace!\"\nHe gave this list of examples:\nReplace \"People just slack and gossip at my job\" with \"I will work with all my strength, even when no one is looking\"\nReplace \"There's no hope for my future\" with \"I am thankful for today and will keep doing the next right thing\"\nReplace \"My children are annoying\" with \"My children are a gift from God\"\nReplace \"I'll never have good friendships\" with \"I will pursue and support the people that I respect the most\"\nReplace \"No one really cares about me\" with \"God is with me and loves me every day\"\nSaid Bradley, \"Johns Hopkins reports that there are links between positive thinking and health. People with a positive outlook are less likely to have a heart attack or cardiovascular event.\"\n\"I didn't have a roadmap for finding hope or the tools to handle the intensity of my loss and pain.\"\nAlso, \"Research from the University of North Carolina points to positive people being more resilient and finding more solutions to problems. A Harvard study shares that optimism reduces the risk of dying prematurely — from overcoming trauma, making the most of your opportunities to overall life satisfaction, positivity makes a difference.\"\nWASHINGTON PASTOR ACKNOWLEDGES THE PAIN OF PUTDOWNS AGAINST THE CHRISTIAN FAITH: ‘ASK GOD FOR COURAGE’\nThe pastor said he wrote his most recent book, \"The Power of the Second Thought,\" to help people gain habits to strengthen their mental health.\nBradley graduated from Dartmouth College and was playing professional soccer when he became ill — something that took 10 years to fully recover from. He said finding hope during that time was challenging but is how he changes his \"hopeless first thoughts.\"\n\"I didn't have a roadmap for finding hope or the tools to handle the intensity of my loss and pain,\" he said.\nFAITH DILEMMA IN FOCUS: ‘IT’S SUNDAY AND I HAVEN'T GONE TO CHURCH — WHAT DO I DO?'\nHe said turning to Jesus for a deeper meaning and learning to not take his \"first thoughts\" for fact was crucial to his overall mental health.\n\"The Word of God is living and active, bringing strength, courage, wisdom, and protection,\" he said.\n\"God's thoughts and ways are higher than ours, but when we spend time, each day reading His Word and listening to the voice of the Good Shepherd, we are filled with new thoughts that change the trajectory of our lives.\"\nBradley also shared his dos and don'ts of positive thinking.\nHe said it's not \"denial and pretending that there are no challenges,\" he said.\n\"Positive thinking is not flattery and frivolous compliments.\"\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\nRather, positive thinking is realistic, full of truth and love — and aligned with heaven and scripture.\n\"Positive thinking is not self-consumption, self-absorption or selfishness. Positive thinking is not creating unrealistic expectations for other people and putting extra stress on them to be perfect.\"\nBradley said, \"Positive thinking is a vital aspect of loving your neighbor, nourishing your mind, discerning between light and darkness, good and evil and right and wrong.\"\n\"Positive thinking leads to taking action and improving situations. Positive thinking brings out the best in the people around you. Positive thinking rejects excuses, takes responsibility, and overcomes setbacks.\"\nThe pastor went on to explain that Jesus brought more positivity than anyone — which is why it's important to keep faith aligned with that practice of positive thinking.\nCLICK HERE TO GET THE FOX NEWS APP\n\"Jesus exudes a trustworthy positivity that is full of meaning, faithfulness, and transformation,\" he noted.\n\"God renews our thinking and vision, empowers us to make intentional choices about our focus and perspective and trains us how to win the battle of our minds,\" he added.\nBradley said, \"Positive thinking is relational, and there is no greater source of joy in our lives than God.\"\n\nThis article was published by FOX News - Lifestyle on 2023-10-28 under the category 'entertainment'.\n\n","id":569}
{"title":"Jonathan Roumie on faith and prayer life during Advent and always: 'God hasn't forsaken us'","context":"## Jonathan Roumie on faith and prayer life during Advent and always: 'God hasn't forsaken us'\n\nIn a phone interview with Fox News Digital on Monday, Los Angeles-based actor Jonathan Roumie spoke of his Christian faith, his prayer life and his hope that others may find peace and serenity during this Advent season of 2023 — because \"any opportunity to connect to Jesus is a welcome one,\" he said.\nRoumie, perhaps best known for his role as Jesus Christ in \"The Chosen,\" has paired up with Hallow, the No. 1 prayer app in the world, for a special Advent prayer challenge for this holy season of preparation for Christmas. The 25-day prayer challenge began Monday — and as part of the effort, both he and actor Liam Neeson guide people through a variety of prayers, meditations, Bible readings and more.\nThis is no mere gig, however, for Roumie.\nHe is a committed Christian and Catholic, with his own personal story of growing closer to God and continuing to do so each day.\nHALLOW APP ANNOUNCES COLLABORATION WITH LIAM NEESON FOR NEW ADVENT SERIES THIS YEAR\nPeople can \"disconnect from the chaos of the real world, the divisiveness, the anxiety\" that exists, said Roumie, by connecting with Jesus through prayer.\nThey can find \"peace and a deeper relationship with Christ, and I think that's really the goal of the prayer challenge,\" he said.\nRoumie said that building a habit of prayer \"is easier than people think.\"\nHe added, \"As you consistently tap into that habit, you find your relationship with Jesus growing deeper and deeper, just automatically. And as a result, you then experience much more peace, tranquility and serenity in your life and the ability to really muscle through some of the most difficult obstacles and challenges that life can throw at you,\" he said.\nHere is more of Fox News Digital's conversation with Roumie about the 25-day prayer challenge during Advent, which started on Monday — and about Roumie's own faith beliefs.\n‘Deep gratitude’\nFox News Digital: In the midst of some of the most trying times today, how do you — and how does anyone — keep a focus on prayer, on God, on a connection with God? It's very, very easy to get distracted in today's world.\nJonathan Roumie: Yes, and I think that for me, I'm very easily distracted — and technology is one of the things that contributes to that distraction.\nBut in this case, I have such a deep gratitude to the technology that's arrived in the form of this app — of the Hallow app. I can literally go to my phone and if I find myself or my mind wandering — or my anxiety building — all I have to do is literally click on the app and just start praying or meditating on one of the challenges or one of the prayers.\nFIRST SUNDAY OF ADVENT IS A REMINDER TO ‘WATCH’ AND PREPARE FOR CHRIST'S SECOND COMING, SAYS FAITH LEADER\nThere are thousands of prayers on this app. And I'm instantly transported into a sacred space, no matter where I am.\nNo matter what, if you live in a major city or if you live in a place that's just really busy, you can pop on your headphones and connect to the app. You start praying with a meditation and you're instantly just transported.\nThis is something that I've been so grateful for — and especially as we go into the hubbub and the busyness of the Christmas season, it's something that I'm relying on daily, to be able to just cut through all that noise.\n‘Transformative for people’\nQuestion: Are people reaching out to you about your involvement with the app and asking you more about it?\nRoumie: I've had so many people say they've cultivated a relationship with Jesus through prayer because they heard me talk about the app, or because they watched \"The Chosen\" and then they started seeing this pop up in other places.\nWHAT IS AN ADVENT AND WHAT DO ITS CANDLES MEAN DURING THIS HOLY SEASON?\nAnd they've gotten introduced to the app and to a more deeply cultivated prayer life — and in some cases it's been absolutely transformative for people.\nSome people who've never been to church started going to church. Some people who haven't been to church for 20 years have come back to the church. People have converted — and all because they've fallen in love with the richness, the depth and the tradition of the Catholic Church.\nAnd obviously [the Hallow app] is authentically Catholic, but it is for all Christians — Christians of all denominations. There's something there for everybody, which is what makes the app so universally appealing.\n‘Simple act of surrender’\nQuestion: You've described an experience earlier in your life in which you prayed about leaving all of your anxieties and worries aside, and instead trusted that God would take care of things — and then after that came the role of Jesus in \"The Chosen\" for you. Is there a larger message here for people, things that others might learn from your experience?\nRoumie: I think it all comes down to the simple act of surrender to God in a person's life. And I went through this in a very visceral, substantial and transformative way in my life five years ago.\nI literally was on my knees and I said, \"Jesus, I surrender myself to you. Take care of everything.\" And He did.\n\"It's a matter of tapping into [our] faith and allowing Him to be more involved in our lives — and surrendering is the first step to getting there\"\nAnd then three months later, I got called to do \"The Chosen.\" It was a point that I think my life was building to when that happened — and I realized that trying to micromanage God was not something that was working in my favor.\n'HALLOW' PRAYER APP ACCOMPLISHED ITS GOAL DURING THE GOP DEBATE, COMPANY SAYS: 'PRAY WITH ME REAL QUICK'\nAnd once I let him take the wheel, everything changed. The decisive moment was that simple prayer of surrender.\nAnd I think that's really difficult for people, especially when we feel so out of control. When we turn on the news and see what's going on today, it feels like we have no control in our own lives.\nBut God hasn't forsaken us. He's not abandoned us. He's faithful to us to the very end. And it's a matter of tapping into that faith and allowing Him to be more involved in our lives — and surrendering is the first step to getting there.\nAnd then, to continue to cultivate that relationship through prayer — that's how we sustain that surrender.\nThe Hallow app and especially this Advent challenge is a beautiful way to kickstart that, especially if a person hasn't ever tried praying consistently before.\n‘So many options’\nQuestion: For those who haven't used it yet, can you describe how the app is not a replacement for Scripture but actually offers robust access to the Bible?\nRoumie: I narrate most of the New Testament in the app, so you have access to the Bible here, through many works and passages of Scripture and through [other people] as well.\nAnd if you want something that's very specific, it is here. Plus, there are resources for mental health.\nThere is music.\nAnd for me as a musician, music is so transportive and nourishing for the spirit — to be able to listen to music that kind of gets you in the mindset for prayer and worship.\nThere are just so many options that people have that it's kind of mind-bending.\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\nQuestion: How has playing the role of Jesus in \"The Chosen\" changed your life and changed you?\nRoumie: It's allowed me to go deeper into my own relationship with Him.\nIt's caused me to examine what exactly is my relationship with Him — and how can I go further in that relationship, how can I get close to Him, how can I grow deeper in communion with Him.\nCLICK HERE TO GET THE FOX NEWS APP\nSo it's challenged me on that level.\nBut as it challenges me, it also allows me to go further in that relationship — and to deepen my prayer life.\n\nThis article was published by FOX News - Lifestyle on 2023-12-05 under the category 'entertainment'.\n\n","id":570}
{"title":"Ten Hag responds to Carra: Man Utd have actually improved","context":"## Ten Hag responds to Carra: Man Utd have actually improved\n\nErik ten Hag has disagreed with Jamie Carragher's comments that Manchester United are going backwards this season - by saying the statistics show that his team has actually improved.\nUnited host local rivals Manchester City in a Super Sunday derby this weekend, live on Sky Sports with kick-off at 3.30pm, in the latest acid test to see how far Ten Hag's side have improved from last season.\nIn his column in The Daily Telegraph, Carragher said United's summer signings have led to the club becoming \"stale\" - and that Ten Hag should now be questioned about whether he can get the best out of his squad.\nBut in his pre-match press conference for the City game, Ten Hag hit back at those claims.\n\"In possession we have to do better, but there are reasons and I don't go into them, but everyone is seeing why. But there are also facts so I disagree [with Carragher], we are much better,\" said Ten Hag.\n\"In high ball regains, we are a top of the Premier League. In the middle [of the pitch] ball regains, we are top. The pressing is very good. So that's not the truth, what he [Carragher] is telling.\"\nPlease use Chrome browser for a more accessible video player FREE TO WATCH: Highlights from Sheffield United’s Premier League clash with Manchester United\nIn a fortnight where United have picked up three straight wins against Brentford, Sheffield United and FC Copenhagen, albeit via far from convincing performances, Christian Eriksen said United still need to find their \"balance and routines\" this season.\nAsked about those comments, Ten Hag said: \"We are in the right direction. We have a way to go. I see positives but I see negatives.\n\"What Christian is referring to is we are not consistently in possession on the level where we can be. Like Arsenal away, the first 30 minutes in Bayern Munich away. We should do this on a consistent basis.\n\"We don't take the benefit in the attacking transition moments, we should be because the ability in the team can take benefit from it. We pay attention to it, we need to grow. Then games will become easier.\"\nSo, what do the stats say?\nSky Sports' Sam Blitz:\nTen Hag is indeed right - Manchester United do rank very highly in their pressing stats in the final two-thirds of the pitch.\nUnited are, as he says, \"top of the Premier League\" in terms of possessions won in the final third and high turnovers. He is slightly wrong in terms of winning the ball in the middle third of the pitch - with United second behind Everton in that statistical table.\nHowever, there is still work to be done in terms of improving United's pressing. Their passing permitted per defensive actions (PPDA) tally ranks 10th - so, average - in the league. It shows that while Ten Hag's side do win the ball high up the pitch, opponents do tend to keep the ball as well as play it around United's pressing forwards as well.\nWhat is PPDA? PPDA is the number of opposition passes allowed outside of the pressing team's own defensive third, divided by the number of defensive actions by the pressing team outside of their own defensive third. A lower figure indicates a higher level of pressing, while a higher figure indicates a lower level of pressing.\nThe other pressing concern United have, which Ten Hag did reference in Friday's press conference, is finishing chances when they win the ball high up.\nUnited have the fourth-highest amounts of shots after winning the ball in their final third, but the glaring statistic is no goals from 104 high turnovers.\nAs expected, Manchester City have the highest amount of build-up attacks in the Premier League this season, so if United do win the ball high up in Sunday's derby, they need to start taking those chances.\nTen Hag on misfiring strikers: We need to be better\nPlease use Chrome browser for a more accessible video player Manchester United boss Erik ten Hag speaks on the improvement he's seen in goalkeeper Andre Onana and insists he believes Marcus Rashford can get back to scoring goals\nUnited go into Sunday's derby with a slight striker scoring problem. City forward Erling Haaland has scored more Premier League goals this season (9) than United's five forwards have managed in all competitions (8).\nUnited's top scorer this season is actually defensive midfielder Casemiro with four strikes so far.\nAsked if their forwards are to blame for this frontline problem, Ten Hag replied: \"Fault? It's co-operation. It has to click.\n\"We have shown in some games, we have so many in overload positions to the opponents goal and we don't net or don't even hit the target. We should be doing this better.\"\nIt has been a sobering start to the season for Marcus Rashford, who has one goal so far this term for United. But Ten Hag says he has full faith that the England forward, who scored 30 goals last season, can find his scoring boots again.\n\"If you give him the trust and I play him every game, most games also he finishes the game. I have strong belief he will return to scoring a lot of goals,\" said Ten Hag.\n\"It also has to do with the co-operation, with the movement around and the distribution to him. We have to work on that and that's my focus point.\"\n\nThis article was published by Sky Sports on 2023-10-28 under the category 'sports'.\n\n","id":571}
{"title":"7 of the best ski holidays in Canada","context":"## 7 of the best ski holidays in Canada\n\nSign up to Simon Calder’s free travel email for expert advice and money-saving discounts Get Simon Calder’s Travel email Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nSimon Calder’s Travel email {{ #verifyErrors }} {{ message }} {{ \/verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ \/verifyErrors }}\nIt may be further afield than the Alps or the Dolomites, but a trip to Canada makes it onto on the bucket lists of ski lovers everywhere for good reason. From the world-famous Whistler Blackcomb and its attractive resort towns to the steep verticals of Revelstoke, there’s enough choice – for every level of skier – to keep you coming back for years.\nFamilies, couples and groups alike can enjoy varied, all-round resorts like charming Tremblant, beginner-friendly family resorts such as Big White and expert areas like Fernie, with some of North America’s steepest terrain, best runs and most challenging off-piste.\nSeveral of the resorts can be combined into one single trip too, offering exceptional variety and thousands of acres in areas of outstanding natural beauty, such as Banff National Park.\nAdd to this reliable snow cover and some of the longest ski seasons in the world and there’s a compelling case for making your next ski trip to a Canadian resort. Below, we’ve rounded up the best.\nWhistler Blackcomb\nWhistler is Canada’s best-known resort (Getty Images)\nUndeniably Canada’s most famed ski resort, Whistler Blackcomb has a legendary reputation as an excellent ski area for all levels of skier. The largest ski resort in North America, it is home to over 8,100 acres of skiable terrain and over 200 runs. Some 55 per cent of these are marked as intermediate runs, though there are great beginner areas at the base of Blackcomb and mid-way up Whistler. There are several excellent advanced areas too, including the Flute Bowl, West Bowl and Spankey’s Ladder, with the longest runs offering a 1,500-metre vertical.\nThe town of Whistler was purpose-built and has quickly developed into one of the world’s premier resorts. There are plenty of non-skiing activities available and several options for kids, while the apres is among some of the best in North America, centred around venues like Merlin’s, Dusty’s and BrewHouse.\nBook it\nHeidi offers packages to The Westin Resort & Spa, two minutes from the slopes and just over five away from the town centre. Inside, the rooms are spacious, modern and come with excellent views which are only beaten by those offered from the terrace and grill restaurant.\nFrom £3,073pp, including seven nights’ accommodation, room-only, return flights from London Heathrow to Vancouver and airport transfers. Departing 13 January 2024.\nRead more on ski holidays:\nTremblant\nTremblant is Quebec’s premier resort (Getty Images)\nQuebec’s premier ski resort sits at the foot of the eponymous mountain, whose pistes cater well to all abilities. Beginners can start their ski journey at the edge of the village before progressing onto a series of long greens, including the Flying Mile. There are a number blues for intermediates, especially in the areas around Le Soleil and the Lowell Thomas lift, while advanced skiers can enjoy several terrain parks and steep black runs on both the north and south side of the mountain.\nThe idyllic, purpose-built village has been deliberately built in the style of Old Quebec, with plenty of colourful facades and French-Canadian charm. It offers lively apres and nightlife, often bolstered when locals flock in from Montreal. Non-skiing activities include ice skating, ice fishing and long walking trails, plus there’s a village casino.\nBook it\nBritish Airways Holidays has trips to the Fairmont Tremblant, one of the more grand hotels in the resort, with an excellent ski-in\/ski-out location that lies just a few metres from the lifts. The hotel has impressive spa, pool and sauna facilities, along with a large terrace, restaurant and outdoor hot tub.\nFrom £1,329pp, including seven nights’ accommodation, room-only, return flights from London Heathrow to Montreal and airport transfers. Departing 20 January 2024.\nSunshine Village\nSunshine Village is one of three ski resorts in the Banff National Park (Getty Images)\nSunshine Village lies around 20 minutes away from the town of Banff, with over 3,000 acres of ski area that is famed for its snow quality and reliable coverage, reflected in its long season that typically runs from mid-November to late May. It is another all-round area that caters almost equally to every level of skier, starting at the greens on the slopes of Mount Standish. Intermediates are at home in the areas served by the Continental Divide lift and the Tee Pee Town Express, while the more advanced should make a beeline for Goats Eye Mountain. The off-piste at Delirium Dive is also noteworthy.\nBanff is the place to stay for livelier evenings and decent accessibility, though due to the town’s distance from the ski area, there is less of an ‘apres’ culture on the slopes.\nBook it\nStay at the newest hotel in Banff with a package from Inghams. The four-star Moose Hotel & Suites sits in the downtown area, offering comfortable rooms – with balcony or patio areas that provide great views of the Rockies – and a spa that features two heated rooftop pools that remain open in winter. You’ll be a short shuttle away from Sunshine Village, or it’s a 40-minute journey over to neighbouring Lake Louise.\nFrom £1,482pp, including seven nights’ accommodation, room-only, return flights from London Heathrow to Calgary and transfers. Departing 27 January 2024.\nFernie\nFernie is paradise for more advanced skiers and snowboarders (Getty Images\/iStockphoto)\nThough a little smaller than some rivals at 2,500 acres, Fernie has gained a reputation as an excellent area for advanced skiers, with the added bonus of an average of nine metres of snowfall annually. The mountain is divided into seven sections, the lowest of which offers groomed green slopes for beginners, but the real attraction in Fernie is the ungroomed, steep terrain and tree skiing.\nThe most challenging runs are at Polar Peak and Currie Bowl, with tree skiing at Siberia or Timber Bowl. The runs around the Timber Bowl Express are more open and longer, with a 650-metre vertical.\nWhen picking accommodation, beware that Fernie’s resort village, while convenient, is fairly small and quiet. The town of Fernie itself is far more lively and has good bus links to the resort five miles away.\nBook it\nWelcome in the New Year in style with a stay in Fernie courtesy of Ski Solutions. Mark the celebrations at Lizard Creek Lodge, a ski-in\/ski-out hotel where the views from the terrace and balconies are only rivalled by those on the slopes. Head into town in the evenings in a rental car, included in the package price.\nFrom £1,795pp, including seven nights’ accommodation, room-only, return flights from a London airport, airport transfers and car hire. Departing 30 December 2023.\nBig White\nBig White offers great tree runs (Getty Images)\nBig White is one of the best choices in the country for beginners, intermediates and those looking to learn to ski powder, with less steep terrain and plenty of shelter and tree runs. Located in the Okanagan Highlands, this 2,800-acre resort was purpose built for ski-in\/ski-out access, providing easy access to the slopes from most of the accommodation.\nSome 18 per cent of its 119 runs designated as beginner, while intermediates have the pick of the slopes, with over 50 per cent catering to them. Though the resort is less advanced-friendly, there are challenging areas out in the open at the top of the mountain.\nMarketed as ‘Canada’s favourite family resort’, Big White is also a great destination for a ski holiday with the kids. The ‘Happy Valley’ area at the bottom of the village provides several non-skiing activities, and there are enough good restaurants to fill your stay if needed.\nBook it\nSki Safari offers February half-term getaways to Big White with a stay at the aptly named Chateau Big White in the centre of town. Close to the slopes and with convenient ski-in\/ski-out access, it has the ideal location for exploring both the pistes and the local area. Guests can sample food at the on-site Swiss Bear restaurant or the Black Diamond Bar & Grill.\nPrices for two adults and two children under 12 years from £1,280pp, including seven nights’ accommodation, room-only, return flights and transfers. Flights are arranged and quoted upon enquiry. Departing 10 February 2024.\nLake Louise\nLake Louise is the largest of the resorts in Banff National Park (Getty Images\/iStockphoto)\nLake Louise lies a little further away from Banff than Sunshine Village, but offers a larger ski area and some of the most amazing views in Banff National Park, including that of the famed Mount Assiniboine. Beginners will find the area around the foot of the hill a good start, while the area around the Grizzly Express and Larch Express lifts contains good beginner runs and some top-to-bottom greens. Much of the rest suits intermediates, while the Back Bowls are good for the more advanced.\nMost people will choose to base themselves in Banff, though the 45-minute drive to Lake Louise may put some off. A lift pass to the ‘Ski Big 3’ area covers Lake Louise, Sunshine Village and nearby Mount Norquay, but a stay in Lake Louise itself is a great option for a relaxing week split between skiing, the odd visit to Banff and seeing what this charming village has to offer.\nBook it\nAnother offering from Fairmont is the magnificent Chateau Lake Louise, a historic hotel located right next to the shores of the lake itself. Crystal Ski offers the most affordable package here, with a stay in an elegant double room that boasts delightful views of the Rockies. You’ll be five minutes away from town, with the ski area accessible using a free, 10-minute shuttle bus.\nFrom £1,904pp, including seven nights’ accommodation, room-only, return flights from London Heathrow to Calgary and transfers. Departing 27 January 2024.\nRevelstoke\nRevelstoke is one of Canada’s newest resorts (Getty Images\/iStockphoto)\nRevelstoke has managed to gain a glowing reputation despite existing for much less time than most of its rivals (it opened in 2007). Another resort that is well-known for the quality and quantity of its snow, it is still a work in progress – you can currently explore around 3,000 of the intended 8,000 acres – but is already a highly regarded destination for those of an intermediate level or higher.\nMount Mackenzie possesses everything from well-groomed, long blues like the 4km Snow Rodeo to steep open terrain or tree-skiing around the North and South Bowls, with a vertical of 1,700 metres that is the longest on the continent. Heli-skiing is also popular in Revelstoke, opening up access to 500,000 acres and 400 runs.\nBook it\nBook a stay at The Sutton Place hotel with Ski Safari. A refreshing blend of alpine facades and modern American interiors, it has large suites and impressive facilities including indoor and outdoor pools and three restaurants. Even better, it sits less than 50 metres from one of the main gondolas for easy access to the slopes.\nFrom £2,455pp, including 10 nights’ accommodation, room-only, return flights and airport transfers. Flights are arranged and quoted upon enquiry. Departing 15 January 2024.\nRead our reviews of the best Canada hotels\n\nThis article, authored by Chris Wilson, was published by The Independent - Travel on 2023-10-25 under the category 'entertainment'.\n\n","id":572}
{"title":"7 of the best luxury ski resorts for a five-star experience","context":"## 7 of the best luxury ski resorts for a five-star experience\n\nSign up to Simon Calder’s free travel email for expert advice and money-saving discounts Get Simon Calder’s Travel email Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nSimon Calder’s Travel email {{ #verifyErrors }} {{ message }} {{ \/verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ \/verifyErrors }}\nIf the unbecoming lug of skis back from the slopes has you envious of the privately chauffeured other side of the mountain, it’s time to join in with your own glamorous winter getaway.\nPicture indulging in delectable regional dishes from personal chefs, Michelin-star dining and exhaustive pillow menus, or upgrading your après pints to champagne flutes as you peruse high-end Alpine boutiques. From the Swiss slopes of Zermatt to the pistes of Vail in Colorado, it’s not just the snow that sparkles.\nBespoke adventure sports, including heliskiing, meet private ski instructors and pre-warmed boots in these prestigious resorts, while chalet board accommodation ensures there’s post-slope cake and canapes waiting, with a side of steamy hot tub sessions.\nHere are the world’s most exclusive ski resorts for a five-star holiday, and the lavish gondola-hugging chalets to book for unrivalled luxury off-piste.\nZermatt, Switzerland\nAt the foot of the Matterhorn Zermatt’s rustic charm and designer boutiques exude elegance (Getty Images\/iStockphoto)\nWith 360km of high-altitude slopes, Zermatt is an oasis for advanced skiers to cruise down linked blues and tackle advanced reds at the foot of the Matterhorn. Rustic charm oozes from the Swiss resort’s chalet lodgings and the car-free town is where you’ll find glitzy brands – Moncler to Omega – if you fancy a taste of the finer things in life.\nRead more on ski holidays:\nHow to ski in Zermatt\nSki Solutions offers a seven-night stay at Ulysse 8, a five-star chalet in Zermatt, for £1,565pp, chalet board, and with a ski instructor available from Monday to Friday at no extra cost. Six cosy bedrooms sleep 12 keen skiers in the chalet opposite the charming Winkelmatten chapel, a short walk from the Matterhorn Express gondola, and wellness rooms that guarantee relaxation after a day on the slopes. Departing 13 January 2024.\nReturn flights from London Luton to Zurich Airport from £107 with easyJet in January.\nMegève, France\nThis exclusive destination in the Alps twinkles in front of Mont Blanc (Getty Images\/iStockphoto)\nA popular French resort for cross-country trails, Megève guarantees great skiing on 400km of slopes while exuding luxury in extravagant chalets between adventures on the pistes. Plenty of French bistros, boutiques and Michelin-starred favourites are within walking distance of traditional five-star hotels, and views of Mont Blanc compliment al fresco morning coffees.\nHow to ski in Megève\nOxford Ski has a contemporary catered chalet in the heart of Megève, Chalet Ariana, that sleeps up to 10 adults and four children in six en-suite bedrooms. Standout features include an indoor swimming pool, boot warmers and proximity to the Chamois gondola. A seven-night stay in the luxury accommodation, including daily housekeeping and advice from a resort expert, will set groups back a hefty €14,750 (£12,720). Departing 3 December 2023.\nReturn flights from London Luton to Geneva Airport from £51 with Wizz Air in December.\nWhistler, Canada\nNorth America’s largest ski resort oozes prestige (Getty Images\/iStockphoto)\nCanada’s Whistler, North America’s largest ski resort at the base of the Whistler and Blackcomb Mountains, is legendary for its steep off-piste trails, peak-to-peak gondola ride and high-end après bars. Besides the sparkling layer of snow from November to April, prestige chalets house world-class spa facilities. Expect over 200 piste runs, oyster menus and live music sessions during a glam Whistler ski holiday.\nHow to ski in Whistler\nInghams is offering seven nights at the prestigious chateau-style Fairmont Chateau Whistler, below Whistler’s Blackcomb Mountain, from £1,559pp, based on four adults sharing, including return flights from London Heathrow, access to the hotel’s health club and a shuttle that runs into Whistler Village. Departing 1 December 2023.\nVail, USA\nCelebrated après and scenic gondola rides dot Colorado’s pistes (Getty Images)\nThis Colorado resort is North America’s premium ski destination and the third-largest mountain ski resort in the US. Vail’s iconic peaks, celebrated après and glamorous villages foster an exclusive atmosphere for travellers to share piste stories over Swiss-style fondue, likely in the company of some famous faces.\nHow to ski in Vail\nWith Iglu Ski, sophisticated skiers can spend seven nights at the ski-in, ski-out Arrabelle in Lionshead Village from £1,888.50pp. On-site spa facilities, a rooftop pool and a lavish plaza of boutiques complement the old-world opulence, and the Eagle Bahn gondola is right outside. Departs 2 December 2023.\nReturn flights from London Heathrow to Eagle County Regional Airport from £868 with United in January.\nLech, Austria\nHigh-end hotels in Alpine Austria’s Lech see shedloads of snow (and famous faces) (Getty Images)\nAlmost 305km of pistes welcome – almost guaranteed – shedloads of snow each season in the Austrian Alpine resort of Lech, making it the deluxe spot for seasoned skiers to holiday in lavish hotels and chalets. An extensive lift network, the legendary White Ring circuit, transports skiers not only to well-groomed runs lined with firs but elegant apres ski haunts above the upmarket Alpine village.\nHow to ski in Lech\nBramble Ski offers a grand alpine retreat, Chalech M, with rich wooden interiors and just a three-minute walk from the Schlosskopf chairlift. Highlights of the all-inclusive stay include a complimentary ski instructor for the first two days, pre-dinner canapés and champagne, and an in-resort driver service until 1am. The decadent six-bedroom space, complete with a spa, sleeps 10 for a cool €46,790 (£40,444) per week.\nReturn flights from London Gatwick to Innsbruck Airport from £64 with easyJet in November.\nÓlafsfjörður, Iceland\nÓlafsfjörður offers thrillseekers heli adventures in north Iceland (Getty Images)\nÓlafsfjörður, a small fishing village on northern Iceland’s Troll Peninsula, is a haven for heliskiing across 4,000km of terrain, with over 256 marked landings. Wellness hotels can be found the rugged landscape, with geothermal pools ideal for decompressing. Intrepid skiers lusting for the ultimate exclusive adventure can fly between March and June, then ski from summit to sea on Ólafsfjörður’s bespoke backcountry journeys.\nHow to ski in Ólafsfjörður\nScandic Guides offers a five-day heli-assisted ski touring package with professional mountain guides from €4,990pp (£4,314.69). There’ll be two summit heli drops per day and five nights of accommodation at the luxe Sigló Hotel, including of all meals and airport transfers.\nReturn flights from London Gatwick to Akureyri Airport from £55 with easyJet in November.\nNiseko, Japan\nJapan’s premier ski destination blends year-round powder with ski chalet sushi (Getty Images\/iStockphoto)\nA magnet for Asia’s elite, Niseko on Hokkaido Island is not short of deep “champagne” powder, traditional onsen hot springs and platters of après sushi at mountainside Michelin restaurants – there’s a reason it’s considered Japan’s best. With 51km of pistes, the powder playground is a maze of groomed runs and tree-weaving trails for skiers to enjoy before they retire to grand hotels with sprawling Mount Yotei views.\nHow to ski in Niseko\nCrystal Ski Holidays has seven nights B&B at the Hilton Niseko Village, less than a minute’s walk to the Niseko gondola. It’s home to three Japanese restaurants, welcomes skiers enjoy après in the hotel’s onsen, and has views of the volcano, Mount Yōtei, from its elegant hotel rooms. From £1,994pp, including return flights from London Heathrow, 23kg luggage per person and airport coach transfers. Departing 26 February 2024.\nRead our reviews of the best ski hotels in Europe\n\nThis article, authored by Natalie Wilson, was published by The Independent - Travel on 2023-10-13 under the category 'entertainment'.\n\n","id":573}
{"title":"How to tackle Black Friday shopping like a boss","context":"## How to tackle Black Friday shopping like a boss\n\nThe best deals of the year were once known to occur during Black Friday and Cyber Monday, which in 2023 take place on Friday, Nov. 24, and Monday, Nov. 27, respectively. Not anymore!\nIn 2023, the best Black Friday deals kicked off on Nov. 17 at Amazon, Best Buy, Walmart, and other retailers. Instead of hosting all of the doorbuster deals on one day right after Thanksgiving, retailers see the value in maximizing the amount of time you have to shop for products before Black Friday. And I’ve gotta say, it’s quite nice to not feel rushed while shopping.\nIn addition to presenting you with the best board game deals and price drops on gaming monitors, plus deals on SSDs and microSD cards, there are some bits of info and wisdom I’ve organized into sections below that might help you feel more informed as you begin to shop for the holidays.\nRetailer memberships will pay for themselves (eventually)\nTo get early access to Black Friday and Cyber Monday deals — or to get access at all — some retailers offer memberships. Most are familiar with Amazon Prime, which offers a free 30-day trial and unlocks special prices on top of free shipping and other perks, but there are others. Costco is another popular example that’s been around for a while. Its $60 membership pays for itself quickly with holiday purchases, especially if you buy food products in bulk (this is outside of Polygon’s purview, but you cannot beat its deal on Kerrygold butter).\nWalmart Plus costs $99 per year ($50 for a limited time), and serves as a ticket to get in on deals before other Walmart shoppers, plus other perks. Note: You won’t get early access to deals with its free 30-day trial; you must be a paid member to earn access, so hit “Skip trial for Early Access” when signing up.\nThen you have Best Buy’s My Best Buy Plus and Total memberships, costing $49.99 and $179.99, respectively. As for what each offers, check out Best Buy’s page that spells it all out. This page details all of the exclusive deals, which can help you quickly recoup the cost of the membership.\nAmazon Prime members get free games and DLC all year\nAmazon offers freebies for Prime members ’round the calendar year, not just during the holiday months. Those offerings expire over time and new ones are added, and Amazon’s suite of giveaways has improved over time.\nWe collect all of the latest free games and DLC that Amazon is giving away right here. To give you a taste, Rage 2, Star Wars: Knights of the Old Republic, and Doom 3 are some of what’s up for grabs right now.\nYou’ll get price matching if you shop at the right time\nSome major retailers are ensuring price protection on purchases right now.\nAmazon does not price match, which is annoying, but it’s tolerable since it often has the lowest prices of all retailers anyway. Amazon only protects the price on pre-orders that have its “Pre-order Price Guarantee,” which ensures that you’ll pay the lowest amount a product sells for before it’s launched.\nNot only does Best Buy match prices from “qualified competitors,” but its site says that most products bought between now and Dec. 30 can be price-matched through Jan. 13, 2024.\nWalmart’s policy says it won’t price match with competitors, nor does it price match for products purchased online that later decrease in price.\nTarget says that purchases made between Oct. 22 and Dec. 24 can be price-adjusted if the cost lowers in the span of time, and if you show proof of purchase. You may be eligible for a price match on a purchase, but the rules for submitting documentation vary depending on whether you’re shopping online or in store. It’s all explained here.\nMost Black Friday return policies extend through January 2024\nAccording to Best Buy, certain products bought now (dating back to Oct. 27) until Dec. 30 may be returned before Jan. 13.\nTarget will accept most unopened items in new condition within 90 days of purchase.\nWalmart has an extended holiday return policy in effect that allows items purchased between Oct. 1 and Dec. 31 to be returned on or before Jan. 31, 2024.\nAmazon’s extended return policy is in effect for most items that are purchased between Nov. 1 and Dec. 31. Those items can be returned before Jan. 31, 2024. However, Apple-brand products purchased in that time frame can only be returned on or before Jan. 15, 2024.\nBlack Friday likely won’t be your last opportunity to save\nThere will be amazing deals during Black Friday and Cyber Monday on everything, from tabletop and board games to toys, video games, and more. However, it likely won’t be the last opportunity for you to save. As someone who’s been covering deals for The Verge and Polygon for years, I’m shocked by how often I see these low prices, often spoken of as if they’re a flash in the pan, extending through much of December. That said, it’s more likely that price cuts on products you want can go by unnoticed unless you’re tracking deals yourself.\nTrack deals yourself\nWe love to tell you about great deals. But there’s a limit to the kind of products that we write about, and the ones that we see. If you’re not comfortable leaving it up to the chance that we’re going to tell you about price cuts on the products you really want, you have the power to track deals with relative ease.\nIf you only shop on Amazon, CamelCamelCamel remains one of the best tools for tracking price changes and history for products. While you don’t need an account to see pricing information available through the app, making a profile will allow you to set up watchlists and get email price alerts for your favorite products. You’re welcome to manually populate your own watchlist, but the app also allows you to import any existing Amazon wishlist into your CamelCamelCamel profile. Make sure to grab its Camelizer browser extension, too.\nHoney and its accompanying extension allow you to track pricing history changes on specific products, but across a number of retailers, not just Amazon. Also, as an added bonus, Honey will also automatically search for promo codes when you check out at a supported retailer.\n\nThis article, authored by Cameron Faulkner, was published by Polygon on 2023-11-12 under the category 'entertainment'.\n\n","id":574}
{"title":"Some of our favorite devices are on sale for Black Friday.","context":"## Some of our favorite devices are on sale for Black Friday.\n\nBlack Friday and Cyber Monday may be in the past, but some sales are still hanging around (although maybe not for long). For more leftover deals we recommend across all categories, be sure to check out the rest of the Cyber Monday still available here.\nEvery month or so, we like to ask our staff about their favorite stuff — whether it’s pet toys, travel aids, kitchen gadgets, or straightforward tech. And the results are usually very different, very interesting, and a lot of fun.\nIn celebration of the annual post-Thanksgiving sales, we looked through some of our recent “favorites” articles and found deals on a lot of the tech, kitchen tools, travel aids, and pet toys we like. We thought we’d list a few in case you’ve read about them in the past and thought, “Well, that sort of sounds good, but it’s a bit pricey.” (Or, “That’s pretty cheap, but maybe I’ll wait until the price goes down some more...”)\nSo here are some of our staff’s most-liked gear and gadgets, much of which is still discounted from Cyber Monday.\nTech tools\nElectronics repair kit\nAlex Cranz, managing editor\nTekton Everybit Tech Rescue Kit $ 22 $ 29 24 % off $ 22 $ 22 $ 29 24 % off A 46-piece screwdriver kit that can help you repair practically any tech device out there. $22 at Amazon\nI own at least two of these little Tekton Everybit Tech Rescue Kits, and I frequently buy them for friends and family, too. For an average price of $35, you get a screwdriver with nearly every bit you’d need for most gadgets (including the weird ones for Apple products), a plastic and a metal spudger, tweezers, and a suction cup. I’ve replaced batteries in iPhones with this kit. I’ve built entire PCs with this kit. I’ve swapped out backplates on Steam Decks and housings of Joy-Con controllers with one of these kits. I’ve even used it to repair my eyeglasses.\nOne of the best parts of the kit is it all goes in a single case that can be tossed in a computer bag or purse or be left in a desk drawer at the office. But honestly, the main reason I love it is the selection and quality of the bits. Too often, precision screwdrivers have super soft bits that strip the first time you use them with a screw that’s been tightened by a machine. Given that most gadgets have at least one too-tight screw, I’ve gone through quite a few cheap screwdriver kits before I settled on this one. While I’m slowly building out a high-quality selection of precision screwdrivers, most people don’t have that luxury or necessity. This is a great alternative — plus, you feel like kind of a badass when someone asks you to help fix a gadget, and you just pull this kit out of your bag in the middle of Starbucks and get to work.\nSafety cutter\nEmilia David, reporter\nI admit TikTok made me buy this small safety cutter, but it’s been indispensable to someone who may or may not have an online shopping addiction. The Slice Micro Ceramic Blade safety cutter’s tiny blade cuts through paper packaging tape cleanly, opens plastic wrapping, and keeps me from going insane opening blister packaging. It doesn’t damage whatever is inside, which unfortunately happens very often with my regular metal box cutter.\nThe downside is that it’s so small you may lose track of it if not in use, but it does have a built-in magnet and a handy dandy hole for a keyring. And while it doesn’t fully slice through a cardboard box, it will still leave a scratch, although that could ultimately damage the ceramic blade if not used properly. I’ve had my Slice Micro for a few months, so I’m not worried about it dulling yet, but it is unclear if the blade is replaceable.\nHeadphone hanger\nKaitlin Hatton, audience manager\nAnchor Pro under-desk headphone hanger $ 12 $ 15 20 % off $ 12 $ 12 $ 15 20 % off An under-desk dual headphone hanger that uses 3M adhesive for mounting and an included Velcro strap to anchor a headphone cable. $12 at Amazon\nI gave this a try for one of our TikTok videos, and it has not disappointed me yet. I use it to hold my Razer Kraken headset and some extra cords. It’s small enough to remain out of the way but large enough to hold more than the headset itself. It has a pretty strong hold and doesn’t give, even as I raise my standing desk up and down several times a day. It’s not the prettiest accessory one can attach to their desk, but it is highly functional.\nCharging station\nJess Weatherbed, news writer\nI got this as a birthday present from my partner after several months of arguing over our sleeping arrangements. Something about me trailing the charging cables for my devices in the bed being “dangerous” and “extremely uncomfortable.” Anyway, after begrudgingly acknowledging my poor charging habits, I have to admit that having this on my desk has had benefits outside of not garroting myself mid-slumber.\nMy iPhone, Apple Watch, and wireless earbuds rarely run out of juice, as I no longer fall asleep before plugging them in. I’ve also taken to using the charger’s upright positioning for phones to my advantage — serving as a desk clock, a tiny display for Slack or Discord, and as a hub to remotely control the various smart devices around my home. It helps me separate the device from being my phone and instead helps me build the habit of it being another tool to boost my productivity.\nHelp for the cook\nA multipurpose rice cooker\nVictoria Song, senior reviewer\nZojirushi Micom Rice Cooker and Warmer $ 194 $ 233 17 % off $ 194 $ 194 $ 233 17 % off A 5.5-cup-capacity rice cooker and warmer that not only cooks rice but also comes with a steaming basket to double as a steamer and a cake menu setting to bake cakes. $194 at Amazon\nA lot of people will tell you that rice cookers are single-use appliances meant only for rice — they’re wrong. A rice cooker is best at cooking rice, but it can do a lot of the same things as an Instant Pot. For instance, you can use it to cook hardboiled eggs or oatmeal, steam vegetables, make porridge, make one-pot meals, and even bake a cake.\nI grew up with giant 10-cup rice cookers at home, but I didn’t appreciate how versatile this appliance was until I left the country for college. A tiny two-cup rice cooker kept me fed in my cramped 250-square-foot Tokyo apartment. It was programmable, so I could wash my rice, stick it in the cooker, and know that when I woke up late for class, I could still whip up some ochazuke or oatmeal for a quick, cheap, and nutritious breakfast. (It also took the hassle out of steel-cut oats.) Whenever I had a craving for sweets, it was so easy to take pancake mix and bake a Japanese-style cheesecake for one.\nI’ve since graduated to a 5.5-cup Zojirushi Micom Rice Cooker, and it’s one of the handiest tools I have for meal prepping. When I was sick this past winter, I made ample use of its porridge setting to make a congee-type dish with chicken and ginger — just like my mom used to make when I was a kid. The fact that it’ll keep something warm for days, meant I could crawl out of bed, scoop out some porridge, and crawl back into bed with minimal effort. When I’m feeling lazy, I throw eggs in there, and bam — some extra hard-boiled protein. Mine also comes with a little basket, so it’s super easy to throw in veggies or steam frozen dumplings.\nBut what I like most is that rice cookers are more space-efficient than Instant Pots. In my kitchen, the one spot where I could fit an Instant Pot is instead occupied by a rice cooker, blender, and spoon rest. A multitasking kitchen gadget that doesn’t take over your entire counter? That’s a must if you live in a small space.\nOld-fashioned toaster oven\nAmelia Holowaty Krales, senior photo editor\nI love a toaster oven! It’s compact, works fast, and is perfect for reheating pizza, making nachos, and yes, even toast. I use my toaster oven more than my regular oven for sure — and probably more than any other item in my kitchen. I have a pretty basic model like this one, but these days, many come with other features, like air frying and convection oven capabilities.\nSeal in your fresh food\nEmma Roth, news writer\nFoodSaver vacuum sealer machine $ 147 $ 220 33 % off $ 147 $ 147 $ 220 33 % off Keep food fresh by squeezing all the air out of the package and sealing it for long- or short-term storage. $147 at Amazon\nI never knew how much I needed a vacuum sealer until I actually got one. I’m the type of person who shops at wholesale clubs despite only needing food for two people, so when I buy meat, I get a lot of it all at once, some of which inevitably gets stored in my fridge or freezer. That’s where my vacuum sealer comes in.\nWhile I can’t speak to the quality of other vacuum sealers, the FoodSaver I have is awesome. Not only does the thing help keep raw meat and other food fresher for longer in the fridge, but it also helps save space in the freezer (each package of meat becomes much flatter when all the air is sucked out of it). With this little machine, I can load up whatever I want in one of the FoodSaver bags, insert the open end into the machine, which vacuums up all the air and then closes the bag using its heat sealing feature in one fell swoop. It’s pretty neat!\nFor the traveler\nCarry-on backpack\nKaitlin Hatton, audience manager\nEarlier this year, I committed to traveling more, and so I took a look at the gear I had that could be replaced after years of trekking the globe. My ratty old secondhand carry-on bag was the first thing to be replaced. After several days of weighing the pros and cons of various travel bags, I stumbled upon this Lumesner carry-on backpack on Amazon, and it fit all of my needs. It can carry a laptop, several days’ worth of clothes, my 40oz Hydro Flask bottle, and more. The bag even includes some packing cubes. It’s very comfortable, and the weight is well distributed when it’s completely full. It’s an inexpensive alternative to many name-brand carry-on bags, too. So far, I’ve used it on a handful of trips, and the quality has held up. It also holds onto pet fur, though, so I had to add a small lint roller to my travel necessities. But that’s just life while traveling with a dog anyway.\nAn extension cord for awkward situations\nSarah Jeong, deputy features editor\nAnker 321 Power Strip $ 15 $ 26 42 % off $ 15 $ 15 $ 26 42 % off This all-in-one 20W USB-C power cube boasts three AC outlets, two USB-A ports, and one USB-C port. $15 at Amazon\nNobody wants to carry a power strip or an extension cord with them on their vacation. It’s probably unnecessary if you’re staying in relatively modern buildings and definitely unnecessary if you’re camping. But sometimes you want to stay in a charming historical hotel or a lovely cabin in the woods, and it’s only when you go to charge your devices at night that you realize that the only electrical socket in the bedroom is in the corner farthest away from the bed and there’s already two lamps plugged into it.\nOlder buildings especially suffer from what I can only describe as loose socket syndrome, where those very convenient modern boxy socket extenders with five different USB and USB-C charging ports simply cannot stay in place and fall right out of the wall because they’re too heavy. After one (totally pleasant) vacation where I had to charge my phone, watch, AirPods, and laptop in a weird corner of my room with the plug-in charging hub propped up on a strategically balanced mountain of books and sham pillows, I bought this Anker combination extension cord \/ power strip. It’s not a full power strip — just a cube with a few sockets along with USB and USB-C charging ports at the end of a five-foot cable. I’ve brought it on a few trips since then. It takes up extra space in my suitcase but each time has left me feeling vindicated about the purchase.\nThe three prongs at the end of the cable are static, rather than folding flat for easy packing. This is key because the loose sockets of older buildings reject the beautiful convenience of folding prongs. There are more than enough sockets for one person, and with some finagling (and maybe an extra charging brick), it can accommodate two people’s devices.\nIf you’re traveling overseas, don’t forget to purchase a different plug type for the region you’re going to or pack an adapter.\nA portable smart speaker\nBrandon Widder, senior commerce editor\nSonos Roam $ 134 $ 180 26 % off $ 134 $ 134 $ 180 26 % off The Sonos Roam is a truly portable Sonos speaker with a rugged design that’s built to withstand the elements. It also features wireless charging and supports AirPlay 2, Alexa, and Google Assistant. $134 at Best Buy$134 at Sonos\nFor the longest time, my go-to portable speaker for camping and backpacking was the Ultimate Ears Roll 2. It was small and efficient, but it didn’t mesh well with the rest of my audio setup, especially on those sweltering summer days when I barely made it beyond the confines of my own backyard.\nA couple of years ago, however, I splurged on the Sonos Roam. The rugged, pint-sized device is on the pricier side when compared to other Bluetooth speakers, but it produces solid sound for the size, offers wireless charging, and can automatically jump between my home Wi-Fi network and Bluetooth, a convenience I’ve come to appreciate when strapping the speaker to my bike and heading out the door.\nAnd while I might not be able to fire off my usual quips at Alexa when I take it into the backcountry — the Roam only supports voice commands when connected to Wi-Fi — I certainly can still do it poolside with a drink in hand.\nUniversal travel adapter\nVictoria Song, senior reviewer\nEpicka universal travel adapter $ 20 $ 25 20 % off $ 20 $ 20 $ 25 20 % off Epicka’s universal travel adapter is an all-in-one adapter that includes four different plugs that cover over 150 countries. $20 at Amazon\nIn my youth, I forgot to pack plug adapters for international trips one too many times. Buying them once you’ve landed in another country isn’t always easy, either. And if you’re like me, your relatives in rural Korea don’t always have more than one plug for your American devices — in which case, you’ll have to share with your six other cousins. Nope. Absolutely not. Which is why I never leave this country without a universal travel adapter.\nBasically, it’s six plug adaptors in one. Depending on which one you get, it might come with USB ports so you can charge multiple devices in one outlet. Granted, it’s bulkier than buying one or two specialized adapter plugs, but if you’ve got a multi-continent itinerary, it’s a game-changer. What I like about this one from Epicka is that it comes with a spare fuse in case things go sideways with voltage.\nThe only caveat is that, although it says “universal,” it’s technically only the four most common types of plugs. That’ll get you by in most countries, but it’s not a guarantee in places like Brazil, South Africa, or India. Even so, I’ll take this over price gouging at airport electronics shops or having to take time out of my schedule to visit a local hardware store.\nLovely lights\nBrandon Widder, senior commerce editor\nI’m a big fan of ambient lighting, even when I’m 50 miles from the nearest outlet. And while I’ve long been a proponent of MPOWERD’s solar-powered Luci lanterns, I recently picked up the company’s like-minded string lights for car camping and overnight jaunts in the backcountry when I don’t mind toting a little extra weight with me.\nThe 18-foot string is certainly not the brightest you can buy — it packs a series of 100-lumen LEDs, whereas your average headlamp might offer 400 — but it can swap between six different colors and features a 2,000mAh battery for when your phone needs some emergency juice. Best of all, you can charge the lights via USB or solar, meaning you can spend less time worrying about how to keep them going and more time taking in the vibes.\nMemory card holder and reader\nBecca Farsace, senior producer\nAs a video person who is constantly on the move, there is nothing better than the consolidation of gear — especially when it pertains to dongles. So when fellow video extraordinaire Vjeran Pavic (The Verge’s supervising producer) recently surprised me with a very cute birthday note and this magical little gadget, I was elated.\nAnd if that wasn’t enough, it has a carabiner hook. It is everything I have ever wanted in a rubber case and more. To have both my SD card reader and all my cards in one place is priceless (well, actually $39.95). Thank you, Vjeran. <3\nA mobile tripod for holiday snaps\nJess Weatherbed, news writer\nWhen you go on holiday with your partner or family, you generally get stuck with three options when it comes to taking group photographs: a cramped selfie, leaving someone out to take the picture, or asking a total stranger to take it for you. Not to be dramatic or anything, but I’d rather not ruin my vacation by trying to figure out which individuals nearby are the least likely to dip the minute I hand over my phone. And it’s depressing to think that my mum is in so few of our family photos because she was always the person on the other side of the camera.\nA decent Bluetooth-enabled tripod can resolve these issues. I’ve had good experiences using Atumtek’s 60-inch Self-Stick Tripod — it features a discreet, detachable Bluetooth shutter remote that you can pair with your smartphone, sparing you from having to set a timer and run like hell. Simply get into position and use the remote to snap as many shots as you need to ensure it’s caught you at a flattering angle. It also extends up to 60 inches to squeeze everyone into a group selfie if you’re using it as a selfie stick. This could be a brilliant gift for any “Instagram boyfriends” who spend hours of their vacations as their partner’s dedicated paparazzi.\nA car-friendly charger\nSean Hollister, senior editor\nMaybe someday Apple will realize that it wasn’t the brightest idea to artificially limit the reach of its MagSafe charging ecosystem and you’ll be able to plop your phone on a magical minimalist disc that charges it at high speeds. In the meanwhile, a standard Qi charger is about the best you’ll get — and the bulky but practical iOttie Easy One Touch Qi does it with the satisfying snap of springs. When you push your phone into its waiting jaws, it depresses a button that causes those jaws to firmly snap closed on either side of your device. When you want to remove it, you pinch a pair of levers with your finger and thumb to release as you grab your slab. It’s wide enough to fit practically anything on the market, save an opened Samsung Z Fold. I’ve used one for years with Android and Apple phones alike, including newer MagSafe handsets.\nA colorful fanny pack\nVictoria Song, senior reviewer\nI’ve always been stymied by the need for a bag smaller than a backpack or knapsack but larger than a dinky clutch. I was wary of the whole “wear a fanny pack as a mini crossbody bag” trend, but earlier this summer, I caved and bought the Baboon to the Moon 3L Fannypack.\nNow, I cannot go back. This bag easily fits my wallet, phone, house keys, car keys, hand sanitizer, and chapstick — everything I need when I take walks or run errands. It’s also got a quick-release buckle, so I can stick a carabiner on it and schlepp around a water bottle on hot days. The material is also incredibly durable, spill-proof, and easy to clean. The inside has some dividers but nothing too complicated.\nBut what I probably like most about this fanny pack (and this brand in general) is how colorful their bags are. I got one in lavender, stuck some enamel pins on it, and now there’s absolutely no mistaking this is mine. I can see it easily from a distance, which also makes it harder to lose. The mix between colorful whimsy and practical functionality is something I wish I saw more often. All I’m saying is that two of my friends went out and bought the same bag in different colors as soon as they saw me wearing it. And we’re all immensely happy with our purchases.\nProducts for your pet\nHair remover\nMitchell Clark, former news writer\nChomChom pet hair remover $ 25 $ 32 22 % off $ 25 $ 25 $ 32 22 % off The ChomChom is a reusable cat and dog hair remover that works great for furniture.\n$25 at Amazon\nThe ChomChom pet hair remover is an extraordinarily simple device — it’s basically a couple of pieces of plastic, fabric, and rubber. But through some dark magic, it’s better at getting cat hair off my couch, cat tree, and other upholstery than even the adhesive-laden lint rollers (though those are still superior if the thing you’re trying to de-pet is yourself). I’d explain more, but honestly, I think the ChomChom can best be explained with this GIF:\nChomChom pet hair remover. GIF by Mitchell Clark \/ The Verge\nI know I’m stretching the definition of “tech” here, but I just had to share the ChomChom because the first time I saw someone use it, my jaw dropped. I hope it can change your life like it did mine. (Note: as far as I can tell, the limited-edition cat ChomChom that I paid extra for is 0 percent more functional than the regular one. It was still worth it, though.)\nFuzzy cat bed\nElizabeth Lopatto, senior reporter\nJeeves loves to be in the office with me while I work. (I assume she’s supervising.) Anyway, to make her cozier, I got her this fuzzy cat bed. At first, she was afraid of it — she’s extremely shy around new people and objects — but now, a year later, it’s her favorite place to sit that isn’t my lap. Usually, she spends the afternoon snuggled up in it.\nDistracting dog toy\nKaitlin Hatton, audience manager\nTrudee, otherwise known as My Boss, is notoriously insistent on being the focus of my attention. At any given moment, she has 20 toys strewn about my apartment, but she will not play with them unless I’m watching her — like literally, no distractions, sitting within feet of her, just staring at her chew on her toys for hours on end.\nDon’t get me wrong. I love staring at my dog, but she doesn’t get the enrichment she deserves when her activity levels are tied directly to my ability to give her undivided attention. That is, until I bought the Pet Fit For Life Plush Wand. It has a toy attached to a long chewable rope that is suspended from a metal pole. Now, I not only toss the toy about the room from the comfort of my couch but also Trudee is so distracted by chasing it that she doesn’t notice if I am not making direct eye contact. It’s a win-win.\nVerge Deals \/ Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. Email (required) Sign up By submitting your email, you agree to our Terms and Privacy Notice . This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nThis article, authored by Barbara Krasnoff, was published by The Verge on 2023-11-24 under the category 'technology'.\n\n","id":575}
{"title":"54 Best Apple Black Friday Deals (2023): iPad, Apple Watch, AirPods","context":"## 54 Best Apple Black Friday Deals (2023): iPad, Apple Watch, AirPods\n\nLooking for a new Apple device? There's no time better than now. Whether you're on the hunt for a new iPad, MacBook, Apple Watch, or just a new iPhone case, there are more Apple products on sale for Cyber Monday than you'll typically find at any other time of year. Here are some of our favorites. For more gadgets on sale, be sure to check out our Best Cyber Monday Deals roundup.\nWe test products year-round and handpicked these deals. The discounts we show are based on actual street prices at retailers in the past few months. Products that are sold out or no longer discounted as of publishing will be crossed out. We'll update this guide periodically.\nUpdated November 27: We've added a new deal on a 14-inch MacBook Pro (M3 Pro, 2023) and updated pricing and live deals as Cyber Monday comes to an end.\nIf you buy something using links in our stories, we may earn a commission. This helps support our journalism. Learn more.\nApple's Cyber Monday Promotion\nApple notoriously doesn't run sales on its own storefront. However, it does usually throw in a gift card for Apple Store credit if you purchase select items. This year, now through November 27, you can get up to $200 in Apple Store credit to use later if you purchase certain items. For example, if you buy an iPhone 14 or iPhone SE, you can get up to $75 in store credit. Buy a MacBook Air and you'll get up to $200. You can find the full list here.\nSeparately, there's also a sale on Apple gift cards on Amazon. Each one has a unique corresponding coupon code that you can see on this page. For example, you can get a $100 Apple Gift Card and a free $15 Amazon credit with code APPLET5USAP. There are tons of cards to choose from. You can browse them all here.\nJump to a Topic: iPads, MacBooks, Apple Watches, Beats and AirPods, Chargers, Cases and Accessories.\niPad and Accessory Deals\nFor more info, check out our Best iPads guide for a breakdown of every iPad model.\niPad Photograph: Apple\nThis is the best iPad (8\/10, WIRED Recommends) for most people in our Best iPads guide. It's not only affordable, but it also packs a ton of great features, including a True Tone display (that adjusts the color temperature to match the ambient lighting in your environment), a 12-megapixel rear camera with support for Center Stage (which keeps you in the frame on video calls), 64 gigabytes of storage on the base model, and a Touch ID-enabled home button. It's compatible with accessories like the first-generation Apple Pencil and Apple's Smart Keyboard.\nThis iPad (7\/10, WIRED Review) isn't our top choice (we recommend the ninth-gen model over this one largely due to the price). But it does pack a few notable changes. With no Home button and slimmer bezels around the screen, it has a modern design. There's an upgraded rear camera and the selfie camera has moved to the center of the iPad for video calls. Under the hood is Apple's A14 Bionic chip (the same that's in the iPhone 12), so it's more powerful than the last-gen model. It was on sale for the same price last Cyber Monday.\niPad Air Photograph: Apple\nIf you're looking for an iPad that's a bit more powerful than the ninth-gen model, we recommend the iPad Air (8\/10, WIRED Recommends). It comes equipped with a 10.9-inch LCD screen, slim bezels, a USB-C port Touch ID built into the top power button, and the same M1 processor as the 2020 MacBook Air. It packs support for the Smart Keyboard Cover, Magic Keyboard Cover, along with the second-generation and USB-C Apple Pencil. It's worth mentioning Apple might be launching a new version next year, but the M1-powered iPad Air is still a great choice.\nThe iPad Mini (8\/10, WIRED Recommends) is our favorite tablet for travel. It's small enough to slip into my tote bag and fits perfectly on an airplane tray table. The 8.3-inch display is great for reading ebooks, watching movies, sketching, and taking notes (it's compatible with the second-generation and USB-C Apple Pencils). Powered by the A15 Bionic processor (the same one found in the iPhone 13), it can easily handle taxing apps and games. As with the iPad Air, Apple is rumored to be launching a next-gen version next year with a faster processor, but this is still a solid tablet if you don't need the latest and greatest.\nWe've used this hub with iPads, but it's also great for MacBooks. Plug it in via the USB-C port on your laptop and you'll have access to another USB-C port for passthrough charging, a USB-A port, an HDMI output, and a headphone jack. It's also fairly compact and thin, so it won't add too much bulk to your laptop. It dipped to $40 back in August, but we still think this is a good deal.\nApple Pencil Photograph: Apple\nThe first-gen Apple Pencil has been around for a while now, but it still functions well. It packs features like pressure sensitivity (the lines get thicker as you press down harder on the screen), tilt sensitivity (for shading), and handwriting support within search fields and apps (like Notes). It's compatible with the iPad (6th gen and later), iPad Air (3rd gen), iPad Mini (5th gen), iPad Pro 12.9-inch (1st and 2nd gen), iPad Pro 10.5-inch, and iPad Pro 9.7-inch. It dips to this price often, but we still think it's a good deal.\nThis is the most feature-packed stylus Apple has to offer. It's compatible with the iPad Air (4th gen and later), iPad Mini (6th gen), iPad Pro 11-inch (1st gen and later), and the 12.9-inch (3rd gen and later). As with the first-gen model, it comes with pressure sensitivity, tilt sensitivity, and handwriting support, plus wireless pairing and wireless charging (it'll charge when magnetically attached to the top edge of supported iPads). There's a double-tap feature too, which lets you switch between tools quickly by tapping on the Apple Pencil twice. It hits this low often, but it's a solid discount if you don't want to pay full price.\nThis stand often goes on sale during the holidays, but it's still a good deal. This tablet stand is included in several WIRED guides, including the Best iPad Accessories and the Best Work-from-Home Gear. It's portable, lightweight, and easy to use.\nThis adapter dongle has a 60-watt USB-C port, USB-A, MicroSD slot, SD card slot, 3.5-mm audio, and 4K 60-Hz HDMI, and it’s sleek and compact. One of the nice things about Hyper’s Apple peripherals is that they’re designed to blend in with your Apple devices, so this dongle comes in a space gray metal enclosure with rounded edges that doesn’t look out of place or stick out like a sore thumb when plugged into your iPad. Writer Jaina Grey has had one of these for years and despite frequently losing (and finding) it, it’s an everyday carry item for her and really helps turn your iPad into a portable workstation.\nJump to a Topic: iPads, MacBooks, Apple Watches, Beats and AirPods, Chargers, Cases and Accessories.\nMacBook and Accessory Deals\nRead our Best MacBook guide for more.\nMacBook Pro Photograph: Apple\nIt's been less than a month since Apple released this MacBook Pro and it's already on sale. This M3 version replaces the 13-inch MacBook Pro, which Apple no longer sells through its stores. It packs the same mini LED screen, 120-Hz refresh rate, brighter display, and 1080p webcam as the high-end versions. You'll also get an HDMI, two USB-C ports with Thunderbolt 4, an SD card slot, a high-impedance headphone jack, and a MagSafe charging port. We recommend the M3 for anyone who wants some of the Pro features but doesn't want to drop almost $2,000 to get it.\nThis MacBook Pro (9\/10, WIRED Recommends) is less than a year old, but we only recommend it if you can find it for under $1,800. It packs all the same features as the latest version and the M2 Pro is more than capable of handling graphically demanding and intensive tasks. This is also the lowest price we've tracked for this specific configuration.\nThis M3 Pro MacBook Pro is similar to the other model that's on sale. It just has a larger screen, a more powerful CPU, and slightly better graphics. Apple's brand-new M3 chips are available in three different MacBook tiers—the M3, M3 Pro, and M3 Max (9\/10, WIRED Recommends). They're all included in our guide to the Best Laptops.\nApple's brand-new M3 chips are available in three different MacBook tiers—the M3, M3 Pro, and M3 Max (9\/10, WIRED Recommends). They're all included in our guide to the Best Laptops. The M3 Pro falls in the middle as far as processing power and speed goes, but it's still blazing fast. We recommend that you opt for the Pro if you’re a serious productivity user or content creator. This deal matches the best price we've seen so far.\nMacBook Air Photograph: Apple\nThe MacBook Air (7\/10, WIRED Recommends) packs a modern design complete with a MagSafe connector so the laptop won't fly off if you accidentally trip on the cable. Thanks to the M2 chip, it also delivers plenty of power for everyday tasks, solid battery life, and a 1080p webcam. It's dipped lower to $899 in the past, and it hits this price often, but we still think this is a solid deal. However, if you want the latest version, it's worth noting Apple is rumored to be launching an M3-powered version of the 13-inch and 15-inch MacBook Air next year. Keep in mind that this model drops to this sale price relatively often.\nIf you want a bigger screen, the 15-inch MacBook Air (8\/10, WIRED Recommends) is the first large-screen option within the Air lineup. It packs all the same features as the 13-inch version including a redesigned chassis and 1080p webcam. The M2 also delivers excellent performance and solid battery life (with about 10 hours of use). For the smoothest experience, we recommend opting for 16 gigabytes of RAM if it's in your budget. It's also on sale for $1,449 ($250 off).\nThe M1-powered MacBook Air (9\/10, WIRED Recommends) came out in 2020, but it's still one of the most powerful laptops you can buy for this price. It remains our favorite budget MacBook to recommend. You'll get great performance and battery life (it'll easily last a full workday), an improved keyboard, and a lightweight chassis that's great for travel. It's worth mentioning, however, that it frequently goes on sale for this price.\nMac Mini Photograph: Apple\nThe Mac Mini (9\/10, WIRED Recommends) is a powerful, compact desktop. All you need to do is plug it into a monitor, pair it with your keyboard and mouse, and you're good to go. It doesn't pack as many ports as the version with the M2 Pro, but you'll still get two Thunderbolt 4 USB-C ports, two USB-A, an HDMI, a 10-gigabit Ethernet connection, and a 3.5-mm headphone jack. It's dipped this low a few times before, but it's still a great deal.\nThis is our favorite external keyboard in our Best MacBook Accessories guide, especially if you're a fan of the Magic Keyboard on your MacBook and are looking to fully replicate your setup. This one comes with a Touch ID button, which you can use to log in, authenticate for purchases, and download apps. It also has the same function row keys as the M-series MacBooks, including playback buttons, a Mission Control Key, and a dedicated Do Not Disturb button.\nWith the ability to flex the stand up to 22 inches high, you can adjust this laptop stand depending on your setup—whether you’re using an external monitor or working solely off a MacBook. It’s also super compact and portable. Our only complaint is that, while you can adjust the stand's angle up to 45 degrees, it’s too wobbly to type on if you're using the laptop's keyboard.\nThis is both an affordable and well-built monitor. WIRED reviews editor Julian Chokkattu has used it for years now and it's served him well. While the price often dips under $100, this is a few dollars lower than we've tracked.\nBaggu Puffy Laptop Sleeve Photograph: Baggu\nYou'll see the discount at checkout. The 16-inch version Baggu Laptop Sleeve in Sherbert Cherry looks just as cute in person as it does online. The puffiness provides plenty of protection, and the Velcro closure is strong enough you don’t have to worry the laptop will slide out. We tested it with the 15-inch MacBook Air, which left space to squeeze a keyboard and mouse into the sleeve as well. There's also a 13-inch\/14-inch version for those who have smaller MacBooks or want a sleeve for their iPads.\nSpeck’s Smartshell case has the proper cutouts for ports and rubberized feet to keep your machine in place. You can throw it in your backpack, tote, or duffle bag without worrying about damaging your machine. We tested it with the 14-inch MacBook Pro but it’s also available for a wide range of MacBook models. It’s worth noting, that the hardshell isn’t scratch-resistant (despite Speck’s claims)—we’ve noticed a few scrapes on ours here and there, but it’s not too noticeable.\nThis keyboard is a runner-up in our Best MacBook Accessories guide. It mimics the MacBook keyboard with a Do Not Disturb key, and the ability to program the function row key with Apple's own apps like Final Cut Pro, Photos, Safari, and more, using the Logi Options+ app—in addition to other Mac-specific shortcuts. It's only available with Tactile Quiet switches, but these are ideal if you typically work around other people and don’t want to disturb them.\nThis microfiber mat will keep your desk looking nice and clean. It also doubles as a giant mousepad. It only comes in black, but it's a great option if you're looking for a desk mat that's minimalist and affordable.\nIncase Hardshell Case Dots Photograph: Incase\nThis is currently our favorite MacBook case. We tested it with the 16-inch MacBook Pro (2021), but it’s available for a few MacBook models. It has rubberized feet that prevent it from sliding, precise cutouts for all ports, and ventilation to keep the MacBook from overheating.\nThe Das Keyboard MacTigr (9\/10, WIRED Recommends) is expensive, but it’s great for those in the Apple ecosystem with a dedicated Mac layout. It also has cherry MX Red switches (that don’t get too loud), a two-port USB-C hub, and a high-quality all-metal build.\nPhotograph: Keychron\nThis is WIRED reviews editor Julian Chokkattu's current daily keyboard. You can use it wired or wirelessly via Bluetooth and it comes in several colors and switches to pick from (it’s also RGB-backlit). The red switches aren’t very loud but are still clicky, and there’s a great knob for volume control. It’s hot-swappable too, so you can change the switches whenever you’d like.\nIf you prefer low-profile keys, the K3 Pro is a solid choice. The keys have a tactile click, RGB lighting, and you’ll get around four to five days of battery life (with the ability to charge it via the USB-C charging port). You’ll also get support for Via too, if you want additional software customization.\nThis is WIRED reviews editor Julian Chokkattu's favorite portable monitor. It's a great second screen that doesn't take up any desk space, but it does require sticking adhesive magnets onto your laptop. It's best suited for 13- to 14-inch laptops and is best for apps like Slack rather than anything that needs crisp colors. It drops to this price often, but is still a good deal.\nApple Watch Deals\nRead our Best Apple Watch guide for an overview of the company's smartwatches.\nApple Watch Series 9 Photograph: Apple\nThe Series 9 (7\/10, WIRED Recommends) is the latest Apple Watch. If you're looking to upgrade, it offers faster performance, improved battery life, and a brighter display. There's also a new Double Tap feature that will trigger functions like playing music or hanging up a call by tapping your index finger and thumb. With the second-gen ultra-wideband chip, you can precision-locate your iPhone and AirPods too.\nIf you don't need all the in-depth capabilities that come with the Apple Watch Series 9, the second-generation Apple Watch SE is a great alternative. It still tracks crucial health and fitness features, and with the S8 chip, you'll also get Crash Detection and the redesigned Compass app. It has support for WatchOS 10 too, so you'll have access to the latest software updates.\nThe second-gen Apple Watch Ultra (8\/10, WIRED Recommends) packs a brighter 3,000-nit display, the latest S9 chip, and the new ultra-wideband chip for precision-locating your phone. You still get the useful Action button, the three-mic array, and the precise GPS so you can find your way home. It's the Apple Watch with the best battery life thanks to its gigantic size.\nJump to a Topic: iPads, MacBooks, Apple Watches, Beats and AirPods, Chargers, Cases and Accessories.\nBeats and AirPods Deals\nRead our Best Wireless Headphones and Best Wireless Earbuds guides for more.\nPowerbeats Pro Photograph: Beats\nThe Powerbeats Pro (8\/10, WIRED Recommends) are older (they came out in 2019), but they're still our top pick for earbuds with the most secure fit—making these a great option to workout with. They have an IPX4 water-resistance rating too, which means they'll stay protected from sweat. These buds deliver excellent sound quality and pack nine hours of battery life (with an extra 18 hours in the case). Many of the features won't work with an Android phone, but the core features will.\nThe Beats Studio Pro Wireless Headphones (7\/10, WIRED Review) pack excellent noise canceling, good sound quality, and great wireless range. They also offer a stable fit and compact design. They are missing a few key features though, including multi-band EQ and sensors for auto-pause. But improved sound quality and active noise canceling, as well as a few neat features for both Apple and Android devices, make these a good option—especially on sale. They're $10 cheaper than they were on Prime Day, making this the lowest price we've tracked.\nThe Beats Fit Pro (9\/10, WIRED Recommends) deliver great sound and a comfortable fit. With Apple's proprietary H1 chip, they work like AirPods when used with an iPhone. But they also work great with Android, complete with an app that allows you to customize the controls and perform a fit test. These have dipped as low as $159 in the past, but this is still a good discount.\nAirPods Pro Photograph: Apple\nApple just launched these AirPods (9\/10, WIRED Recommends) back in September, and they're already on sale. They're identical to the old pair on the outside but pack some internal upgrades. In addition to slightly improved sound, there's also a new Conversation Awareness mode (that turns the music down and boosts Transparency mode so you can hear someone talking to you).\nJump to a Topic: iPads, MacBooks, Apple Watches, Beats and AirPods, Chargers, Cases and Accessories.\nApple Charger Deals\nFor more options, check out our Best Apple 3-in-1 Wireless Chargers and Best MagSafe Power Banks guides.\nAnker MagGo 637 Photograph: Anker\nSimply stick your iPhone to this cute little orb and it'll start charging. Flip over to the back, and you'll find two USB-A ports, two USB-C ports, and three AC outlets. It's a compact and tidy charger, and our unit has been going strong for more than two years. It fluctuates in price very often, and it's hit as low as $60 in the past, but we still think this is a good deal.\nThis power bank is one of our favorites if you're looking for an upgrade. It has an absolutely gargantuan 24,000-mAh capacity, and it can be charged up in an hour. It can output up to 140W, making it powerful enough to charge laptops and tablets, as well as charging your phone super quick.\nThis is a great charger if you travel often with an iPhone and Apple Watch. Instead of packing two separate chargers, the Duo offers the luxury of both all within a compact, foldable form factor. You can use it to charge your AirPods (as long as it comes with a wireless charging case) and other Qi-certified devices too.\nPhotograph: Zendure\nThe Zendure SuperTank Pro is the largest portable battery you can get away with taking onto an airplane. Which is why it's our favorite for air travel. With a 26,800-mAh capacity, four USB ports, and up to 100 watts in or out, it's the only portable power bank you'll need for every device on even extremely long flights. Plus it kinda looks like a mini carry-on suitcase, that's neat. Just be sure to click the coupon button to get the full deal.\nThis is a great power bank if you don't want to carry a cable around. It comes complete with a built-in rotating USB-C or Lightning connector (MFi certified) that slots into the bottom of your phone. It also packs a 5,000-mAh capacity and a USB-C port for recharging it (complete with a short cable). We don't recommend it if you have a thick case on your phone, though.\nThe best 2-in-1 stand in our Best Apple 3-in-1 Wireless Chargers guide has a MagSafe spot to charge your iPhone at top speed (up to 15 watts) and a recessed spot below for your AirPods case. It holds your iPhone in portrait or landscape orientation, which is great for StandBy. It's not a huge discount, but we've never seen it cheaper.\nBelkin 3-in-1 Wireless Charger Photograph: Belkin\nThis is our top charger in our Best Apple 3-in-1 Wireless Chargers guide. With a T-shaped design that suspends two of your devices midair, it's compact enough that it won't take up too much space. You can use it to charge your iPhone (at the fastest 15-watt charging speed Apple allows), fast-charge the Apple Watch Series 7\/8\/9\/Ultra, and use the base to power up your AirPods Pro (or AirPods with a wireless charging case) simultaneously all from a single outlet. It dipped as low as $100 back in August, but this is still a great deal.\nWe like Anker's chargers and its Prime range employs GaN technology to shrink the size down. This 67-watt charger has fold-out prongs and offers two USB-C ports and one USB-A. It supports fast charging for iPhones (in addition to Pixel phones and Samsung Galaxy phones) but can also charge a MacBook.\nPhotograph: Satechi\nThis handy charger has enough power to juice up two MacBook Pro models simultaneously. But it's also great if you have a lot of devices around your desk that constantly need to be charged. It has a little stand to prop it up, a short cord that goes out to an outlet, and four USB-C ports that output 100 watts each. This is the lowest price we've tracked.\nClick the coupon button to see the discount at checkout. We recommend this Baseus charger if you're looking for a high-capacity option. With a 10,000-mAh capacity, WIRED contributor Simon Hill says it charged his iPhone 14 Pro once and then delivered an additional 64 percent the second time before tapping out. It comes with a USB-C cable too. The 6,000-mAh version is also on sale for $30 ($20 off). These deals are only applicable to Amazon Prime members.\nApple 35-Watt Dual USB-C Port Power Adapter Photograph: Apple\nIf you tend to forget to pack chargers for your devices, Apple's dual USB-C port power adapter is an essential accessory. With two USB-C ports, you can use it to recharge both your MacBook and iPhone simultaneously. Rated at 35 watts, it's also powerful enough to recharge an iPhone 15 Pro Max or iPad Pro.\nThis is one of our favorite MagSafe wireless chargers. It delivers the maximum 15-watt charging speed possible, sits securely on your desk, and can charge an Apple Watch too. It doesn't come with a power adapter, but it does include a USB-C-to-USB-C cable.\nIf you prefer a mount on your dash or windshield and have an iPhone 12 or later, iOttie's Velox Pro Magnetic Wireless Cooling Charger is a great option. The suction cup attaches to a windshield or dashboard pad (and proved secure in our testing) and the telescopic arm delivers a wide range of movement for the ideal position. It only maxes out at 7.5 watts for charging, but the USB-C charging cable can be removed when the iPhone is fully charged. There's also a built-in fan that helps keep the temperature down when it's hot out.\nCourant Catch:2 Photograph: Courant\nThis is a great wireless charger if you're looking for a stylish option to match your interior decor. The Belgian linen-wrapped surface comes in a variety of muted tones including camel, charcoal, forest, and natural. It can charge two devices simultaneously, but you do have to be precise when placing your phone on it. There are LED lights that show when it's charging and the rubber feet prevent the charging pad from shifting around.\nIf you need a charger for just your iPhone and AirPods, this is our favorite 2-in-1 stand. It has a MagSafe spot to charge your iPhone at top speed (up to 15 watts) and a spot below for your AirPods. It holds your iPhone in portrait or landscape orientation too, which is great for StandBy mode. It's not a huge discount, but this is the lowest price we've seen.\nThis charger packs two USB-C ports, one of which can output 65 watts when used alone. If you plug two devices in, the top will deliver 45 watts and the bottom can do 20 watts. It also folds up and looks super sleek.\nSatechi Duo Wireless Charger Stand and Power Bank Photograph: Satechi\nClick the coupon button to see the full discount at checkout. The Satechi Duo combines the convenience of wireless charging with the portability of a power bank. It has a 10,000-mAh capacity (complete with LEDs to show you how much juice you have left) and can wirelessly charge both your phone and a wireless earbuds case (as long as it's Qi-certified). There's also a USB-C port to power up a third device. The only gripe we have is that it's slow—delivering 10 watts of wireless charging power for phones (7.5 watts for iPhones), 5 watts for earbuds, and 10 watts via the USB-C port.\nThis travel kit from ESR works well if you want something that can prop your iPhone in portrait or landscape orientation. It can also display your Apple Watch in Nightstand mode, so you can peek and see how long before you must get out of bed. The main body folds open with a MagSafe charging pad for your iPhone and a slot behind for your AirPods. Unfortunately, it doesn't support fast charging and it's capped at 7.5 watts and 5 watts for the iPhone and Apple Watch, respectively. But it's a good, affordable charger. It dipped lower to $40 back in July, but this is still a solid deal.\nSatechi's four-port hub is a little too large, considering the number of ports you get, but there's a good reason for that. Pop off the aluminum cover and you'll find a slot for an M.2 SATA solid-state storage drive slot. That means access to an external SSD, along with two USB-A jacks, one 100-watt USB-C pass-through charging port, and a 4K HDMI at the same time. I did not have an M.2 SATA drive to test, but this 1-terabyte card should work. Just know that Satechi's hub does not support NVME M.2 cards.\nPhotograph: Otterbox\nThis is our Runner-Up pick in our guide to the Best Apple 3-in-1 Wireless Chargers. It can charge all your Apple devices at top speed and comes with a 6.6-foot cable and a 36-watt wall charger.\nApple hasn't nixed the charging adapter from its iPads yet, but it probably won't be long before you'll need to start buying your own. Or maybe you just want a spare for another room. I like this tiny adapter from Anker. The 30 watts can fast-charge the iPad Pro despite the compact size and the plug folds in, making it a nice option to take on the go.\nWhat we like best about this phone mount is that you can use it one-handed. The arms automatically close around the phone when you place it against the trigger button. To remove it, press the release bars. There's also a telescopic arm and ball joint that allows you to tweak the placement and set an ideal angle. We also love the clever magnetic tab that attaches the charging cable to the back of the mount, to keep from having to fish around for it. Plus, it's super sturdy—even on bumpy roads.\nJump to a Topic: iPads, MacBooks, Apple Watches, Beats and AirPods, Chargers, Cases and Accessories.\nPhone Cases and Accessory Deals\nCheck out our Best MagSafe Accessories, Best iPhone 15 Cases, and Best Camera Gear For Your Smartphone guides for other picks.\nLume Cube Mobile Creator Kit 2.0 Photograph: Lume Cube\nThis kit comes with a Lume Cube light, a compact tripod (that opens up to 55 inches in length), a shotgun mic with a windscreen, and a universal phone mount with clips to attach all these accessories. It's a great and convenient all-in-one solution if you shoot content with your smartphone.\nOtterbox is the first name in super-protective phone cases, and it features in our Best Galaxy S23 Cases, Best iPhone 15 Cases, guides along with many others. Over the years, several people on the WIRED Gear Team have had and tested Otterbox cases, we can definitely speak to their reputation for durability. Otterbox also makes one of our favorite Apple 3-in-1 chargers. Everything on its site is 25 percent off.\nThis is our favorite way to mount an iPhone to a bike or scooter. Or pretty much anything that's a rod. It sits secure, and you have to pair it with a Peak Design SlimLink case for added security—your MagSafe iPhone won't fly off even if you go over a deep pothole. Other MagSafe accessories from the company are also on sale, like the Car Vent Mount, which we also really like.\nPhotograph: Amazon\nApple's AirTags are a handy way to keep track of your stuff (as long as you're careful to make sure you're not being tracked without your permission). These often go on sale, but if you're itching to pick up a pack of them, now's as good a time as any.\nApple's official MagSafe case has accurate cutouts for ports, clicky buttons, and it protects the entire bottom edge of the phone. It comes in a variety of colors too. Select colors are also on sale for the iPhone 15 Pro Max for the same price.\nThis collab between the two brands brings the rugged design from Nomad's cases and the SlimLink MagSafe mount system from Peak Design. It's a great combo that gives you more security when mounting your iPhone 14 Pro or iPhone 14 Pro Max.\nTired of people glancing at your display in public? The Glass Elite Privacy 360 will block anyone from seeing content on your screen from the sides. It feels great and is easy to apply too. Our only complaint is that Zagg's screen protectors are typically expensive. This has hit as low as $24, but it's a good screen protector if you need one for your iPhone 14. Other sizes (for the iPhone 14 Plus, iPhone 14 Pro, and iPhone 14 Pro Max) are also on sale.\nTotallee Thin iPhone Cases Photograph: Totallee\nYou won't get the most protection from Totallee's cases, but they're some of the thinnest on the market. It will keep your handset safe from everyday scuffs without adding too much bulk. These cases are available for a variety of iPhone models.\nIf you have an iPhone 14 or earlier, you can never own too many Lightning cables. These cables from Nomad are durable, come with the choice between USB-C and USB-A for the other end, and are available in different lengths.\nWe're fans of Incipio cases—we've included them in our Best iPhones 15 Cases and Best Samsung Galaxy S23 Cases guides. For Cyber Monday, the company is offering up to 50 percent off a wide selection of cases and accessories.\nPhotograph: Zugu\nWe named this the best iPad folio case we've ever tested. Why? It's durable, with a lip around the edges of the screen that protects the expensive glass if dropped, and the buttons feel solid, yet easy to use. The magnetized cover stays securely shut, and it can be reversed to become a stand in eight different angles. Don't have a 2022 10.9-inch iPad? No problem. There are cases to fit lots of iPads, even those several years old, and most of them are also on sale.\nNever mind that it's wool—it actually is easy to clean, as reviewer Brenda Stolyar found out while testing it underneath her laptop, keyboard, notebook, and coffee mug. There's a lot of real estate, and it comes in a variety of colors. It's why we called it the best overall desk mat on the market. There's a pricier version with cork on the bottom, if you think the regular, felt-bottomed version will slip around on the desk—say, if you're using a glass table.\nPhotograph: Popsockets\nThis is one of our favorite MagSafe phone grips. It magnetically sticks to the back of your iPhone and you can pop out the grip for extra stability. You can just take it off to wirelessly charge your device.\nThis cable can do it all, which is why it's currently sitting at the top of our Best USB-C Cables guide. It can deliver 100 watts, transfer data at up to 40 Gbps, and serve an 8K display (or two 4K displays). It supports DisplayPort Alt Mode (DP Alt Mode), USB Power Delivery (USB-PD), and PPS, and it is backward-compatible with all earlier standards. It's pricey, even with the discount, but it rarely dips this low. This is also the longest size; the shorter one is also on sale.\nThe Creator Kit acts as the link between your phone and various mounting solutions. It comes with a magnetic locking mount that works with the Peak Design SlimLink phone case and a few different mounting options including a Peak Design Arca quick-release plate, a GoPro mount adapter, and a 1\/4-inch tripod mount. That way, you can easily mount it on almost any tripod. Your phone (with the case protecting it) will slot easily into the SlimLink mount and stay secure.\nWhat About iPhone Deals?\nYou typically won't see many iPhone deals. Those sales usually come from carriers like AT&T, Verizon, and T-Mobile, and have several requirements, like being on an unlimited plan or opening a new cell line. If you're in the market for a new iPhone, we've laid out a few deals on older unlocked models here, along with some carrier promotions.\nPublished November 26, 2023: We've updated prices throughout for Cyber Monday sales, and added a few more deals including the Otterbox sale, HyperDrive 6-in-1 Dongle, and Macbook Pro 16-inch laptop.\n\nThis article, authored by Brenda Stolyar, was published by Wired on 2023-11-25 under the category 'technology'.\n\n","id":576}
{"title":"UFC 295 predictions, best bets, odds: Tom Aspinall, Mackenzie Dern among top picks to consider","context":"## UFC 295 predictions, best bets, odds: Tom Aspinall, Mackenzie Dern among top picks to consider\n\nUFC 295 took a hit when heavyweight champion Jon Jones suffered an injury that forced him out of his planned title defense against Stipe Miocic. Despite the loss of the planned main event, the card features some compelling and evenly-matched fights, including a pair of championship bouts on top when the promotion returns to Madison Square Garden in New York.\nIn the main event, the vacant light heavyweight title is up for grabs when former champion Jiri Prochazka clashes with former middleweight champion Alex Pereira. Prochazka never lost the belt but was forced to vacate due to a shoulder injury. An injury to Jamahal Hill, who won the title after Prochazka vacated, left the belt up for grabs once again, setting up this bout that sees Pereira as a slight -115 favorite.\n\"I'm not going into this fight with mixed emotions about vengeance. I don't want to play that game,\" Pereira told CBS Sports this week. \"I want to go with a very positive mindset. I'm going to fight with the mindset that they haven't even fought before. But looking into the other side of being able to bring Glover his belt back and put it back in the gym, that means a lot to me.\"\nThe pair of heavyweights set to clash could usher in the new era of the division. Sergei Pavlovich and Tom Aspinall are both vicious finishers with neither man going beyond the six-minute mark of a fight in their UFC careers. Because of their immense power and skills, the fight is a virtual pick'em at the betting window.\nCan't get enough boxing and MMA? Get the latest in the world of combat sports from two of the best in the business. Subscribe to Morning Kombat with Luke Thomas and Brian Campbell for the best analysis and in-depth news, including a complete preview of UFC 295 from New York below.\nAs with every UFC pay-per-view event, there will be plenty of action at sportsbooks around the country. As always, we are looking at each main card fight to identify the \"best bet\" for each bout. After a 2-2 result at UFC 294, our record for the year now stands at an even 28-28.\nLet's take a look at what we've identified as our choices for the best bets on the UFC 295 pay-per-view main card.\nCBS Sports will also have live coverage of the fight with round-by-round scoring and blow-by-blow updates to keep you up to date throughout the night.\nDiego Lopes vs. Pat Sabatini\nPat Sabatini moneyline (-115)\nThis is a sticky fight to me. According to the odds, both men are most likely to win by submission, which makes sense given that both have 12 submission victories on their resume. Where it gets tricky is that neither man has a submission loss, so they've both been dominant in applying their grappling. Lopes is a bit more dangerous on his feet but Sabatini has the better wrestling and can probably impose his will to force the fight to the ground. The question is whether either man can trap the other in a submission once Sabatini puts the fight on the floor. The odds suggest the fight won't go the distance (-190) but I'm not so sure this doesn't become a three-round grind on the ground, so we'll go with the slight favorite to score the win on the strength of his wrestling.\nMatt Frevola vs. Benoit Saint-Denis\nUnder 1.5 rounds (-143)\nAfter four of his first five fights in the UFC went to decision, Frevola has not seen the second round in his four most recent bouts. Three of Saint-Denis' five UFC bouts have checked in at under 1.5 rounds. The matchup iis a good mix of fighters looking to find a quick finish. If you want a slightly higher risk, Saint-Denis is +155 to win by KO, TKO or DQ. Frevola has two knockout losses on his ledger, one in an even one minute and the other in just seven seconds. Saint-Denis can finish fights quickly and Frevola has gotten drubbed out of fights fast in the past.\nMackenzie Dern vs. Jessica Andrade\nMackenzie Dern to win by submission (+115)\nThis is Andrade's fifth fight in 2023. That usually indicates a fighter is on a good run and looking to continue their momentum. Instead, Andrade has lost her three most recent fights, all by stoppage. Dern is an incredibly accomplished submission grappler and won four of her first seven UFC fights by submission. The submissions haven't been coming for Dern as of late, however, with a 2-2 run in her four most recent outings, all going to the judges' scorecards. Andrade has four submission losses in her career, two of which came during her current three-fight skid. This feels like the perfect fight for Dern to get back to basics and dominate on the ground before finishing with a submission.\nSergei Pavlovich vs. Tom Aspinall\nTom Aspinall moneyline (-120)\nYou have to go all the way back to June 2017 to find a Pavlovich fight that went past the opening round. In fact, only three of his 19 career fights have hit the five-minute mark and he has five wins that came in less than one minute. Not to be outdone, Aspinall has six fights that ended in less than one minute and three that went past the opening round. This all adds up to a wild situation where this interim heavyweight championship fight has +500 odds for the fight ending in the first minute of the fight, the \"favorite\" of the time of finish lines. The fight going past 1.5 rounds is +165, which is somewhat appealing since this is a five-round fight and it would make sense for both men to not dump their entire tank on chasing a quick finish. Still, Aspinall's more diverse game makes his moneyline a slightly more appealing bet.\nJiri Prochazka vs. Alex Pereira\nOver 1.5 rounds (-150)\nOnly three of Prochazka and Pereira's nine UFC fights have ended in under 1.5 rounds. Both men are dynamic and dangerous, with the ability to finish a fight in a flash. Still, both men are also tough as nails and highly skilled. In such an even fight, it's hard to throw a bet at either man straight up or any method of finish unless you feel you have a truly good read on the bout. I don't have that feeling, but I do think the fight happens at a high pace and lasts more than one and a half rounds before either man takes over or gets the finish. Barring someone landing an early bomb, this feels like the best available line for the fight.\nWho wins UFC 295: Prochazka vs. Pereira, and how exactly does each fight end? Visit SportsLine now to get detailed picks on every fight at UFC 295, all from the MMA expert who profited more than $6,200 in 2022, and find out.\n\nThis article, authored by Brent Brookhouse, was published by CBSSports.com on 2023-11-11 under the category 'sports'.\n\n","id":577}
{"title":"He killed Jon Snow. Now Owen Teale is coming to ruin your Christmas","context":"## He killed Jon Snow. Now Owen Teale is coming to ruin your Christmas\n\nSave Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size It all started with a car full of booze and a bear costume. Owen Teale, recently suspended from his sixth-form college for organising a riotous Christmas party for fellow students, was in need of a job. “They held an investigation into the party and I was the first to be called in,” says the 62-year-old Welsh actor best known as gimlet-eyed master-at-arms Ser Alliser Thorne in Game of Thrones. “They’d found the empty bottles and people were falling over drunk. I said, ‘yeah, I did it. It was me. I borrowed my mother’s car, loaded it up with booze and smuggled it in’.” Teale had no intention of joining his father at the limestone quarry that fed the steel works at Port Talbot. He wanted to escape South Wales, to find a bigger world. Which is when fate – or rather a kindly teacher called Mr Davies – intervened. He suggested Teale might find work at Barry Island Pleasure Park, a fairground near Cardiff. “At the time, it was a rust bucket of a big wheel and one big dipper,” recalls Teale. “But I went along and auditioned. I was hoping to be a magician’s assistant or something like that, but they said ‘you’d be great as the bear. Here’s the costume’.” Game of Thrones star Owen Teale will play Scrooge in a Melbourne season of A Christmas Carol. Credit: Jay Brooks The role of Barry the Bear was deceptively hard. “His remit was to wander around the park greeting visitors, but you could only do an hour at a time because you sweated so much. I wore pyjamas under the costume to absorb the sweat, but it would fill the rubber hands. After a while, I’d get bored, sit on the big wheel and go round and round.” The sight of a disconsolate, sweaty bear riding the ferris wheel caught management’s attention and Teale was sacked. At which point a couple of his co-workers – students from the Guildford School of Acting – suggested he audition at their alma mater. He was accepted, awarded a study grant and Barry the Bear got a ticket out of Wales.\nAdvertisement\n“I was going nowhere really. If I hadn’t met those two young women I don’t know what would have happened,” says Teale. “But there have been so many points in my career, moments of pure chance, when things went my way. And if you can survive the moments when things don’t go your way, you can make it.” If you’re not a diehard Game of Thrones fan, Teale’s name may not be familiar. But his pale face, intense eyes and imposing physicality – he’s 188cm in his socks – will be. The Welsh character actor is a Zelig-like figure whose frequent stage and screen appearances invariably guarantee two things: the tale will be well told and bad stuff is going to happen. He’s in Leeds when we speak, visiting his younger daughter Gracie, 21, who’s studying art and design at the city’s university. Eliza, 25, his other daughter with actor wife Sylvestra Le Touzel, is following in her parents’ footsteps. His son, Ion, from his first marriage, recently made him a grandfather. Owen Teale and his wife, Sylvestra Le Touzel, at the sixth-season premiere of Game of Thrones in Hollywood. Credit: Getty Images Loading Earlier today, he was in Edinburgh shooting scenes for the second season of the supernatural TV thriller The Rig. His character Lars Hutton, an irascible bully and the man most likely to be chucked off the oil rig, has somehow made it back for the next instalment of the Amazon Prime drama. Hutton, Thorne and Chief Inspector Philip Osborne, another textbook bully who first appeared in the opening season of the BBC police procedural Line of Duty, are just three of the menacing characters he’s played in recent times. Peter Knox, a villainous sorcerer in A Discovery of Witches, the fantasy TV series based on books by Deborah Harkness, is another.\nAdvertisement\nWhen he portrays Ebenezer Scrooge in an upcoming Melbourne production of Jack Thorne’s award-winning adaptation of Dickens’ A Christmas Carol, he’ll summon the same forces to make the archetypal miser utterly convincing. The truth is this: the avuncular man in the amber-coloured spectacles and leather jacket chatting to me on the line from Leeds is a master of darkness. When Ser Alliser Thorne drove a dagger into the heart of Game of Thrones’ Byronic hero Jon Snow in the final episode of Season 5, he left the show’s 10 million viewers in a profound state of shock. “It’s true, I have started to play a lot of dark characters,” he says, smiling. “And at first it was a great challenge because I’m quite a sociable fellow.” So, how does he find that darkness? “It’s a sense of nothingness. In all honesty, I’m not very good at being completely on my own,” he explains. “I come alive when I’m with other people. So staying in hotel rooms away from my family isn’t great and it doesn’t get any easier. There’s something empty and a bit scary within me when I’m not with people. I think that’s where that stuff comes from.” Owen Teale unleashes the darkness as Ser Alliser Thorne in Game of Thrones. His ability to tap into the void served him well as he prepared to enact the murder of Snow, played by Kit Harington. “There was Kit … who was so beautiful. And he’s such a lovely man. By connecting to this feeling of emptiness, of having nothing inside of me, I was able to look at him and everything he had - his looks, his grace - and feel pure hatred. For all of Ser Alliser’s explanations [for the murder], deep down he just has a hatred of Jon Snow’s popularity and gifts.” Like Iago, I suggest. “Yes,” he says. “Very like Iago.”\nAdvertisement\nWhen Snow’s death was broadcast, Teale braced himself for the fall-out. He imagined being confronted by irate Game of Thrones fans who would hate him for “killing the goodness”. Instead, he was asked for endless selfies and impromptu recitations of Thorne catchphrases such as “For the Watch!” or “Bas-terd!” Once, a drunk emerged from a restaurant and stumbled towards Teale brandishing a knife. The actor braced himself, but the man simply wanted “Ser Alliser” to hold the utensil to his throat for a photo. On a visit to Uluru with his family, the tour guide caught sight of his face and exclaimed, “what are you doing here?” Says Teale, “He just kept staring at me and I realised it was an Alliser Thorne thing. I said, ‘I’m not going to kill anyone, I’m just an actor’. But it clearly troubled him that this person who had committed this awful crime had suddenly appeared.” Teale has the grace to admit he enjoys this new level of celebrity. “People seem to realise that without the darkness of people like Ser Alliser, Jon Snow couldn’t have shone as brightly as he did.” Owen Teale with Clare Homan in The Fifteen Streets. Credit: ABC He was well into his 50s when he landed his highest profile role, but it would be wrong to think of Teale as a late starter. In 1989, not long out of drama school, he starred in the hit television adaptation of Catherine Cookson’s romance The Fifteen Streets. The cast included Sean Bean, another young working-class actor, who went on to become a leading man in Hollywood before playing Ned Stark in Game of Thrones. I ask Teale if he ever wishes he’d followed Bean’s trajectory. “Oh god, yeah,” he replies. “Absolutely. You instinctively think [playing leading men] will lead to feelings of success. But it never came my way. My cut of my jib wasn’t quite right. It’s about what your face does on screen I guess.”\nAdvertisement\nThere have been opportunities to step into the spotlight over the years. When The Fifteen Streets attracted a massive TV audience in Britain, Teale was offered a lead role in a movie playing a bare knuckle fighter. But the financing fell through and he signed up for a four-year stint with the Royal Shakespeare Company instead. Years later, a producer offered him the lead in a big film being shot in Britain, but the money men demanded an American star and William Hurt got the gig. When Teale won a Tony Award in 1997 for his performance in Ibsen’s A Doll’s House, he was told he needed to spend time in Hollywood wooing producers. He decided to fly home to his family in London instead. “My wife was about to give birth, so I said ‘I’m off’. I’m sure part of it was I just didn’t believe that I was going to waltz into leading man roles in Hollywood.” And there it is, that ambivalence. Despite all the plaudits, the awards and the steady offers of work, you sense Teale has never been certain of his gifts. It’s probably why he’s so consistently good – complacency isn’t in his nature. Owen Teale with Toni Collette in Dream Horse: “Toni just raised my game,” he says. Credit: AP He’s far better at recognising brilliance in others. For example, Toni Collette, who he worked with on Dream Horse, a 2020 movie about an unlikely champion racehorse. “Toni just raised my game. That’s a huge talent, huge,” he says, shaking his head in wonder. “I recently received an award from BAFTA for the film and part of me thinks they should give it to Toni.” He’s happiest in a room full of actors working on a play, a film or a TV production. “What turns me on is the thought of collaborating with talented people. I’m very sociable with the rest of the company and fully intend to do that when I come to Melbourne.”\nAdvertisement\n\nThis article, authored by Richard Jinman, was published by The Sydney Morning Herald on 2023-10-20 under the category 'entertainment'.\n\n","id":578}
{"title":"Subtle as a sledgehammer, a pop icon returns","context":"## Subtle as a sledgehammer, a pop icon returns\n\nTate McRae’s career, until recently, had a stench of desperation about it. That’s a wild thing to say about someone who’s only 20, but how else to describe the feeling you get watching an artist who trades explicitly in classic pop moves failing to grab the mode such musical expression necessitates, ie: popularity? Tate McRae’s Think Later: a second stab at superstardom. Despite her age, the Calgary-born musician’s already had a journey. A professionally trained dancer since 6, at 13 she finished third on the US version of So You Think You Can Dance and attracted record label attention with songs uploaded to YouTube. In 2020, her weeper You Broke Me First had a chart moment, leading to her debut I Used To Think I Can Fly in 2022, an intriguing album of thrashy bangers and post-Billie Eilish sad-pop featuring production from pop titans Greg Kurstin (Adele) and Finneas (Eilish). It had at least one could’ve been smash – the spiky What Would You Do? – but, fairly listless despite her swaggering delivery, it failed to ignite with either mainstream audiences or pop aesthetes. But then, this past August, Greedy happened. Used in a video by popular TikToker Tube Girl and then in countless hair-flip transition clips, the song went viral, eventually amassing over 320 million streams globally, topping charts internationally, and becoming McRae’s proper breakthrough and a rare reintroduction. It even landed her a slot on Saturday Night Live, that pop superstar rite-of-passage, and sold out shows for her upcoming Australian tour next November. That Greedy’s the thing that’s pushed McRae to the next level is somewhat confounding. Is it even a good song? It’s not particularly memorable, and McRae’s debut had better tracks that slipped listeners by. But its sassy sentiment – “I would want myself”, particularly suited to clips of youthful coming-of-age expression – clearly caught on with the TikTok crowd, which is how pop stardom happens these days. In another popstar move, McRae also channelled an alter ego (Tatiana, who’s “ballsy, loud and obnoxious”) for Greedy’s vibrant music video, a fun throwback to choreographed Y2K-era aesthetics – McRae dancing all lustily on a Zamboni (so Canadian) – which surely helped.\nIn this context comes Think Later, McRae’s sophomore release. Almost completely produced and co-written with Ryan Tedder (OneRepublic), it sports his hit-making trademarks, for better or worse – pristine songcraft hooked around off-kilter concepts that can’t help but catch the ear, but punishingly midtempo, songs searching for gravitas over, say, fun. For an album that’s supposed to be McRae’s bold, confident, cheeky makeover, parts of it lack spark. Tellingly, the best songs on the album – Exes, Hurt My Feelings and Guilty Conscience – follow the Greedy template: skittering Timbaland-style beats recalling Y2K-era pop, all syncopated and staccato and sultry kiss-offs to dumb boys. They feel strong and personally nostalgic – like McRae’s nodding to her countrywoman Nelly Furtado’s classic mid-’00s run – but driven by McRae’s playfulness. We’re Not Alike shows another promising side to McRae’s sound, a post-punky thing built on an Interpol-ish riff that slyly builds into something anthemic, recalling her pal Olivia Rodrigo’s sleeper Guts track, Pretty Isn’t Pretty (the post-punk revival has officially returned to pop, it seems). That these songs are so interesting makes the album’s overemphasis on understated ballads frustrating. Songs like opener Cut My Hair, Grave and Stay Done are slick but dour affairs, the classic Tedder formula. Messier, which weirdly is not another Canadian nod to ice hockey great Mark, shows McRae has the range, a bitter ballad where she allows her vocals to get raw and unhinged.\nBut the real pleasure of Think Later lies in McRae’s idiosyncrasies and their potential; she’s a throwback in the classic singing-dancing Britney mould. With a pop landscape led by serious singer-songwriters like Taylor Swift, SZA, Rodrigo and Eilish; Dua “go girl, give us nothing” Lipa; the fame-trolling Doja Cat; and the introverted to the point of obscurity PinkPantheress, there’s a vacancy for McRae’s particular set of popstar skills. If she’s greedy enough, the platform feels like it’s hers to grab. Robert Moran I\/O, Peter Gabriel For a guy who spent much of the ’70s at the forefront of prog-rock as the singer for Genesis, creating sprawling concept albums, wearing a series of increasingly bizarre stage outfits that suggested he had ingested a truckload of acid on the way to a Halloween party, and being one of the main reasons punk had to happen, Peter Gabriel sure did go on to personify big, shiny ’80s pop. The most played video on MTV? That would be Sledgehammer, his body slam of a hit from 1986 that did just what it said on the tin. The song blaring from that boombox John Cusack held aloft under Ione Skye’s window in the iconic scene from 1989’s Say Anything? That would be Gabriel’s In Your Eyes. And, somewhat bizarrely, you can barely watch an old episode of Miami Vice without hearing a Gabriel song in the background. After two decades, Peter Gabriel returns – overcooked and overlong.\nFrom popularising the massive, heavily gated drum sound that dominated the era to becoming one of world music’s greatest champions by co-founding the WOMAD festival, for a while there Gabriel was seemingly everywhere. And then… he wasn’t. In fact, I\/O is his first solo album of new original material in over two decades. Some wags are calling it his Chinese Democracy, but the rarely punctual Axl Rose only took a comparatively brisk 18 years to finally release the follow-up to Use Your Illusion. Some things haven’t changed. From the get-go, on opening track Panopticom, there’s that gunshots-in-an-echo-chamber drum sound and the instantly recognisable fat, slithering tones of long-time bassist Tony Levin. And the subject matter is the familiar, big-world thinking we’ve come to expect, too – in this case, Gabriel’s utopian idea of an infinitely expandable and accessible world database, but, you know, one that doesn’t peddle untruths. The title track could almost come from Coldplay, with its singalong chorus designed for arena crowds waving lit-up smartphones, while Gabriel sings “stuff coming out, stuff going in, I’m just a part of everything”.\nIn the late ’90s, Gabriel collaborated with Randy Newman on That’ll Do from the Babe soundtrack. Should Newman be indisposed for the next Pixar film soundtrack, Gabriel’s Playing For Time could easily slot in for that reflective, tear-inducing, life-affirming ballad Newman routinely provides for the end of the second act. In fact, there’s a palpable sense of mortality on I\/O. Gabriel is 73, and he’s mining a seam of material here about taking stock, feeling at one with the world and the (admittedly, not exactly original) realisation that love is all we need. This reaches its most intense moment in And Still, a song he wrote to deal with the death of his mother in 2016. It’s a fragile, delicate thing that has an almost Nick Drake transparency to it, as he remembers leaning his head against her skin and the feeling of her brushing his hair as a young boy. But with all that time spent cooking up these songs, some have been left in the oven too long, stretching to five, six, seven minutes, and in need of an edit or at least a change in tempo. Olive Tree and Live and Let Live overload the “one with the world” barrow he’s pushing – the former, a Sting-like concoction that seems to be two different songs bolted together; the latter, coming from a fine place (inspired by Nelson Mandela and The Elders project) but littered with cliches such as “When we can forgive, we can move on” and “An eye for an eye, again and again, until the whole world is blind”. On top of all this, there are two mixes of the album, one a “bright-side mix” by Mark “Spike” Stent, and the other a “dark-side mix” by Tchad Blake. Yes, it’s a lot to take in. But then, it’s been a while in the making. And who knows when, or if, we’ll get a follow-up? Barry Divola To read more from Spectrum, visit our page here.\n\nThis article, authored by Barry Divola, was published by The Age on 2023-11-30 under the category 'entertainment'.\n\n","id":579}