{"title":"Beeper reversed engineered iMessage to bring blue bubble texts to Android users","context":"## Beeper reversed engineered iMessage to bring blue bubble texts to Android users\n\nThe push to bring iMessage to Android users today adds a new contender. A startup called Beeper, which had been working on a multi-platform messaging aggregator, is now launching a new app called Beeper Mini which will allow Android users to send and receive end-to-end encrypted iMessage chats for just $1.99 per month. Beeper Mini was made possible because the team behind the app has managed to reverse-engineer the iMessage protocol, they say.\n“That’s the big breakthrough,” explains Beeper co-founder and CEO Eric Migicovsky, previously the founder of smartwatch startup Pebble. “We’re not actually a middleman anymore. The research that we’ve done is actually reverse-engineering the iMessage protocol, down to the lowest layer of the protocol. So Beeper Mini doesn’t use a Mac server as a relay like all the other apps — they have a Mac Mini in a data center somewhere. And when you send a message, you’re actually sending a message to the Mac Mini, which then forwards it to iMessage,” he explains. “Beeper Mini is a native implementation of the iMessage protocol.”\nBeeper does not have access to the contents of users’ messages, the company claims. And unlike the recently paused efforts by Sunbird, which had been trying to solve the same problem, messages are not sent in clear text.\nInstead, the message you send from an Android phone using Beeper Mini is end-to-end encrypted to the recipient, the startup says. It’s encrypted on the device before it leaves the app. Encryption keys are exclusively stored on your phone within the Android filesystem, similar to other apps like Signal and WhatsApp. The app doesn’t connect to any servers at Beeper itself, only to Apple servers, the way a “real” iMessage text would.\nThat means that Beeper Mini can function as a true iMessage client, supporting high-resolution photos and videos, threads, replies, read receipts, direct messages and group chats, tapback emoji reactions, editing and unsending messages, as well as support for stickers, GIFs, voice notes and more. Not yet supported are features like live location sharing, message effects and support for FaceTime audio and video calls. Users will not need an Apple ID to use Beeper Mini.\n“It’s a full-blown iMessage app,” Migicovsky says. “For all intents and purposes, Beeper Mini looks like an iPhone [sent it].”\nApple, then, may not be able to simply block Beeper Mini texts automatically if it wanted to take action against the company, though the co-founder admits how Apple will react is still uncertain.\nHowever, he points to a provision in copyright law, The Digital Millennium Copyright Act (DMCA 1201 F), which says that reverse-engineering for the purposes of interoperability is protected. That won’t necessarily prevent Apple from sending Beeper legal a Cease and Desist, of course. Apple previously sued spyware maker NSO Group to block it from using Apple’s services, and it could likely make a legal case here, as well, if it chose to. What may hold it at bay is the Digital Markets App (DMA), a law in Europe that says big tech companies will have to have an interoperable interface for their chat networks. There are also stirrings of antitrust efforts in the U.S., where Apple is under federal scrutiny, which could make for bad timing to target Beeper, too.\nBut to be fully trusted, Beeper Mini will need to be audited by a third party — something it has not yet done. In addition, Beeper uses certificate pinning, which makes network traffic analysis more difficult to perform in order to verify its claims. The company says its external audit is still “in progress” but it has performed an internal audit. The company is publishing those results on its blog along with a detailed, more technical description of how Beeper Mini works.\nFor example, the team explains here how it needed to build a new service, called Beeper Push Notification service (BPNs), to make the service work:\nA persistent connection to APNs is needed to be notified of new incoming messages in real-time. On an iPhone, an APNs connection is maintained by the operating system, and connected at all times. In Beeper Mini, the connection can only be maintained when the app is running, since Android does not support APNs natively.\nTo work around this limitation, the team built BPNs to connect to Apple’s servers on the user’s behalf when the app isn’t running.\nIn tests, Beeper Mini worked as described, able to send iMessage texts from an older Android phone on Google Fi’s wireless network with its own phone number (not associated with an Apple ID) to an iPhone 15 Pro Max with a different phone number that is associated with an Apple ID. Full-res photos and other features like tapbacks and typing indicators also worked. When the Android phone’s battery died, however, the texts reverted to green bubbles and did not make it to Beeper’s app — they went to Google Messages instead.\nThe company is also hoping to gain trust by building in public, with 50-plus projects that it’s published to GitHub with the open source code that goes into the app. Plus, the founders themselves are known individuals with a history of building promising tech, including the Pebble smartwatch.\nFounded in 2020, Beeper comes from former Y Combinator partner Eric Migicovsky and CTO Brad Murray, previously of wholesale marketplace startup Faire and Fitbit. The co-founders met at Pebble, the smartwatch company Migicovsky founded, building out the hardware brand that was later acquired by Fitbit.\nMigicovsky said he was inspired to build Beeper out of a personal need as a lifelong Android user.\nInitially, Beeper launched a multi-network chat app that supported around 15 different networks, including WhatsApp, Messenger, Telegram, Signal, Slack, Instagram, LinkedIn, Discord, Google Chat, Android SMS, iMessage and others.\n“Until I started Beeper, I didn’t really understand this whole iMessage thing. I didn’t really understand why people loved it so much,” Migicovsky says. “I think one of the reasons is that it’s so deeply built into iOS, that it’s second nature for you as an iPhone user. When you want to get in touch with someone, you open the Messages app.”\nHis experience with messaging had differed, though, having lived in Europe and Asia at times, where he collected friends across a wider network of applications. He didn’t understand the draw that iMessage had in the U.S. in particular, as he was simply left out of friends’ iMessage chats for being the friend with a green bubble.\nThe original Beeper app had 50,000 sign-ups in the first week and now has around 100,000 testers in a closed beta. That app, which spans mobile and desktop, supports RCS (via Beeper’s open source bridge). Beeper Mini will be able to send and receive SMS and RCS soon. The earlier Beeper will now transition to become rebranded as “Beeper Cloud” as the iMessage-only Beeper Mini goes to launch. Over time, Beeper Mini will add the other networks back into the platform, as well as SMS and RCS, and Beeper Cloud will be sunset. At that point, Beeper Mini will become known as just Beeper once again.\nBeeper Mini is competitively priced at $1.99 per month, with a seven-day free trial, compared with $15 per month for the recently acquired competitor Texts.com bought by Automattic. The startup says that it’s able to keep costs down by targeting a wider market that includes Android, iPhone, Mac, Windows and Linux.\nHowever, Beeper also has venture capital to lean on, with $16 million raised to date through its Series A, led by Garry Tan of Initialized Capital, now president and CEO at Y Combinator. Other backers include SV Angel, Samsung Next, Liquid2 Ventures, Niv Dror from Shrug Capital, Kevin Mahaffey and others. Beeper is a 25-person distributed team, while Migicovsky is based in Palo Alto.\nAsked if Samsung’s investment means the company could be interested in a later acquisition, Migicovsky only responded “no comment.”\n“They have been very supportive,” he added.\nBeeper Mini is available to the public today on Google Play Store.\nAdditional reporting by Zack Whittaker.\nCorrection, 12\/5\/23, 2:55 PM ET: the price of Beeper Mini was listed incorrectly in one part of the article. It’s $1.99\/mo, not $2.99\/mo; 12\/6\/23, 2:33 PM ET added “[sent it]” to clarify that the Beeper app does not look like an iPhone app.\n\nThis article, authored by Sarah Perez, was published by TechCrunch on 2023-12-05 under the category 'technology'.\n\n","id":540}
{"title":"Ange aghast as Spurs suffer ‘unbelievable’ West Ham turnaround – with two of the worst goals you’ll see","context":"## Ange aghast as Spurs suffer ‘unbelievable’ West Ham turnaround – with two of the worst goals you’ll see\n\nSpurs have fallen to their fourth defeat in five with a 2-1 reverse at home to West Ham – and they only have themselves to blame.\nAnge Postecoglou’s men were sitting pretty at 1-0 up thanks to an early Cristian Romero header, then missed a host of chances to extend their lead against a Hammers side who couldn’t get out of their own end.\nYet after spurning their own opportunities, Tottenham presented two gift-wrapped chances to their opponents.\nFacebook Twitter Whatsapp Reddit Email Share\nTheir defence was nowhere to be seen as Mohammed Kudus was able to shoot, with his effort deflecting off two Spurs players and into the path of Jarrod Bowen to level the scores.\nThen Destiny Udogie’s blind backpass allowed James Ward-Prowse an easy shot on goal, and while he hit the post, the rebound fell perfectly for the midfielder to finish on the rebound.\n“It’s unacceptable,” said captain Heung-Min Son.\n“I think players should take responsibility, this is unacceptable.\nAdvertisement\n“The fans don’t deserve this, especially when you play at home, when you go 1-0 up early on you should play with even more energy but we didn’t, and that’s why we lost.\n“West Ham have always been tough to play against so we knew what was coming.\n“But we were soft, and especially in the Premier League, even when you’re winning 2-0, 3-0, you don’t know what’s going to happen in the end. 1-0 is not enough, you have to try to kill the game.”\nThe coach wasn’t quite as damning, but still described the showing as poor.\n“It’s another game where we’ve dominated a game of football but we haven’t taken advantage,” said Postecoglou.\n“I thought we were poor in both areas with our finishing and also both goals we conceded were terrible.\nThere’s no point in feeling sorry for ourselves, looking for a cuddle anywhere. There’s only one way to change our circumstances and that is to come here on Sunday and put in a performance, not just play good football but go out there and show some conviction about ourselves as a team.\nAdvertisement\n“Sometimes we can disguise how we’re going by playing some nice stuff but like I said from day one, that’s not what I’m about.\n“I want to win and that’s why I came to this football club and that’s the message. We’ve still got a long way to go, I’ve said that from the start, we’re still right at the beginning what we need to create and days like today just give me further evidence and fuel of how much we need to do.”\nJames Ward-Prowse puts West Ham ahead against Tottenham ????\n\nLyenoma Udogie’s back pass to Guglielmo Vicario is short of the mark and Ward-Prowse seizes the moment.\n\nStadium silenced.\n\nLIVE | https:\/\/t.co\/0TogbUnBLK#PL #OptusSport pic.twitter.com\/7h3q96W086 — Optus Sport (@OptusSport) December 7, 2023\nOn Optus Sport, ex-Spurs boss Tim Sherwood tore strips off Spurs.\n“They’re quietly having a bad run, it’s five without a win now,” he said.\n“They’ve led in every game and I’ve said when they take the lead, I wouldn’t say the game is over. It’s not good enough.\n“But they’ve changed. The last three or four years they’ve been watching some dross there but it’s better to watch. It’s game management.\nAdvertisement\n“They go ahead and they’re already winning the game but they try and win it again and again and leave themselves open. Jarrod Bowen was outstanding out there and you can really exploit them. They leave space and they make poor decisions on the ball and it’s costing them at the moment.”\nSpurs had rebounded from three consecutive defeats with a stirring 3-3 draw at Manchester City over the weekend, but are now outside the Champions League qualification spots in fifth place – and level with Manchester United.\n1 – Tottenham are the first side in Premier League history to…\n\n…fail to win five consecutive games despite going 1-0 up in each match.\n\n…lose three consecutive home games despite going up 1-0 up in each match.\n\nSpursy. pic.twitter.com\/DW6mgUVXnW — OptaJoe (@OptaJoe) December 7, 2023\nWest Ham aren’t far behind, with this result lifting them to ninth, just three points back from Spurs.\n“Huge performance because of the quality of the opposition,” said coach David Moyes.\n“We were up against it tonight. We had to dig in. Thankfully we just about scraped it.\n“The quality Tottenham showed in the first half, I don’t know if we touched the ball for eight or nine minutes.\nAdvertisement\n“We gained a bit of confidence once we got some passes. We wanted to get after them a bit more but by the same breath we were cautious about them picking us off.\n“We are a team who can give some of the good teams a bloody nose, we have that in us.”\nDwight McNeil fires Everton into the lead against Newcastle!\n\nKieran Trippier makes the mistake and the Everton man makes him pay.\n\nIt’s a massive goal for the Toffees and Goodison Park goes wild.\n\nLIVE | https:\/\/t.co\/W8Ud2jDSwD#PL #OptusSport pic.twitter.com\/RVSGfbKcKc — Optus Sport (@OptusSport) December 7, 2023\nIn the other match, Everton trounced Newcastle 3-0 to move clear of the relegation zone despite their ten point penalty for financial irregularities.\nThey left it late, with goals from Dwight McNeil, Abdoulaye Doucoure and Brazilian striker Beto enough to down the Magpies.\n“Without those 10 points, we’d be in an amazing position,” said Toffees boss Sean Dyche. “20 points would be amazing relatively to the last two seasons here.\n“We’ll see what the appeal brings. The mentality is key for me, we took a knock but there have been a lot of knocks here over the last couple of years.\nAdvertisement\n“But the team mentality is growing. I can’t emphasise it enough, the commitment to each other and the connection is a powerful thing because I know we’ve got quality.”\nEddie Howe’s side are proving one of the most inconsistent in the league, albeit with a lengthy injury list.\nIn the last month, they have defeated Manchester United, Arsenal and Chelsea – as well as drawing at French heavyweights PSG in the Champions League – but have now lost comfortably to two cellar dwellers in Everton and Bournemouth.\n“We have to do better,” said Howe.\n“There are reasons behind every performance and we have struggled to change players. That is a big miss with the quality of players out. The longer you do it, the harder it gets. I am disappointed, a missed opportunity, we did not grab it.\n“The game was there for us to win in the second half. The first half was even and we had them penned in in the second half. We conceded the first goal and it changed the momentum of the match. Frustrating and a chance missed.”\n\nThis article, authored by Mike Meehall Wood, was published by The Roar | Sports Writers Blog on 2023-12-07 under the category 'sports'.\n\n","id":541}
{"title":"Liverpool enjoy home comforts but Dyche’s Everton offer derby danger | Andy Hunter","context":"## Liverpool enjoy home comforts but Dyche’s Everton offer derby danger | Andy Hunter\n\nThree points off the top, three goals scored in every Premier League home game, a 100% record in all competitions at Anfield, cruising through the Europa League group stage and individuals shining; it is fair to say Liverpool have surpassed the pre-season expectations of a new-look team. It is not unreasonable of Jürgen Klopp, however, to expect much more as the season develops.\n“You saw so many teams here growing in the direction we wanted and all became better step by step or the manager had to go,” said Klopp on the demands of his particular job. “We will try together to get better step by step and show our real face more often than not.”\nThe 243rd edition of the most played derby in English football offers an ideal opportunity for Liverpool to grant Klopp’s request given the one-sided nature of the fixture on his watch, regardless of another early kick-off after an international break playing havoc with preparations. Klopp has lost one of his 17 encounters with Everton, Liverpool one of the past 23 Premier League meetings at Anfield and one of the past 25 league derbies home or away.\nLiverpool’s defensive concerns, heightened by the loss of Andy Robertson for up to three months with a shoulder injury, are offset by the visitors’ troubles in front of goal. A 3-0 defeat of Bournemouth last time out was only the eighth time Everton have scored more than once in a Premier League match in the past 12 months. The overall improvement in Everton’s performance, however, coupled with three wins in the past four games, raises Sean Dyche hopes of capitalising on any post-international fatigue in the opposition ranks. Klopp’s compliments towards Dyche and his local rivals were of the back-handed nature.\n“Everton are in a good moment,” he said. “Burnley in their best moments [under Dyche] were a super-difficult team to play against and you can see that again; it’s similar with different players. We have to be ready for second ball fights, runs in behind, a compact defence. It will be a tough one. Burnley games were always tough. We have to have football understanding, patience, put a proper shift in and take the fight.”\nLast time out, Everton beat Bournemouth 3-0 – only the eighth time in the past 12 months that they have scored more than once in a league game. Photograph: Nigel French\/PA\nWhat Klopp is seeking most of all from Liverpool is consistency throughout the 90-plus minutes of a Premier League game. It was achieved in the commanding 3-0 defeat of an in-form Aston Villa early last month, a performance that carried echoes of Liverpool at their dominant best under Klopp, but other highlights, even in victory, have been interspersed with lapses. The manager believes some instability is inevitable given this summer’s midfield rebuild.\n“Yes it is [a factor] but we’ve also changed between games quite a lot because of the amount of games and we’ve been interrupted by international breaks twice now,” he said. “If it is a more settled team it doesn’t make that much of a difference because we are much more used to each other and that is not the case yet. As a group we have to become consistent but you do it step by step.\n“It is not too long ago that we had the problem of performing on a really high level until we didn’t perform at all any more; we were 1-0 or 2-0 up in a game and all of a sudden we came under pressure. Crazy. We had to learn to control the game. It is all the things that happen with time – there is no shortcut to that. With the signs we showed so far I am absolutely fine but I don’t know the final destination, I can’t even see that yet, but it is not a problem because other teams have similar problems. It is about how quick we can make the steps and that is what we are working on every day but the problem now is how could we work since Brighton [where Liverpool drew 2-2]? We had three, with a goalie, first-team players in training until Wednesday. Tomorrow we have to play with what we did so far but in general you have to gain stability bit by bit.”\nIt has arrived in attack, where Darwin Núñez’s influence has improved considerably since his match-winning cameo for the 10 men of Liverpool at Newcastle. Mohamed Salah has scored or assisted in 14 consecutive Premier League matches and Liverpool could emulate their predecessors from 1980-81 by scoring three or more goals in the opening four home league games. Stopping goals has been the problem, with Liverpool conceding first and cheaply on occasions. Klopp insists he has not built another formidable attack at the expense of a resilient defence; it is just another step Liverpool have to make.\nskip past newsletter promotion Sign up to Football Daily Free daily newsletter Kick off your evenings with the Guardian's take on the world of football Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\nLiverpool manager Jürgen Klopp, pictured during training on Friday, says his side ‘is a very talented group, a creative group … but we have to organise protection’. Photograph: Andrew Powell\/Liverpool FC\/Getty Images\n“I like to build a team from the defensive side,” he said. “I’m not sure it’s possible again nowadays when you’re in the middle of something. Imagine if we kept clean sheets but didn’t create. You have time for these things when you are new [to a club], when things are under average before you come in and you are 14th. Then everyone is happy when you get some results. We are not like that. Our team is not set up like that. We have a really talented group, a creative group in a football sense, and we have to use that. But we have to organise protection. That goes step by step.\n“There are a lot of new things for the boys to consider and that takes time. We had a good pre-season and I loved the steps we made there but the rest we have learned during the season. During the season you are massively influenced by results. The difference when we win a game – and it’s not a problem for me – is I have to make players aware of things that are not right yet. It is a different feeling if you lose or draw a game. It’s been two weeks since we played a football game together so it’s not possible to work by looking at the Brighton game any more. We have to make sure we are ready for this one.”\nAfter the trials at Tottenham and the frustration at Brighton, Klopp needs Liverpool to embrace the intensity of the Merseyside derby when they arrive home.\n\nThis article, authored by Andy Hunter, was published by The Guardian on 2023-10-20 under the category 'sports'.\n\n","id":542}
{"title":"Theatre producer and Everton chairman Kenwright dies","context":"## Theatre producer and Everton chairman Kenwright dies\n\nLast updated on .From the section Everton\nBill Kenwright became Everton chairman in 2004\nEverton chairman Bill Kenwright, an acclaimed West End theatre and film producer, has died at the age of 78.\nKenwright had surgery to remove a cancerous tumour from his liver eight weeks ago.\nHe had been on the board at Everton since 1989, taking over as chairman at Goodison Park in 2004.\nThe Liverpudlian was also one of the UK's most successful theatre producers and played Gordon Clegg in Coronation Street between 1968 and 2012.\nKenwright was awarded a CBE for his services to film and theatre in the 2001 New Years Honours List.\nEverton said it was \"in mourning\" following the death of the club's longest-serving chairman for more than a century.\n\"The club has lost a chairman, a leader, a friend, and an inspiration,\" Everton added.\nOn 12 October, the Premier League club said Kenwright had a cancerous tumour removed from his liver six weeks before.\nEverton said the operation was \"completely successful\", but complications meant Kenwright required a \"prolonged period in an intensive care unit\".\nAnnouncing his death on Tuesday, Kenwright's family said he \"passed away peacefully\" on Monday night \"surrounded by his family and loved ones\".\n\"Bill was driven by his passions and devoted his life to them; his deep love of theatre, film, music and his beloved Everton, and the families they created,\" a family statement read.\n\"He impacted the lives of thousands, whether that be through the launching of careers or his unending loyalty, generosity and unfaltering friendship and support.\"\nIn a multiple award-winning career spanning six decades, Kenwright produced more than 500 West End, Broadway, UK touring and international theatre productions, films and music albums.\n\"We will remember him with huge love and admiration - the shows will of course go on, as he would have wished, and his towering legacy will continue,\" his family added.\nLeading Everton for almost two decades\nKenwright spent 19 seasons as Everton chairman, overseeing 12 finishes inside the Premier League top eight, including fourth place in 2005, while the Merseyside club were also FA Cup finalists in 2009.\nEverton said he had led the club through \"a period of unprecedented change in English football\".\nIn February 2016, Kenwright sold a 49.9% stake in the club to Iranian businessman Farhad Moshiri, who increased his shares to 94% in January 2022.\nBut with the club fighting against relegation last season, an Everton fans' group called for Kenwright to be sacked and said it had \"no confidence\" in him as chairman.\nKenwright and the rest of the board of directors were unable to attend home games last season from January after what the club described as \"threatening correspondence\" was received before a game against Southampton.\nChief executive Denise Barrett-Baxendale, chief finance and strategy officer Grant Ingles and non-executive director Graeme Sharp have all since left their boardroom roles, but Kenwright remained in his post as chairman until his death.\nIn September, owner Moshiri agreed to sell his 94% stake to American investment fund 777 Partners.\nThe club said Kenwright had \"worked hard\" alongside Moshiri \"right up until the day\" of his liver operation to help facilitate the proposed takeover.\nMoshiri said he was \"deeply saddened\" by the death of his \"great friend\".\n\"Bill was a force of nature and he certainly changed my life nearly 10 years ago when he first spoke to me about getting involved with the club he adored,\" said Moshiri.\n\"He told me about this incredible club, a club that not only has history and heritage but was also a beating heart of our community and for that I will always be grateful.\n\"He was a special soul, a man successful in so many different walks of life. We will miss him but never forget him.\"\nFrom the cobbles to the director's box\nKenwright started his career as an actor and landed his breakthrough role in ITV soap opera Coronation Street in 1968 as Gordon, the son of long-serving Rovers Return barmaid Betty.\nHe left Weatherfield the following year, but appeared back on screen with occasional visits over the subsequent decades.\nKenwright also began putting on plays in order to give himself roles and discovered he had an aptitude for pulling the strings behind the scenes.\nHe found big success by staging new productions of two musicals - Willy Russell's Blood Brothers and Andrew Lloyd-Webber and Tim Rice's Joseph and the Amazing Technicolor Dreamcoat - and making them long-running touring hits.\nHe has also staged productions of The Shawshank Redemption, The Exorcist, Cabaret, Evita, Saturday Night Fever and The Sound of Music.\nAmong his current shows, Sir Ian McKellen is starring in Frank and Percy in London, while Twelve Angry Men, Calendar Girls The Musical, Heathers The Musical and Blood Brothers are all on tour.\nDame Judi Dench, Woody Harrelson, Billie Piper, Rob Lowe and Felicity Kendal have also starred in his productions.\nRooney leads tributes to a 'big inspiration'\nWayne Rooney, former Everton and England forward: \"Devastated to hear the sad news about Bill Kenwright. Known Bill since I was young and he's had a huge impact on me as a person and my career. Great man and a big inspiration. Thoughts are with all Bill's family and friends.\"\nJamie Carragher, ex-Liverpool and England defender: \"Really sad news this. A huge Evertonian who served and loved his club to bits. I'll never forget his and Everton's support every year around the Hillsborough memorial. RIP Bill.\"\nAndy Burnham, Mayor of Greater Manchester and Everton fan: \"It does feel like the end of an era, Bill was a big-hearted person. Such generosity and backed so many people that needed help, perhaps people did not see that in the media.\n\"He had a deep love for his club and the city he was from, it is an emotional night.\"\nActor Sir Ian McKellen: \"Like many grateful actors I am in debt to Bill Kenwright for employment. He seemed to have known everyone in the business and to care about them. Yet every chat would veer round to his equal passion - Everton.\"\n\nThis article was published by BBC News - Entertainment & Arts on 2023-10-24 under the category 'entertainment'.\n\n","id":543}
{"title":"NFL DFS picks Week 15: Best sleepers, value players for FanDuel, DraftKings, SuperDraft lineups","context":"## NFL DFS picks Week 15: Best sleepers, value players for FanDuel, DraftKings, SuperDraft lineups\n\nIt's somehow already mid-December, meaning millions of fantasy football owners just reached their respective \"offseason.\" Luckily for those who missed the playoffs, there's Week 15 DFS. We hold the key to consistent daily fantasy success: pinpointing and playing the cheapest sleepers and highest-ceiling value plays each week.\nEvery Tuesday, we scour DraftKings, FanDuel, and SuperDraft for affordable sleepers and under-the-radar value plays that will set you apart from the DFS pack. By finding stud production at modest prices, we allow ourselves plenty of remaining budget to afford elite weekly performers at other roster spots. When our studs and our sleepers hit, we usually win.\nWe do all the leg work for you -- poring over the player pools, like my daughter searching the Target Christmas catalog — then we handpick the most promising sleepers and tell you why they're worth drafting to your next DFS squad. All you have to do is choose your favorites, sit back, and relax.\nWEEK 15 FANTASY ADVICE:\nSleepers | Busts | Projections | Start-sit\nIf daily fantasy was as easy as picking all top-end skill-position players from one week to the next, it would be a lot easier to win the milli-maker. Let's face it, in order to win big, we need to hit on some diamonds in the rough, and in order to afford a CeeDee Lamb ($9,200 on DK), we have to invest in the occasional Demarcus Robinson ($3,600).\nWe have enjoyed consistent success with our DFS sleepers and values all season. Each Tuesday, we share a big list of our hits from the previous week. — with each hit typically netting at least 16-22 fantasy points. Throughout the year, we've been consistently ahead of the game on breakouts like Puka Nacua, Kyren Williams, and Tank Dell, among many others.\nTake a look at our collection of hits from last week:\nPos. Player Wk. 14 Game DK Price Pts QB Baker Mayfield Buccaneers at Falcons $5,300 20.1 QB Russell Wilson Broncos at Chargers $5,800 19.5 QB Gardner Minshew Colts at Bengals $5,400 16.1 RB Joe Mixon Bengals vs. Colts $6,100 21.5 RB Javonte Williams Broncos at Chargers $5,800 18.1 WR Garrett Wilson Jets vs. Texans $5,500 23.1 WR Rashee Rice Chiefs vs. Bills $5,400 19.2 WR Courtland Sutton Broncos at Chargers $6,100 15.2 TE Isaiah Likely Ravens vs. Rams $3,500 19.3 DST Cleveland Browns vs. Jaguars $3,000 12.0\nNow that's what we call a strong week! We averaged over 19 DK points per position player and 18.4 per position while spending just under $5,200 per pick. Rostering that kind of cheap production allowed us to find consistent weekly studs at other positions while setting us apart from the pack through lineup variance.\nWin BIG with SuperDraft! Get a free $10 deposit when you use promo code \"TSN\"!\nLet's shower, rinse, repeat! This year, we're also incorporating SuperDraft into our weekly DFS column. For those unfamiliar, SuperDraft's DFS scoring involves point multipliers as opposed to traditional salary-capped or tiered contests. A winning lineup will likely feature a strong mix of stud fantasy contributors with 1x-1.6x boosts, as well as matchup-based sleepers with larger multipliers. Each player is assigned a scoring multiplier based on their value as determined by SuperDraft. So, the sleepers who carry lower salaries in DK\/FD have higher boosts on SD. The best part: SuperDraft users can roster any player with no restrictions.\nMORE SUPERDRAFT DFS: How to play SuperDraft\nNow, to our picks. Below we will reveal our Week 15 DFS sleepers and values at each position. Good luck, have fun, and enjoy what will undoubtedly be another wild week!\nAll player values are from DraftKings, FanDuel, and SuperDraft. All stats are from NFL.com and Pro Football Reference.\nNFL DFS Picks Week 15: QB sleepers, values for DraftKings, FanDuel, SuperDraft\nBrock Purdy, 49ers at Cardinals (DK: $6,800 | FD: $8,400 | SD: 1.2x)\nWe usually don't feature players with salaries higher than $6,200 on DK and $8,000 on FD, but $6,800 on DK just seems like a massive value for the MVP frontrunner. Purdy has been scorching, with 57.9 DK points over San Francisco's past two games and at least 23.8 in five of the Niners' past six. The Cards rank among the 10 most generous defenses to QBs on DK, so we're all over the young gunslinger in the desert this weekend.\nJordan Love, Packers vs. Buccaneers (DK: $6,200 | FD: $8,000 | SD: 1.25x)\nLove and the Packers' pass-catchers have emerged as legit offensive threats over the past month, finally easing the Cheeseheads' anguish over the departure of Aaron Rodgers. Cult hero Tommy DeVito hit the pause button on Green Bay's good times, but it should start rolling again this weekend at home against a miserable Tampa Bay secondary. The Bucs have surrendered the fourth-most FD points and fifth-most DK points to QBs this season, and Plodmaster General AJ Dillon ain't about to crack their strong front-seven. We love Love this weekend, and not just because we're lovers at heart.\nOther solid Week 15 values: Matthew Stafford, Rams vs. Commanders (DK: $6,000 | FD: $7,200 | SD: 1.3x); Derek Carr, Saints vs. Giants (DK: $5,800 | FD: $6,500 | SD: 1.35x); Joe Flacco, Browns vs. Bears (DK: $5,500 | FD: $7,100 | SD: 1.35x); Will Levis, Titans vs. Texans (DK: $5,400 | FD: $6,800 | SD: 1.35x)\nWEEK 15 STANDARD RANKINGS:\nQBs | RBs | WRs | TEs | D\/STs | Kickers\nNFL DFS Picks Week 15: RB sleepers, values for DraftKings, FanDuel, SuperDraft\nDevin Singletary, Texans at Titans (DK: $5,400 | FD: $6,000 | SD: 1.35x)\nWith C.J. Stroud in the league's concussion protocol and Nico Collins (calf) joining Tank Dell (fibula) on the Texans' injury list, Houston suddenly finds itself without many impact skill-position players. Singletary, however, has been pretty damn good and showed us last week that he's the main man over Dameon Pierce in DeMeco Ryans' backfield. He had 13 carries for 65 yards and a TD against the Jets, while Pierce totaled just five touches for seven yards. Don't be scared of Tennessee's run D because it ain't what it used to be under Mike Vrabel. Raheem Mostert and De'Von Achane just posted 35.1 PPR points against the Titans, Chuba Hubbard had 20.2 a few weeks ago, and Rachaad White had 17.8 against them in Week 10.\nAntonio Gibson, Commanders at Rams (DK: $5,200 | FD: $5,600 | SD: 1.4x)\nAaron Donald and friends will be attacking the pocket early and often in pursuit of Sam Howell, who has been sacked 10 more times than any other QB. Dump-offs and screens will be plentiful for Gibson, who comes at a major discount, at least in PPR formats.\nMore solid Week 15 RB values: Ezekiel Elliott, Patriots vs. Chiefs (DK: $5,800 | FD: $6,500 | SD: 1.35x); Jerick McKinnon, Chiefs at Patriots (DK: $5,100 | FD: $5,500 | SD: 1.45x); Jordan Mason, 49ers at Cardinals (DK: $4,600 | FD: $4,200 | SD: 1.6x); Tyler Allgeier, Falcons at Panthers (DK: $4,400 | FD: $5,700 | SD: 1.6x)\nWEEK 15 PPR RANKINGS:\nQBs | RBs | WRs | TEs | D\/STs | Kickers\nNFL DFS Picks Week 15: WR sleepers, values for DraftKings, FanDuel, SuperDraft\nRashee Rice, Chiefs at Patriots (DK: $6,100 | FD: $6,500 | SD: 1.35x)\nWith Isiah Pacheco (shoulder) banged up, Rice seems like Kansas City's best skill-position player this side of Travis Kelce. He's certainly the most sure-handed wideout on the Chiefs (not saying much, but still), and he has electric after-the-catch playmaking ability (which is good, considering Patrick Mahomes has struggled with deep-ball accuracy). The rookie has quietly posted 57.3 PPR points over the past three weeks! Since Bill Belichick's defense typically makes it a point to neutralize the opposition's top threat, which is obviously Kelce this weekend, look for Rice to bust some chunk-yard plays through the screen game and dump-downs.\nRomeo Doubs, Packers vs. Buccaneers (DK: $5,300 | FD: $6,400 | SD: 1.45x)\nDoubs has been one of the more dependable offensive weapons in Green Bay's offense, and Tampa Bay's secondary has been utterly abysmal all season, so we're rolling with the young wideout in a handful of lineups this weekend. Doubs has a good floor, logging 11-plus DK points eight times, and a decent ceiling (at least 18.3 three times). Fire him up in what should be a pass-heavy matchup at Lambeau.\nDemarcus Robinson, Rams vs. Commanders (DK: $3,600 | FD: $5,600 | SD: 1.7x)\nRobinson has become one of Matthew Stafford's most trusted receivers, drawing a 21.8-percent target share over the past two weeks. And the veteran has made the most of his opportunities, collecting seven catches for 101 yards and two TDs during that span. The Commanders are terrible at defending the pass — even worse than they were earlier in the season since they shipped out multiple impact pass-rushers. Washington has surrendered the most FanDuel points and second-most DraftKings points to wide receivers this season. Run DMC into your DFS lineups this weekend.\nMore solid Week 15 WR values: Amari Cooper, Browns vs. Bears (DK: $6,000 | FD: $7,200 | SD: 1.35x); Garrett Wilson, Jets at Dolphins (DK: $5,800 | FD: $6,900 | SD: 1.4x); Brandin Cooks, Cowboys at Bills (DK: $5,200 | FD: $6,300 | SD: 1.45x); A.T. Perry, Saints vs. Giants (DK: $3,500 | FD: $4,700 | SD: 1.7x)\nWEEK 15 DFS:\nDK lineup | FD lineup | Best stacks\nNFL DFS Picks Week 15: TE sleepers, values for DraftKings, FanDuel, SuperDraft\nDavid Njoku, Browns vs. Bears (DK: $4,700 | FD: $6,200 | SD: 1.3x)\nNjoku went nuclear last weekend, catching six of his eight targets from Joe Flacco for 91 yards and two touchdowns. Now he gets a chance for an encore against the Bears, who have surrendered the 10th-most PPR points to tight ends this season. No joke, dude — you can trust Njoku!\nMore solid Week 15 TE values: Logan Thomas, Commanders at Rams (DK: $3,700 | FD: $5,100 | SD: 1.5x); Cade Otton, Buccaneers at Packers (DK: $3,200 | FD: $5,200 | SD: 1.65x); Tucker Kraft, Packers vs. Buccaneers (DK: $3,000 | FD: $4,700 | SD: 1.8x)\nNFL DFS Picks Week 15: D\/ST sleepers, values for DraftKings, FanDuel\nLos Angeles Rams vs. Commanders (DK: $3,100 | FD: $4,300)\nThe Rams got destroyed by MVP candidate Lamar Jackson and the high-flying Ravens in Week 14, but push that out of your memory banks. Before that game, Sean McVay's squad had surrendered 20 or fewer points in four straight contests. Aaron Donald and company also have 17 sacks and six takeaways over their past six games, so they'll be licking their chops looking across the line at Sam Howell this weekend. No QB has more interceptions than Howell, who has also taken 10 more sacks than any other signal-caller this season.\nMore solid Week 15 D\/ST plays: Chicago Bears at Browns (DK: $3,300 | FD: $4,100); New York Jets at Dolphins (DK: $2,700 | FD: $3,600); New England Patriots vs. Chiefs (DK: $2,300 | FD: $3,200)\n\nThis article, authored by Sloan Piva, was published by Sporting News on 2023-12-13 under the category 'sports'.\n\n","id":544}
{"title":"Can anyone survive Fortnite as a job?","context":"## Can anyone survive Fortnite as a job?\n\n“I feel like the majority of my life has been in front of a screen,” Turner “Tfue” Tenney reflected amid tears. A fateful kill against Tyler “Ninja” Blevins back in 2019 had catapulted Tenney to fame, and his audience went on to outgrow that of Twitch’s most mainstream star. Yet in 2022, Fortnite’s golden boy — whose name is synonymous with the battle royale game’s most recognizable character, Jonesy — called it quits. For many, Tenney’s retirement video was a sign of yet another Twitch star grappling with burnout: sad, yet familiar. In essence, though, Tenney walking away from it all cemented the end of an era for the games industry.\nPolygon is celebrating TwitchCon 2023 with a package of stories covering streaming trends and news from the show. Check it out!\nTenney was the real deal, a perfect nexus of undeniable charisma and tenacious talent on display at least eight hours a day for years. But his ascent was a complicated one that reflected many of gaming’s biggest growing pains during the influencer era. Tenney came up as an early Fortnite esports champion; we now know that esports is a bubble that’s burned millions of dollars. Tenney rode a Fortnite wave that raised billions of dollars for Epic Games; a few years later, the publisher laid off 830 of its employees. When Tenney blew up, everyone was salivating over Drake and what his livestream appearance signaled for Twitch’s future; now both the rapper and many of the platform’s stars are better known for promoting gambling over hits. Tenney spurred headlines after joining FaZe Clan, a gaming lifestyle brand so lucrative it was endorsed by celebrities like Snoop Dogg; FaZe Clan is now an infamous penny stock that tried to rip him off, Tenney says.\nWhere all these disasters converge is Twitch, the livestreaming platform that’s home to over 30 million daily viewers. Many would say the writing is on the wall for Twitch, after endless headlines about losing top talent, poor management, bad platform policies, and creator burnout. But the idea that Twitch has lost its way after an ostensible golden era is an easy narrative that misses something much starker. If Twitch is in trouble in 2023, it’s not because things have gotten worse. Everything you’re seeing is the natural progression of an unsustainable system. The prognosis has always been terminal; we’ve just refused to see it because it’s been profitable.\nIt didn’t take long for publishers to see that Twitch could make or break a game. Around 2018, Twitch and its personalities turned Fortnite into a juggernaut so powerful, much of the gaming industry started molding itself in its image. While an approachable aesthetic and surprising gameplay made for good viewing, what kept Fortnite from being a mere fad was the model. Before, content expansions and adjustments could take months, if not years, to hit, and you might have to shell out money to see any of it. Fortnite set a more cutthroat standard: free weekly content updates.\nEpic could swing this ceaseless delivery because the bulk of its profits at the time came from its engine, which many games — including Fortnite’s competitors — license. It was these deep pockets that made Fortnite possible in the first place: The bubbly shooter was initially a flop before Epic perfected the formula. The cadence also let Epic quickly adapt Fortnite to whatever was trending or novel, whether that was Among Us or Splatoon. Much like Roblox, Fortnite became a game that could give you anything — and if Epic didn’t emulate it, the players would.\n“You can’t replicate Fortnite’s growth from, like, the [content creator] standpoint and also definitely from the developer standpoint,” says a Twitch streamer turned game developer who requested anonymity because he isn’t authorized to discuss the popular AAA live-service shooter that he works on.\nThe conditions that made everything possible were unique, yet immaterial to publishers who could only imagine profits. Suddenly, “live service” was everywhere — and games like Overwatch, which couldn’t achieve a similar pace, were posed as disappointments by content creators.\nDoes an average player truly need their favorite game to give them something new, week in and week out? Developers say getting half of their players to actually finish games is unusual and worth celebrating, because the reality is that most people will never finish a game they start. Twenty-two percent of purchased games on Steam are unplayed outright. A number of things affect these percentages, like being a part of a sale or Game Pass, but the statistics still paint a picture. A reported 25% of players between the ages of 18 and 34 enjoy games between three and six hours a week, 28% play two hours or less, and 19% play between 13 to 24 hours or more, according to Statista. As they get older, fans apparently spend less time in games. In the most engaged age group, half of all players only log a couple of hours or so per week in their favorite games.\nA serious Twitch streamer who goes live daily or logs a full workday during their schedule will typically play much, much more than the people who are watching them. Twitch streamers can’t stop; a mere two-day pause might mean losing thousands of paying subscribers. There’s a big incentive to keep up with live-service updates as well. There’s some FOMO involved; while certain events with special prizes happen yearly, other big occasions, like season finales, only happen once. But the numbers don’t lie: Your viewership will definitely be impacted by new patches that float the game in question to Twitch’s front page.\n“Multiplayer games will start decreasing in viewership after the first week as the launch hype dies down and then it’s a question of how good the game is perceived to be that will determine its long term fate,” says StreamElements’ public relations director Chase. “With those in for the long haul, viewership tends to plateau and then spike when new content and patches are released or if it is supported by competitive events.”\nWhile the playing habits of a Twitch streamer don’t represent the average player by any means, content creators certainly shape public opinion about games.\n“Negative sentiment is very profitable,” says the AAA game developer, who noted that social media platforms are built to highlight popular — and sometimes caustic — content. This dynamic sets up an inherent tension between game developers and hardcore players like Twitch streamers, who are not the main audience of most games but are often some of the most visible players.\n“I don’t at all think that streamers are embodying some typical player behaviors, like ‘Brandon,’” the developer continues, posing a name for an imaginary everyday consumer. “There’s definitely a model of consumers nowadays who probably parrot those sentiments. They did not arrive at those conclusions themselves.”\n“There is inherently [a] vicious and negative cycle for everyone involved, for how live service interacts with Twitch as a medium”\nThe misinformation will vary, but Twitch both shapes that discourse while also becoming the very metric that people use to make sense of a game’s situation. It’s gotten so bad that people scrutinize Twitch longevity for single-player games, not just live-service or multiplayer ones.\nAnd so, to keep up with expectations, games as a whole are getting longer — and more expensive. It takes multiple studios to keep yearly live-service franchises like Call of Duty afloat, as noted in the CMA’s report on Activision Blizzard. That same report says that the development budget of a AAA game can range anywhere from $80 million to $380 million, and seasonal updates in particular require anywhere from $50 million to $65 million to produce. For publishers, keeping up with the competition requires nearly as much money as making a big-budget game in the first place. For contrast, a modern Tomb Raider game had a budget between $75 million and $100 million, not counting marketing costs.\nMarketing by itself has eye-popping numbers as well: A 2018 report noted that the marketing budgets alone for some titles can equal 75% to 100% of what was spent on development, effectively doubling the total production cost. The channels publishers will pursue are varied, but Twitch streamers command a percentage of it. In recent years, we’ve seen a shift toward personality-based promotion, with more and more publishers eschewing traditional press at launch in favor of coverage they can control. Blevins, by himself, apparently commanded a $1 million payday for streaming Apex Legends, a game that’s popularity can be attributed to its enormous Twitch-focused launch.\nWho can actually compete in the environment all of these conditions have created? Giant publishers who make live-service games, mostly. All 10 of the most-watched games on Twitch in 2022 were live-service games with regular updates. And the cost goes beyond money. As Fortnite took off, developers at Epic Games said that they experienced months of crunch that required 70-to-100-hour weeks to produce that industry-shaping content despite the publisher’s deep pockets. That’s the model that a lot of this hinges on, an egregious work week that often still requires the cheap benefits of outsourcing and contractors who are routinely laid off. Things haven’t changed much since 2019 at some major studios: Diablo 4’s developers say they also underwent crunch to ship the game. Naturally, the action role-playing game had Twitch integration from the jump, and alongside a detailed content roadmap. There’s little incentive for any of this to change, even as big-budget games buckle under their own weight and studios are closing left and right. Not when publishers know that the longer a player is hooked, the more likely it is that they’ll spend money.\nAt this point, live-service games need content creators like Twitch streamers to stay solvent. According to the developer speaking to Polygon, streamers help old games transform into new and visible moments. Developers need live-service games to stay in the conversation, because the base experience can worsen without a persistent player base.\nIt’s “not even from a cost perspective,” the developer says, though obviously more players make profits more viable. “But [if] we don’t have 20,000 players, then matchmaking times are terrible. Or connections will be pretty bad because we can’t mobilize players together in a single match. There’s all these cascading effects.”\nWhile a Twitch streamer’s livelihood depends on having a steady stream of content, the system taxes them, too. Tenney’s goodbye to his fans was a crushing one, because the path that led him there was fueled by lost youth and a dream. Over time, the promise of a dream job — get paid to play games! — became corporatized, and contracts turned things ugly. Tenney said he started feeling trapped, and he didn’t like how much his decisions started being motivated by money. Tenney is hardly alone here now that Twitch has “grown up.”\n“There is inherently [a] vicious and negative cycle for everyone involved, for how live service interacts with Twitch as a medium,” the game developer, who also spent years as a serious Twitch streamer, says. It’s been years, but he says he’s still recovering from the burnout of livestreaming all the time.\n“There [are] these enormous benefits for some people, but there’s also just, like, a lot of it just really grinds you down on both sides of the table,” he said, referring to game developers and Twitch streamers.\nIt was inevitable for things like sleep streams, uncapped subathons, and randomly generated AI shows to materialize on Twitch; content creators feel like they need to keep going, always\nThe burnout phenomenon has been at the forefront of Twitch’s public image, in large part because it doesn’t spare even the most successful creators on the platform. Twitch’s most famous woman, Imane “Pokimane” Anys, started streaming while she was still a teen. Then, it was just a hobby. Nearly a decade later, Anys grew to have one of the most impressive stints on the platform. Late in 2022, however, came a big change. She informed fans she would no longer stream all day, nor would games be her primary focus anymore. Instead, she pivoted to being more of a lifestyle and beauty personality who uploads on short-form platforms like TikTok, if and when she feels like it.\nThe evolution grew from a similar motivation as Tenney’s. In the video where she explains it all, Anys said that during her time as a full-on Twitch streamer, keeping up with the “rat race” often meant playing what was popular while being unable to do “basic human things,” like going grocery shopping. How could she, when streaming all day was the norm and there was always competition around the corner that was younger and more willing to stay live for longer?\nIt was inevitable, then, for things like sleep streams, uncapped subathons, and randomly generated AI shows to materialize on Twitch; content creators feel like they need to keep going, always. Barring that, live-service games are always at the ready. In her sort-of-goodbye video, Anys spoke frankly while quickly scrolling through her entire game history on Twitch. It was all live-service games like League of Legends and Fortnite.\nIn 2011, when Twitch first launched, content creation wasn’t fully a career and people still uploaded their photos to Facebook. Normal, everyday teens weren’t yet decrying the hungry maw of the internet, and the generational shift toward work-life balance hadn’t yet taken hold. Twitch happened at the exact right time, benefiting from a cadre of optimistic young users who grew up on the internet, happy to give away as much of themselves as they could. They didn’t even realize it was happening, in many cases, and they couldn’t imagine the unsustainable system it would go on to create. People were just having fun.\nThings have changed since then. Twitch has crowned millionaires, like Félix “xQc” Lengyel, who wear thick diamond chains around their necks while streaming. At the same time, viewership is dropping after years of platform growth that was partially bolstered by the COVID-19 pandemic, all while top creators are streaming less. The gaming industry, which likes to boast about how much money it makes in comparison to other forms of entertainment, is laying off workers nearly every week at top studios. Meanwhile, the overall gaming market is shrinking. The cracks in the system that produces and promotes big-budget games are getting hard to ignore.\n“I wouldn’t trade it for the world,” Tenney said in his goodbye video, which is overflowing with footage of esports casters and viewers in awe of his Fortnite plays.\n“I’ve been doing this since I was a kid, man,” he continued, shaking his head. “I feel like my childhood and even some of my adulthood kind of flushed away. I feel like this is the end of the journey, man.”\n\nThis article, authored by Patricia Hernandez, was published by Polygon on 2023-10-19 under the category 'entertainment'.\n\n","id":545}
{"title":"Manchester United out of Europe after defeat to Bayern Munich","context":"## Manchester United out of Europe after defeat to Bayern Munich\n\nSign up to Miguel Delaney’s Reading the Game newsletter sent straight to your inbox for free Sign up to Miguel’s Delaney’s free weekly newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nFootball email {{ #verifyErrors }} {{ message }} {{ \/verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ \/verifyErrors }}\nAnother infamous European night at Old Trafford. It should be a landmark low, but almost the most deflating element of this 1-0 defeat to Bayern Munich was how grimly routine it all felt.\nManchester United, one of the grandest and richest names in this competition, have again gone out of the Champions League at the group stage. It is the third time it has happened since Sir Alex Ferguson, meaning it’s their most common round of exit in that period.\nThe performance this season was so bad that they find themselves out of Europe altogether as the bottom team in the group, although some at the club might find solace from that. There wasn’t much else. The second place they aimed for has instead gone to Copenhagen, a club with a fraction of United’s budget. That is where the damage was done.\nWhile that meant there was only ever a slim hope of going through – and the Danish side’s victory over Galatasaray ensured any win would be irrelevant – the club’s rich legacy in this competition was built on such defiance. There was absolutely none of it here.\nThere was nothing much at all. Where was the energy? Where was the intensity? The Stretford End eventually implored United to “attack attack attack” but the complete absence of any such impulses eventually left some of the stadium booing the side off at the end.\nWith United out of Europe, there are questions about Erik ten Hag’s ability to coach the team (AFP via Getty Images)\nThese are not the sounds we are used to hearing after that Champions League theme. Something does stir when the anthem is played at Old Trafford amid the lights. Well, for most, that is, except the players.\nThis is why there are growing questions for Erik ten Hag himself, even if everyone is constantly keen to put it in a wider context.\nManchester United should not be performing like this on what is supposed to be the classic European night at Old Trafford. This just reminded that all they are going to have for some time are their memories.\nIt was another utterly forgettable display.\nBayern, already through but perhaps looking to make a point after their own 5-1 defeat to Eintracht Frankfurt, didn’t even need to step it up to win. They were quite low-intensity themselves, Kingsley Coman’s winning goal coming from the forward almost walking through the middle of their team. Harry Kane, for so long billed as a potential United player, didn’t score but did set it up.\nThis game showed one reason why he is at Germany’s biggest club rather than England’s. His side are through with ease, among the favourites for the competition even if they do look lacking in a few areas.\nHarry Kane’s assist was another reminder of what could have been for United (PA)\nNot that you could judge from this game. It was almost a kickabout for them.\nBayern were still having more of the ball and the attacks. This was another tension for Ten Hag to overcome on the night. United were playing in quite a controlled way when they were going to eventually have to go for it, but Bayern were still getting through that with relative ease.\nIt meant the team almost looked like they were in two minds, to go with how thoughts were always going to be in Copenhagen. The news came through shortly before the hour that Lukas Lerager had scored for the Danish side, although it didn’t really change the atmosphere or the energy. It was already a drab game, with a muted crowd.\nIt didn’t help that Bruno Fernandes blazed United’s best opportunity over the bar after good work from Aaron Wan Bissaka. It looked like it was going to be one of those games. It certainly wasn’t one of those big European nights at Old Trafford.\nOn 71 minutes, Bayern managed what they had been half-heartedly threatening all game. They also did it at near walking pace. Kingsley Coman had weaved his way through the centre, for the ball to eventually be worked to Harry Kane. The English forward clipped an artful ball back through for Coman who finished emphatically.\nKingsley Coman’s goal ensured Manchester United were knocked out of Europe (PA)\nIt was almost too easy for him. Why did Andre Onana stay so close to his line? If that sounds like the set-up for a joke… well, you can write your own punchline.\nThis is the current reality for United. They obviously have many more issues than the goalkeeper – as illustrated by the goal itself – but a strange season for Ten Hag’s primary signing only continues. United’s problems meanwhile combined. There were so many errors leading to the goal, to go with all of those that have characterised this entire European campaign.\nThat can now be talked about definitively, since it has been decisively ended. It is a low but just part of a decade of disappointment in the competition that has seen this club rise to its most emotional heights.\nThis game never threatened to do that. United never threatened at all. They’d been involved in so many ludicrously chaotic matches that the biggest of all ended up being a non-event.\n\nThis article, authored by Simon Peach, was published by The Independent - Sports on 2023-12-12 under the category 'sports'.\n\n","id":546}
{"title":"What’s up with Tesla’s Cybertruck? Everything to know about much-hyped electric pickup","context":"## What’s up with Tesla’s Cybertruck? Everything to know about much-hyped electric pickup\n\nWhat’s up with Tesla’s Cybertruck? Everything to know about the much-hyped electric pickup\nAfter four years, the long-awaited launch of the Tesla Cybertruck electric pickup has come and gone.\nThe boxy vehicle is Tesla’s first new model since 2020, when it started delivering the Model Y. Yet, Cybertruck’s initial debut predates that moment; Tesla CEO Elon Musk showed off an early version of the pickup at a memorable 2019 event, when it accidentally smashed two windows while attempting to demonstrate Cybertruck’s durability.\nHere we’ll answer some questions we figured a brave explorer such as yourself might ask (err… type in a search bar) about Tesla’s Cybertruck, including details on the vehicle’s specs, availability and design of the vehicle. The first deliveries, in which about 10 high-profile customers like Reddit co-founder Alexis Ohanian took possession of the truck, occurred November 30 at the Tesla Gigafactory in Austin.\nWhile we have lots of details it’s still unclear if the Cybertruck will kick off the vehicle’s journey toward success, or failure.\nWhat is the Cybertruck?\nThe Cybertruck is a steel-clad electric pickup truck made by Tesla. According to Musk, the vehicle measures fewer than 19 feet long and features a bed longer than six feet. It has four doors and room for six adults.\nTesla shared Cybertruck specs in 2019, promising three variants of the vehicle. That included a $39,900 single-motor version with rear-wheel drive and a 250-mile range. But this was eons ago, figuratively speaking. At least one variant is reported to weigh about as much as a Hummer.\nTesla is planning to offer three variants of the Cybertruck, but the prices, range and other specs have changed since 2019.\nThe cheapest Cybertruck, a single-motor rear-wheel version with 250 miles of range, a 6.9-second zero to 60 miles per hour acceleration rate, won’t be available until 2025. The all-wheel drive variant has an estimated 340-mile range and top speed of 112 mph.\nThe third variant, called the Cyberbeast, has three motors that delivers 845 horsepower, a 2.6-second 0 to 60 mph acceleration rate and a top speed of 130 mph. The Cyberbeast has an estimated 320-mile range and $99,990 price tag. Both of the all-wheel drive and Cyberbeast versions have a claimed towing capacity of 11,000 pounds.\nThe company is also going to offer a range extender that will push the all-wheel drive version to an estimated 470 miles and the Cyberbeast to more than 440 miles of range. After the event, Musk took to X, formerly Twitter, to give a few more details about this add on. He said the range extender will be an “optional pack that fits in about 1\/3 of the truck bed. Still room for plenty of cargo. It’s meant for very long trips or towing heavy things up mountains.”\nWhy does the Cybertruck look like that?\nAlso referred to as Cybrtrk in an early trademark, the Cybertruck’s name, neon logo and exterior evoke a sort of cyberpunk, post-apocalyptic aesthetic. Why? Because Musk wants it to.\nThe electric pickup is made of steel, a tough material that resists rust but is hard to shape. The material’s rigidity influenced the EV’s starkly geometric design; it also led to launch delays and panel gaps on Cybertruck test vehicles.\nMusk has described the tank-like vehicle as “an armored personnel carrier from the future — what Bladerunner would have driven.” Crucially, while Bladerunner is a stunning film, it depicts a horrific dystopia.\nIs the Cybertruck for sale yet?\nTesla expects to mass produce Cybertrucks starting in 2024, but unless you’re a wealthy early adopter with special Tesla connections, securing a Cybertruck won’t be easy early on. You’ll need to get in line behind the folks who reserved the truck as far back as 2019.\nThat said, you may be able to jump ahead for a price: Apparently, Cybertruck reservations have appeared on eBay for $10,000. Proceed with caution. I’m not sure how easy it’d be to verify if the offers are legit, and Musk has threatened to punish resellers in the past.\nThe Cybertruck price tags varies depending on the variant and add ons. The tl;dr is that all of the considerably prices are higher than advertised back in 2019. The rear-wheel version — which, reminder isn’t available until 2025 — starts at $60,990. The all-wheel drive version has a $79,990 starting price and the Cyberbeast comes in just shy of $100,000.\nThe federal tax credit for EVs has a number of eligibility requirements including price. Under current rules, the trucks and SUVs priced above $80,000 don’t qualify for the $7,500 credit.\nCan I resell my Cybertruck?\nTesla indeed threatened to punish early Cybertruck resellers, but it seemed to walk back its previously published rules in a November 2023 update to its U.S. order agreement page. The rules once stated that Cybertruck customers couldn’t sell their vehicles during their first year of ownership without permission from Tesla. The rules also said the company would seek $50,000 in damages from early resellers. But such language is gone from that particular page, at least for now.\nCan I fit a bike in a Cybertruck’s bed?\nThat depends on the size of the bike and how you store it. From what we can tell, you’ll probably need one wheel hanging over the tailgate.\nElon Musk has promised that Cybertrucks will feature beds longer than six feet. The truck bed in the production version is six-feet and slightly longer with the tailgate down. From the end of one wheel to the opposite end of the other, adult bicycles are typically longer than six feet. (On a related note, the city of Los Angeles recommends bicycle parking spaces be a minimum of six feet long, as does South Carolina’s Palmetto Cycling Coalition. Regardless, it’s a tight fit.)\nA motorcycle would probably be trickier. This isn’t a Silverado.\nIs the Cybertruck good for the climate?\nGenerally speaking, electric vehicles are better for the climate than their gas-guzzling counterparts, because they don’t have tailpipe emissions. Still, all cars are pollutive. That includes consumer EVs, since they require lithium, release tire particles into the air and demand more energy than more efficient means of getting around, such as public transit, cycling and walking. Battery material mining is also linked to worker exploitation.\nWhat about the Cybertruck’s size? Experts have raised red flags over the ballooning size and weight of vehicles in the U.S. Extra-large vehicles typically require more energy, and thus more battery materials, which drives up their environmental cost. As far as collisions go, bigger and heavier vehicles are less safe for everyone around them, especially pedestrians.\nAmong EVs, vehicles with smaller batteries are generally better for the environment.\nStay tuned\nWe have a lot more questions and we expect Tesla to share more details during its November 30 delivery event. How does the Cybertruck compare to other Teslas? What about electric pickups from the competition, including Ford or GMC? When will Tesla release the cheaper, single-motor Cybertruck variant it promised back in 2019? Check back for updates as we learn more.\n\nThis article, authored by Harri Weber, was published by TechCrunch on 2023-11-30 under the category 'technology'.\n\n","id":547}
{"title":"If the Cybertruck is deadly for pedestrians, it’s because all large trucks are","context":"## If the Cybertruck is deadly for pedestrians, it’s because all large trucks are\n\nThe Tesla Cybertruck has been out for a little more than a week, and already people are ready to declare it a safety nightmare.\n“Guideless missile” and “death machine” are some of the loaded phrases being tossed around. Safety experts are “raising concerns” about the truck’s crumple zones (or lack thereof). TikTok and other social platforms are abound with videos highlighting the poor sight lines and lack of visibility for drivers and passengers.\nBut if the Cybertruck is particularly deadly for pedestrians, cyclists, and other vulnerable road users, it’s because it’s a large truck in America in the year 2023. We have lots of data that shows that America’s favorite type of vehicle is also one of the most deadly. We have very little data about the Cybertruck in particular, because it’s only been out for a couple weeks and in extremely limited quantities.\nBut if the Cybertruck is particularly deadly for pedestrians, cyclists, and other vulnerable road users, it’s because it’s a large truck in America in the year 2023\nWe need more data — and testing — before we know more about the specific dangers posed by this sharply angled, stainless steel contraption. And right now, neither the National Highway Traffic Safety Administration (NHTSA) nor the Insurance Institute for Highway Safety (IIHS) — two independent bodies that test new vehicles — have any plans to conduct crash safety tests with the Cybertruck.\nAll trucks are dangerous\nBut based on the specs we know, we can certainly draw some conclusions about the Cybertruck. Like other trucks in its segment, the Cybertruck is heavy, high-riding, very quick, and likely to be extremely deadly to anyone unlucky enough to stumble into its path.\nLast month, IIHS released a study confirming much of what we already know: trucks and SUVs with tall, flat fronts and high hoods are more deadly for pedestrians than more compact vehicles.\n“Tall front ends increase risk,” Raul Arbelaez, VP of the IIHS Vehicle Research Center, says. “For medium height vehicles, blocky or blunt shaped front ends also increase risk. A higher point of impact increases risk for cyclists.”\nThese characteristics are not unique to the Cybertruck. Trucks from Ford, GM, Toyota, Ram, and others are also extremely deadly to pedestrians. EV trucks, in particular, are more deadly due to their increased weight from the battery. And yet, for some reason, you don’t see as many media stories calling out, for example, the F-150 Lightning or Rivian R1T or Chevy Silverado EV.\n“Vehicle weight in our fleet has continued to go up over the past 20 years,” Arbelaez says. “Electrification is taking weight increases to another level that will lead to dangerous outcomes.”\nWe need more data\nDespite these conclusions, Arbelaez and other safety experts are taking a wait-and-see approach to the Cybertruck. “We haven’t had an opportunity to measure the front-end of the Cybertruck, so we don’t know how it will compare to other pickups or SUVs,” he says.\nA spokesperson for Consumer Reports says the same thing: “We’re going to wait for more data,” citing the need for independent testing data from NHTSA and IIHS.\nTesla conducted its own crash tests with the Cybertruck in-house, videos from which were shown during the delivery event last month. But NHTSA has yet to perform its own. In the US, car companies “self certify” that their vehicles comply with federal safety standards requiring everything from sideview mirrors to airbags to automatic emergency braking. There is no “pre-approval” before an automaker is allowed to sell its cars to the public.\n“We’re going to wait for more data.”\nThis allows Tesla to sell cars with driver assist systems that safety experts say put drivers and pedestrians at risk. And it allows it to sell a truck made from stainless steel and no rounded edges. The Cybertruck “meets the performance criteria” for standards like lane departure warnings and dynamic brake support, according to the NHTSA website. But there is no five-star safety rating, and the Cybertruck wasn’t mentioned in the agency’s list of vehicles it will crash test for 2024.\nCrumple zones, or lack thereof\nSo far, the aforementioned crash test videos featured by Tesla during its delivery event have been the focus of the most questions, with many focusing on the truck’s crumple zones, or lack thereof.\nThe crumple zone is the area of a vehicle that is designed to crush or crumple upon impact. Often located in the front of a vehicle, the crumple zone will absorb some of the impact of a crash, protecting the driver and other occupants.\nBy absorbing and dissipating energy, crumple zones help to prevent or reduce injuries to the occupants of the vehicle during a collision. A stiffer vehicle, perhaps one made from stainless steel, could complicate this process.\nThere are other design choices that make the Cybertruck a troubling addition to our roads.\nThere are other design choices that make the Cybertruck a troubling addition to our roads. While the hood is sloped, the corner blind spots appear to be dangerous. Tesla added cameras to compensate for these blind spots, but it’s unclear what a driver will actually be able to see. The steering is digital not mechanical (“steering by wire”), sideview mirrors can be removed, and there is no rearview mirror at all — the only way to see what’s on the side or behind is via the center console screen that’s also the instrument panel, GPS mapping, Bluetooth controls, and radio. The exterior is “bullet-proof” steel with hardened Gorilla glass windows.\nBut again, all we have is a couple of videos. What we need is data, independently verified, before we can say definitively that this truck will cause mass death and destruction. Safety experts quoted by Reuters acknowledge there may be some shock-absorbent mechanism that makes up for the apparent lack of crumple zones. We just don’t know yet.\nElon Musk is “highly confident” that the Cybertruck will be safer than other trucks on the road for occupants and pedestrians. Tesla has historically achieved high safety ratings thanks to its underlying architecture, which makes the car more rigid and better protects passengers. The location of the battery in the floor of the vehicle also gives the Model Y and other Tesla vehicles a lower center of gravity, which improves road stability and decreases the chances of a rollover. All four of Tesla’s vehicles, the Model S, X, 3, and Y, have earned five-star ratings from Euro NCAP.\nBut the Cybertruck is a truck, and trucks are historically a nightmare for pedestrian safety. The same goes for every Ford, GMC, Hummer, and Ram truck on the road today. The underlying issues of weight, height, and dimensions are what have contributed to the current crisis in pedestrian safety, in which more people are dying on the road than any time in the last 40 years.\nThe Cybertruck is unlikely to be sold in Europe, which has a much higher bar for pedestrian safety than the US. One of Tesla’s lead designers said as much in an interview with TopGear Netherlands, blaming the inflexible stainless steel exterior.\n\nThis article, authored by Andrew J. Hawkins, was published by The Verge on 2023-12-12 under the category 'technology'.\n\n","id":548}
{"title":"Fortnite is the latest game to entice players with a portal to the past","context":"## Fortnite is the latest game to entice players with a portal to the past\n\nFortnite is the latest game to entice players with a portal to the past From Fortnite and WoW to Zelda and Mario, gaming is all about nostalgia right now\nThere’s a massive appetite for nostalgia in entertainment right now, and one of gaming’s cultural juggernauts wants to cash in.\nFortnite maker Epic Games announced Friday that the game’s next season would return to its original map from the multiplayer shooter’s very earliest days. Epic teased the return “back to Chapter 1” on its X account, but hinted that some more modern in-game mobility perks like sprinting would stick around even as the game turns the clock back come November 3. From the “Ws” in the replies, Fortnite’s community sounds very on board with the news.\nSprint (or Mantle, your choice) back to Chapter 1….see you soon 11.3.2023. #FortniteOG pic.twitter.com\/4LnTksppRp — Fortnite (@FortniteGame) October 27, 2023\nEpic’s re-launch of Chapter 1 comes with more fanfare than your average Fortnite season. Ninja, aka Tyler Blevins, one of the first streaming superstars and still among the most popular, promoted the new content by showcasing a giant replica of one of the game’s iconic Durr Burgers in his backyard. Other classic Fortnite streaming stars got the same treatment.\nWoke up to find the OG Fortnite is coming back November 3rd AND THERES A BURGER IN MY BACKYARD https:\/\/t.co\/QC3Dpr8MTr lets talk about it pic.twitter.com\/E855hGHBoN — Ninja (@Ninja) October 27, 2023\nTHERE IS NO WAY FORTNITE SENT ME THIS 🤣@FortniteGame pic.twitter.com\/TmBvevl8aQ — timthetatman👑 (@timthetatman) October 27, 2023\nFor the uninitiated, Fortnite is a battle royale-style third-person shooter where 100 players swarm a massive but shrinking virtual island with the goal of being the last man standing. In the process they generally engage in myriad well-animated virtual antics as the game has become wackier and more elaborate over time, all while dressed in custom skins you earn by playing or purchase in Epic’s lucrative virtual swag shop.\nIn its heyday, Fortnite was about as ubiquitous and popular as a game can be. Streaming gameplay routinely drew hundreds of thousands of viewers on Twitch, where a cottage industry of pro Fortnite players emerged, all laser-focused on Epic’s polished battle royale. Epic keeps its metrics under wraps, but back in 2020 the game had more registered players than the population of the United States.\nEpic’s hit game has both imported and exported popular culture since its launch in 2017. Like other live service online games, Fortnite releases new content every three-ish months, refreshing the destinations scattered across its cartoony island locale, changing the rules of physics and generally adding additional mayhem, often in the form of weapons.\nThose seasons are punctuated by flashy concerts and pop culture tie-ins, like a psychedelic Ariana Grande show, an in-game lightsaber fight with Darth Vader or the appearance of Dragon Ball Z’s Goku as an in-game skin. The massive online shop for skins and other character customizations betrays Epic’s loftier aspirations of building an interconnected virtual online world — a kind of metaverse, if you will.\nIn Fortnite, the map is everything. A bad map can ruin a chapter and players often wax nostalgic about in-game locales — usually alliterative hotspots with names like Tilted Towers or Loot Lake. Without a clear glimpse into what Fortnite’s player base looks like these days, it’s tough to know why Epic would decide to go retro and bring the game back to an older save state.\nIn 2023, Fortnite is far from dead. The game is still very popular, even if it’s not clear exactly how popular. But if Fortnite was once lightning in a bottle, between other free-to-play rivals like Apex Legends, Call of Duty: Warzone and others, that bottle is a lot more crowded these days.\nNostalgia sells in 2023\nEpic’s decision to turn back the clock might seem small to anyone who hasn’t dropped in off the Battle Bus, but it’s an interesting reflection of the state of gaming right now. Games — and gamers’ tastes — are increasingly following the wider entertainment trend of digging up familiar stories and repackaging them.\nGame developers seemed to believe for a time that cutting-edge graphics and hyper-realism were what consumers really wanted, but gamers’ appetites have trended toward retro visuals, nostalgia and familiar game worlds more and more. That lower bar for visual fidelity also opens the doors for inventive indie games that don’t rely on big budgets to shine, but the world’s biggest game developers are riding the wave too.\nThis year’s hit new Zelda game Tears of the Kingdom literally built a new game on top of the old one and remains a strong contender for Game of the Year. Competition is stiff though, more so now that Nintendo just casually dropped Super Mario Bros. Wonder, the first two-dimensional side-scrolling Mario game in more than a decade — another portal to the past given its departure from a long string of recent 3D Super Mario titles.\nSquare Enix was so confident in its remake of the 1997 Japanese roleplaying mega-hit Final Fantasy VII that the reimagined version of the game comprises three standalone full-length games, each spaced a few years apart.\nWorld of Warcraft paved the way\nFortnite’s experiment to bring players back into the fold by relaunching an original version of the game will be interesting to watch, but it isn’t a first. World of Warcraft, the fantasy roleplaying game once synonymous with online gaming, did something similar just a few years ago. Blizzard Entertainment, which developed the massively multiplayer online game (MMO), launched World of Warcraft Classic back in 2019, even as a modern version of the game remained online and playable.\nElizabeth Harper, editorial director of the longtime dedicated World of Warcraft news site Blizzard Watch, told TechCrunch that Blizzard actually reluctantly launched the old-school version of its game in response to demands from its own community.\n“Before WoW Classic originally launched, third parties were already running their own versions of ‘classic’ servers,” Harper said. “Game mechanics and class balance were extremely different then, and there was a lot of nostalgia for the community that existed back in the day.”\nWhile Fortnite players, like WoW players, have a ton of nostalgia for the older version of the game, its maps were comparably simple and difficult to traverse. For players accustomed to gaming’s modern quality of life improvements, old games can feel sparse and clunky if not reimagined outright.\n“WoW Classic has been a runaway success, and fans can’t get enough of re-releases of classic content, devouring each expansion and raid tier as they’re rolled out. However, the WoW Classic team’s philosophy has evolved since it was released: [Blizzard] initially was very serious about releasing the game without any changes, but these days the team feels that some changes need to be made,” Harper said.\n“I’m not an expert in Fortnite, but a smart game developer will pay close attention to the features that spark that nostalgic joy and keep those in the forefront, while considering retaining modern conveniences that players appreciate.”\nEpic hasn’t shown its full hand for the new-old version of its own game, but it does sound like some of Fortnite’s quality of life improvements will be sticking around, including sprinting and “mantling,” a parkour-like move that lets players climb over obstacles. In recent years, Epic has sprinkled all sorts of zany mobility options onto its map, letting players fall through the sky, pilot biplanes or (our personal preference) roll in a giant hamster ball to get around faster.\n“With MMOs, it’s easier than ever for gaming experiences to be lost completely to time. New versions overwrite old versions, making original games inaccessible,” Harper said.\n“World of Warcraft will be 19 years old in November, and practically every feature and zone the game launched with has been remade in the years since…. It’s a ship of Theseus.”\nMuch like the revolutions of a giant oversized hamster hurtling down from Fortnite’s rave cave, gaming’s nostalgia cycles are speeding up, with relaunches and remakes coming on quick. World of Warcraft Classic recreated a 15-year-old version of the game, but Fortnite’s own blast from the past seeks to capture the magic of a relatively very recently bygone era.\n“Nostalgia sells, but it only sells because there’s demand. Gamers want to go back and revisit their favorite games as they originally were, and I think developers who re-release games are developers who pay attention to their communities,” Harper said.\n“Sure, there’s a cynical side to this: game companies are in it to make money. But if we didn’t love these classic games, they wouldn’t be nearly as popular as they are.”\n\nThis article, authored by Taylor Hatmaker, was published by TechCrunch on 2023-10-30 under the category 'technology'.\n\n","id":549}
{"title":"VTubers have reached their inevitable conclusion","context":"## VTubers have reached their inevitable conclusion\n\nTwitch has always allowed for various forms of expression, so it was no surprise when VTubing found a home on the platform, quickly gaining popularity among English-speaking audiences in 2019. Since then, the novelty of avatar-based content may have worn off, but the format has stuck around. And VTubing agencies, which continue to introduce new talents and offer one of the more financially secure methods of pursuing this sort of content, are still holding on in an attempt to harness new talent.\nVTubing exploded onto the wider North American and European markets when Cover Corporation launched the English branch of Hololive Production in 2020. Hololive’s English debut saw the introduction of long-standing talents in the English community, such as the extremely popular Gawr Gura (the most subscribed-to Hololive talent to date) and Ninomae Ina’nis. Even high-profile content creators like Pokimane pivoted toward using digital avatars weeks after Hololive’s first generation of English talents debuted. Brands, too: Remember the Tony the Tiger VTuber in August of 2022?\nMany creators that jumped on the trend have since stopped using their avatars, but at the start of the COVID-19 pandemic, there was a large increase in VTubers on Twitch and other streaming platforms, like YouTube, as models and equipment became more accessible to the general public. Twitch has since gone on to highlight a wide variety of VTubers through its VTuber Takeover promotion, which most recently ran in August. Twitch also reported that VTubing-related content on the platform shot up by some 350% between January and August 2022. Despite this, some have argued that the VTubing bubble has all but burst.\nPolygon is celebrating TwitchCon 2023 with a package of stories covering streaming trends and news from the show. Check it out!\n“I do feel that VTubing has become less novel as the market has become more saturated,” says a streamer with agency Nijisanji who is not approved to speak publicly. “There are obviously some ups and downs when it comes to working with an agency as well, which requires a lot of patience if I’m honest. And there are some decisions that are made that sometimes don’t make a lot of sense.”\nAgencies for VTubers manage their talents, often assigning them a manager that helps organize interviews, collaborations, paid promotions, and ad content on streams. Sometimes they can be financial advisors, but that is not always the case, as money made through agencies may include subscription or merchandise sales.\nThe source at Nijisanji notes that all talents within the agency are under nondisclosure agreements, which prevents them from sharing information with their audiences that could compromise their identity, or even inform viewers on why they could be graduating — which is effectively retirement for VTubers.\n“Seeing agencies like Hololive and Nijisanji shut down entire branches or graduate talents without any real kind of information is heartbreaking for just about everyone involved in the process,” the source says.\nIn 2020, Hololive shuttered its Chinese division, graduating more than a handful of streamers. More recently, Nijisanji announced the abrupt graduation of one of its more prominent talents, Mysta Rias. He revealed that his choice to leave Nijisanji was due to burnout. And in August, the parent company of Hololive, Cover Corporation, announced that two talents would be graduating from its Holostars division barely a year after debuting. Statements from the graduating talents were not provided outside of an official announcement from Cover.\nIn some cases, VTubers are not given a choice and can be graduated prematurely, though the agency itself never specifies.\nIndependent VTuber NagamiMugi feels as though “corporate VTubing” is still a viable avenue for those looking to make a career out of the medium that can support content creation full-time. “I think VTubing content has become kind of stale,” she says. She goes on to mention that a lot of VTubers tend to be boxed into specific kinds of content — playing Minecraft or popular FPS games like Valorant. “In order for VTubing to continue to grow, VTubers need to branch out and create more content in line with other influencers,” she says.\n“Agencies should allow for talents to experiment, so long as it isn’t hurting anyone”\nMugi says that if VTubers took cues from other content creators and explored options like lore analysis videos or short-form reviews, the scene wouldn’t be as stagnant. And like other VTubers, Mugi has dreams of going corporate. Already relatively successful, having created her own storefront that hosts collaborations and merchandise featuring other VTubers and artists, she has auditioned for several major agencies. She says that one agency asked if she would close down her business if she passed the interview phase and became one of its talents.\nThis isn’t entirely uncommon, as the source from Nijisanji mentions that some talents have been given strict restrictions as to what content they can and can’t create once their contracts with the agency expire. However, this can vary between talents and what is agreed upon between both the talent and the agency itself. So while agencies can be viable in terms of long-term growth for a creator, it is often strictly tied to the avatar associated with said agency. Both Hololive and Nijisanji give creators very little freedom in terms of presentation, whereas newer agencies such as Idol allow talents to create their own concepts. While that may feel overwhelming to some, it allows for the talents behind these models to flex their creativity and create a persona that otherwise wouldn’t fit neatly into the clearly defined boxes some agencies slot them into.\n“Agencies should allow for talents to experiment, so long as it isn’t hurting anyone,” says the source. “Let people fail and still have that opportunity for growth in the future. More risk-taking and trying to branch out in other ways instead of simply just streaming or following preestablished methods.”\nAccording to both of the people we interviewed for this story, this is an agreed-upon sentiment — that to prevent further stagnation, this not-so-niche form of content creation needs to reinvent itself and allow more freedom to its talents. Time will tell if larger agencies like Hololive (which reported 50% growth in its 2023 financial report) and Nijisanji will allow their talents to break the mold.\n\nThis article, authored by Kazuma Hashimoto, was published by Polygon on 2023-10-19 under the category 'entertainment'.\n\n","id":550}
{"title":"TwitchCon 2023 was better than last year, but everyone hated Las Vegas","context":"## TwitchCon 2023 was better than last year, but everyone hated Las Vegas\n\nTwitchCon 2023 was better than last year, but everyone hated Las Vegas TwitchCon felt positive for the first time in a while, one streamer said, but 'we are positive we don't want TwitchCon to be in Vegas again.'\nCompared to the shitshow that went down last year, TwitchCon Las Vegas was largely a success. The problem? Nobody liked Las Vegas.\nThis year’s TwitchCon appeared to mitigate last year’s crowding issues and concluded without any foam pit tragedies. The fraught relationship between Twitch and its streamers is on the mend after the company opened the event by announcing that it now allows simulcasting, so that streamers can stream on multiple other platforms at the same time. Attendees gushed about the overall positive energy at the convention, posting that it “actually feels like Twitch is back.” Livestreaming competitor Kick “haunted” TwitchCon with its nearby gaming lounge, but that didn’t put a damper on TwitchCon’s good vibes. There was even a gay engagement onstage!\nI can’t believe I pulled this off 😆 what an amazing moment I will remember forever. Thank you Twitch 💜 https:\/\/t.co\/Jx0k0Q2OsZ — Lowco @ TwitchCon (@LowcoTV) October 20, 2023\nThe generally positive consensus comes after a tense year for Twitch, punctuated by rounds of layoffs and unpopular policy changes. Dan Clancy, who had served as the company’s president since 2019, took the reins from Twitch co-founder Emmett Shear earlier this year, ending Shear’s 16-year tenure as CEO. Clancy’s leadership was initially met with trepidation; after meeting him at TwitchCon last year, streamer Jakenbake described him as “out of touch with what streamers need and want.”\nClancy appears to have made it up to the streamer community in time for this year’s event. Lowco, the streamer who proposed to her girlfriend onstage during TwitchCon’s opening ceremony, praised Twitch for improving its communication and transparency, and told TechCrunch that Clancy engaged with streamers all weekend. To run Twitch, she said, “you really need to understand the culture.”\n“There’s a reigniting feeling that we as creators are being heard and can be a part of Twitch’s decision making process,” Lowco told TechCrunch. “Dan Clancy’s presence this year made a tremendous impact on the atmosphere. He was everywhere, taking pictures, listening to creators, IRL streaming and truly being part of the TwitchCon experience.”\nBut it wouldn’t be TwitchCon without some grumbling. Though attendees said Twitch itself had improved, many expressed frustration about the event’s location. The convention took place on the Las Vegas Strip, an area that’s expensive, not walkable and lacks spaces to casually hang out with other streamers.\n“I think most of us agree TwitchCon Vegas felt very positive in a way that hasn’t been felt in some time,” Lowco posted on X (formerly Twitter). “But also we are positive we don’t want TwitchCon to be in Vegas again. Lol.”\nIt’s the first North American TwitchCon to be held outside of California since Twitch’s inaugural convention in 2015. Las Vegas may be able to physically accommodate such a large event, but many TwitchCon attendees complain that it lacks the infrastructure to foster the community engagement that Twitch revolves around. Daytime hangouts outside of the convention center were challenging; spaces that don’t revolve around drinking or gambling are scarce on the Strip, and if they do exist, they’re too far from the convention center to quickly visit.\n“The convention center in Vegas was solid but the city had way too much going on,” Lowco added. “We don’t need the distractions of Vegas, there’s enough for us to do. Vegas had the community split all over the city, which is not convenient to get around.”\nHonestly yeah. The psotive vibes were absolutely amazing but PLEASE NOT VEGAS AGAIN.\nSEATLE. NATIONAL HARBOR. ANYTHING BUT VEGAS https:\/\/t.co\/G3eYWwFme5 — Redclaw🦖🔞DinoVtuber (@RedclawDraws) October 24, 2023\nRachel Delphin, chief marketing officer at Twitch, confirmed to TechCrunch that next year’s convention will not be in Las Vegas, but couldn’t disclose where it would wind up. Twitch hosts two conventions every year: one in Europe and one in North America. TwitchCon Europe has taken place in Berlin, Amsterdam and, most recently, Paris. Twitch has hosted its North American events throughout California, including in San Jose, Long Beach and San Diego.\nTo its credit, Twitch is receptive to community feedback, and has had to dramatically scale up its conventions as the platform’s usership skyrocketed since the pandemic started in 2020. Attendees complained that last year’s event, which was the first convention that Twitch hosted in North America in nearly three years, was overcrowded and poorly laid out. The San Diego Convention Center’s tight hallways couldn’t accommodate so many people, which was worsened by fans flocking around popular streamers and blocking the flow of traffic.\nAttendees also complained that the venue was inaccessible for those using mobility aids, such as wheelchairs and walkers, because of the unmanaged crowds and unprepared security. In an X thread about the event’s lack of accessibility, attendees said that when popular streamers walked by, swarming fans pushed around those using mobility aids and nearly trampled them.\nTwitch managed to mitigate crowding issues during this year’s convention, a success that Delphin credits to the company learning quickly.\n“It was a huge demand to come back. I think fandoms have grown in that time period, just the fervor around specific creators that was totally and wholly different than we’d seen before,” Delphin said of last year’s TwitchCon. “And the creators themselves had also absolutely exploded. It used to be that you’d come to TwitchCon, be the biggest creator, and you could walk around pretty freely. Now it’s huge, it’s a whole different kind of apparatus to manage.”\nAttendee feedback is clear: Next year’s convention, wherever it is, needs to have more accessible third places.\nThe third place is a sociological term that refers to a physical space that isn’t work or home, where people can socialize without the obligations of productivity. If you can hang out there, it’s a third place. During the pandemic, virtual communities served as ad hoc third places in lieu of coffee shops, bookstores and gyms. Twitch, which saw exponential growth during the pandemic, was one of them. Last year’s San Diego-based TwitchCon, for all of its faults, took place in a walkable city abundant with nearby places to hang out, allowing attendees to bond, network and interact outside of the convention center. There’s no shortage of third places in Las Vegas, but for many TwitchCon attendees, nightclubs and casinos aren’t accessible alternatives to San Diego’s more casual venues.\nMoni, a streamer working in games tech who goes by Monistreams, expressed her frustrations in a recent post on Twitch’s feedback forum UserVoice.\n“They do a really good job of preparing content, it truly feels like a celebration of the community and streamers,” Moni said over a Discord call. “That’s their selling point. It is a celebration of streamers and their communities. However, in Las Vegas, it felt like people were not spending time with their favorite streamers or their communities because they were all stuck in an Uber or walking an hour on the Strip, or basically doing anything else but being at the con.”\nFor a city designed around tourism, the Las Vegas Strip is a pain to navigate — a fact that CES attendees are well acquainted with. Whatever traffic and accessibility issues last year’s TwitchCon attendees faced in San Diego’s Gaslamp Quarter paled in comparison to the complaints about the Las Vegas Strip.\nWalking in the sprawl of casinos is nearly impossible, especially in Nevada’s oppressive October heat. The Las Vegas Convention Center, where TwitchCon’s programming and exposition hall were based, is located at the end of the Strip and the majority of nearby dining options are either fast food chains or extravagant restaurants. Taking rideshares could be prohibitively expensive (I, for example, spent a heinous $37 on one 10-minute ride between TwitchCon events), and the sheer demand for cars meant that waiting for an Uber could take anywhere between five and 30 minutes. Other events nearby, like the emo revival music festival When We Were Young and the upcoming Formula One Grand Prix, further complicated travel around the convention center.\nIt was even worse for disabled attendees. Streamer Steve Saylor, a blind gamer and disability advocate, posted that he struggled to get around Las Vegas, even with rideshares, and that those with motor disabilities had even more difficulties because of the lack of adequate accommodations in the city’s infrastructure.\nFinally back from #TwitchCon and it was such a cool vibe that I really enjoyed everything about it. The people there were amazing! Vegas tho, just the absolute worst. Especially for those with disabilities trying to get anywhere. I hope I never have to go back there again. — Steve Saylor (@stevesaylor) October 24, 2023\nThese complaints about the Las Vegas Strip aren’t new, and are usually accepted in the trade-off for a weekend of partying or networking at a business conference. Twitch’s usership, however, skews younger — Twitch reports that in 2022, over 70% of its viewers were between 18 and 34 — and they may not have the disposable income to drop hundreds every day on meals and rides. Attendees who do drink complained that Las Vegas is significantly more expensive than San Diego.\nThe city’s emphasis on drinking and gambling is incompatible with much of Twitch’s usership. Las Vegas venues are overwhelmingly 21+, which excludes a significant portion of TwitchCon’s streamers and viewers. Even if they are of legal drinking age, today’s young adults tend to drink less than previous generations did.\nLas Vegas’ frenetic pacing is enthralling for many, but some Twitch users complained that the city’s energy didn’t fit the Twitch demographic. Moni’s UserVoice post noted that the sensory overload that makes Las Vegas feel like Las Vegas isn’t as alluring for introverted gamers.\n“I want to be mindful of the target audience Twitch serves — I would probably assume many of us felt the same about the overstimulation,” Twitch streamer herokerrey commented. “While I understand in-person events are a hype\/stimulating experience, pairing it with one of the most active cities in the world may not have been the best pick.”\nOther users commented that they missed the spontaneous get-togethers that made previous conventions so enjoyable, and that the offsite events like creator mixers were scattered across the city. One commenter complained that transportation between events took as long as actually attending the events.\nDinomiteTwins, Twitch streamers who are identical twins and share a channel, commented that the city’s size “put a damper” on how easily they could meet fellow creators.\n“We were in an approved hotel [provided by Twitch] and I met more vacationers, metal workers and brides than Twitch streamers in my hotel,” one of the DinomiteTwins commented. “A smaller walkable city promotes organic interaction as we are not all taking cabs … It felt like the priority was just being in a fun place instead of facilitating vendor, creator and community meetups and deepening those ties.”\nThird places provide more than just a break from the glare of fluorescent convention center lighting — they’re vital for building community, a sentiment that Twitch insists is unique to its platform as other livestreaming competitors gain users. Compared to its competitors, Twitch’s robust moderation and slew of collaboration features does facilitate a closer knit sense of community among its streamers and viewers. There was plenty of opportunity to mingle within the walls of the convention center, which even had a designated room to decompress and make friendship bracelets, but organic interactions seemed constrained to Twitch-sponsored events. The diverse programming and various meetups could only do so much in an area with so few casual social spaces.\nLowco, Moni and multiple other Twitch users commenting on Moni’s UserVoice post all questioned why TwitchCon couldn’t take place in San Diego again. Some have floated hosting both a West Coast and East Coast TwitchCon, if capacity is a concern. VidCon, which has traditionally been held in Anaheim, California, recently launched a second convention earlier this year in Baltimore, Maryland.\n“Ultimately, TwitchCon is a community celebration,” Lowco said. “We are there to meet up with our viewers and fellow streamers. Let’s pick places that make it easy for us to gather.”\n\nThis article, authored by Morgan Sung, was published by TechCrunch on 2023-10-26 under the category 'technology'.\n\n","id":551}
{"title":"Fantasy Football TE PPR Rankings Week 14: Who to start, best sleepers at tight end","context":"## Fantasy Football TE PPR Rankings Week 14: Who to start, best sleepers at tight end\n\nThis week might not matter for many fantasy football owners. Some have secured their spot in the postseason; others are well out of contention. However, for those in must-win situations, this week really matters. It's not the time to have a hole in your lineup at tight end, but if you do, we're here to help with our Week 14 fantasy TE PPR rankings.\nFortunately, there are several solid sleepers and streaming options despite two tough byes and some big injuries to notable TEs. It's always tough to know who to trust at this volatile position, so we break down which tight ends have higher floors for those favored to win comfortably and which have higher ceilings for those who need to really shoot for big points.\nLet's get to it and check out the TE landscape for Week 14.\nWho are the TEs on bye in Week 14?\nFew would've expected Week 14's two-team bye to be as problematic as it is, but losing Logan Thomas and Trey McBride this late in the season could have some fantasy owners scrambling.\nWEEK 14 PPR RANKINGS:\nQBs | RBs | WRs | D\/STs | Kickers\nFortunately, both the Commanders and Cardinals have above-average TE defenses, so taking those off the board only helps the position this week.\nWEEK 14 STANDARD RANKINGS:\nQBs | RBs | WRs | TEs | D\/STs | Kickers\nWho are the best fantasy TEs in Week 14?\nAs usual, Travis Kelce (vs. Bills in Week 14) tops our rankings, but T.J. Hockenson (@ Raiders), Sam LaPorta (@ Bears), David Njoku (vs. Jaguars), and Dalton Kincaid (@ Chiefs) aren't far behind. LaPorta and Njoku both have great matchups against defenses that entered last week in the top 10 in fantasy points per game (FPPG) allowed to TEs, and we know what Kelce, Hockenson, and Kincaid do every week in PPR formats.\nGeorge Kittle (vs. Seahawks) doesn't have a great matchup -- especially when you remember that he had just three catches for 19 yards against Seattle in Week 12 -- but he remains a must-start given his high ceiling in any matchup.\nWEEK 14 FANTASY ADVICE:\nSleepers | Busts | Projections | Start-sit\nWho are the best fantasy TE sleepers, pickups, & streamers in Week 14?\nIt can be tough to trust Taysom Hill (vs. Panthers) in full-point PPR leagues, but a matchup against the league's second-worst run defense gives him a high ceiling regardless of format. He's been more involved as a receiver this year, so he'll get a few catches to go along with the rushing stats, too. With Derek Carr (concussion) banged up, Hill might throw more this week, too.\nGerald Everett (vs. Broncos) and Isaiah Likely (vs. Rams) have matchups against bottom-six TE defenses, and Cole Kmet (vs. Lions), Jake Ferguson (vs. Eagles), and Kyle Pitts (vs. Buccaneers) also have above-average matchups that give them higher floors and higher ceilings than usual.\nFor those in deeper leagues, Tyler Conklin (vs. Texans), and Cade Otton (@ Falcons) both have matchups against defenses that entered last week in the top five for FPPG allowed to TEs. Brevin Jordan (@ Jets) and Tanner Hudson (vs. Colts) also have highly favorable matchups and can work as deep-league PPR plays, though Jordan's outlook is entirely dependent on whether Dalton Schultz (hamstring) is healthy.\nWEEK 14 DFS:\nDK lineup | FD lineup | Best values | Best stacks\nWho are the biggest potential fantasy TE busts in Week 14?\nDallas Goedert (@ Cowboys) isn't a \"must-start\" if he returns from his forearm injury this week. That said, he's also not a \"must-sit.\" He had three catches and 50 yards against Dallas in Week 9 before exiting early with the forearm injury, so he can clearly produce against this defense. Still, it's smart to check your other options before trusting Goedert.\nThe same goes for Evan Engram (@ Browns). He's generally more reliable in PPR leagues, but he's facing a Browns' defense that allows the fewest FPPG to TEs. Both Engram and Pat Freiermuth (vs. Patriots) are in tough spots against top-five TE defenses.\nWhat are the biggest TE injuries in Week 14?\nWe already mentioned Goedert (forearm) and Schultz (hamstring), but another TE who could be back this week is Darren Waller (hamstring). The Giants really have no reason to bring back their star TE if they don't feel like he's 100 percent, but it's something to monitor throughout the week, as Waller (vs. Packers) always has a high ceiling as the Giants' de facto No. 1 receiver.\nTyler Higbee (neck) was banged up last week, and he's no sure thing to suit up this week against Baltimore. Even if he does, he's not a recommended play against the Ravens' top-10 TE defense.\nWe'll be updating these TE PPR rankings throughout the week, so check back for the latest player movement and analysis.\nFantasy TE PPR Rankings Week 14: Who to start, sit at tight end\nRankings based on full-point PPR formats\nRank Player\n1 Travis Kelce, Chiefs vs. Bills\n2 T.J. Hockenson, Vikings @ Raiders\n3 Sam LaPorta, Lions @ Bears\n4 David Njoku, Browns vs. Jaguars\n5 Dalton Kincaid, Bills @ Chiefs\n6 George Kittle, 49ers vs. Seahawks\n7 Isaiah Likely, Ravens vs. Rams\n8 Cole Kmet, Bears vs. Lions\n9 Jake Ferguson, Cowboys vs. Eagles\n10 Dallas Goedert, Eagles @ Cowboys\n11 Kyle Pitts, Falcons vs. Buccaneers\n12 Gerald Everett, Chargers vs. Broncos\n13 Evan Engram, Jaguars @ Browns\n14 Brevin Jordan, Texans @ Jets\n15 Tyler Conklin, Jets vs. Texans\n16 Cade Otton, Buccaneers @ Falcons\n17 Tanner Hudson, Bengals vs. Colts\n18 Pat Freiermuth, Steelers vs. Patriots\n19 Tucker Kraft, Packers @ Giants\n20 Chigoziem Okonkwo, Titans @ Dolphins\n21 Dawson Knox, Bills @ Chiefs\n22 Jonnu Smith, Falcons vs. Buccaneers\n23 Juwan Johnson, Saints vs. Panthers\n24 Michael Mayer, Raiders vs. Vikings\n25 Hunter Henry, Patriots @ Steelers\n26 Adam Trautman, Broncos @ Chargers\n27 Mike Gesicki, Patriots @ Steelers\n28 Daniel Bellinger, Giants vs. Packers\n29 Ian Thomas, Panthers @ Saints\n30 Noah Fant, Seahawks @ 49ers\n\nThis article, authored by Matt Lutovsky, was published by Sporting News on 2023-12-07 under the category 'sports'.\n\n","id":552}
{"title":"Fantasy Football QB Rankings Week 14: Who to start, best sleepers at quarterback","context":"## Fantasy Football QB Rankings Week 14: Who to start, best sleepers at quarterback\n\nAlas, we've reached the final week of the fantasy football regular season. Although fantasy's highest-scoring position has been beaten and battered this year, there are serviceable signal-callers out there capable of leading your team to victory in a pivotal week. Our Week 14 fantasy QB rankings will help you make the right start 'em, sit 'em moves to cap off the regular season.\nWe're still dealing with byes -- and we had two more QB injuries last week -- but the position remains deep with high-scoring studs and potential sleepers. As we saw last week, we're at the point in the season where weather could factor into start-sit decisions, but finding quarterback production shouldn't be a problem in 10- and 12-team leagues.\nWith that in mind, let's dissect this week's QB rankings and put you on a path to end your season with a \"W.\"\nWhich QBs are on bye in Week 14?\nCoinciding with the end of the fantasy regular season, Week 14 is the last week of byes, as the Cardinals and Commanders are the last two teams to take their mandatory PTO. That means two starting-caliber QBs (Kyler Murray and Sam Howell) are on the shelf, slightly impacting the QB pool.\nWEEK 14 PPR RANKINGS:\nRBs | WRs | TEs | D\/STs | Kickers\nThe bigger losses, though, come on the defensive side of the ball, as fantasy owners won't be able to start QBs going up against two subpar pass defenses in Washington and Arizona. Starting any QB facing the Commanders' swiss-cheese defense has yielded strong returns. Arizona has been just as inefficient, entering Week 13 ranking 30th in dropback EPA.\nWEEK 14 STANDARD RANKINGS:\nRBs | WRs | TEs | D\/STs | Kickers\nWho are the best fantasy QBs in Week 14?\nDespite Buffalo being on the outside looking in for a playoff berth, Josh Allen (@ Chiefs in Week 14) has come through in fantasy, sitting as our QB1 for Week 14. Yes, the Chiefs' defense has done its part in keeping QBs in check this season, entering Week 13 allowing the fifth-fewest fantasy points per game (FPPG) to the position, but Allen has performed well against Steve Spagnuolo's defense in the past. He's averaging 276.4 passing yards per game with a strong 14:2 TD-to-INT ratio over five career games against KC.\nNot far behind sits Tua Tagovailoa (vs. Titans), who shredded the Commanders' defense to the tune of 280 yards and two TDs in Sunday's blowout. Another juicy matchup awaits against a lackluster Tennessee coverage unit. Dak Prescott (vs. Eagles) remains a top-three play in Sunday's rematch versus the Eagles, a team he torched for 374 yards and three TDs in a narrow 28-23 loss in Week 9.\nJalen Hurts (@ Cowboys) and the Eagles look to get back on track in a pivotal NFC East clash in Dallas, facing a Cowboys defense that let Geno Smith post top-end QB1 numbers against them last week. Patrick Mahomes (vs. Bills) is in line to put up strong numbers in a potential shootout against Buffalo, and although his receiving corps has its issues, the reigning MVP is still a top-five play this week.\nLamar Jackson (vs. Rams) faces an exploitable L.A. secondary, while Jared Goff (@ Bears) looks to build off a dominant Week 13 effort against an ascending Chicago stop unit. C.J. Stroud (@ Jets) sees a slight dip in his Week 14 ranking in a tough road test against the Jets, but the Rookie of the Year frontrunner still profiles as a set-it-and-forget-it QB1.\nWho are the best fantasy QB sleepers, waiver pickups in Week 14?\nWeek 14 is a challenging one from streaming perspective, as Gardner Minshew (@ Bengals), Jameis Winston (vs. Panthers), Baker Mayfield (@ Falcons), and Joe Flacco (@ Jaguars) look like the best options.\nMinshew is executing Shane Steichen's scheme at an efficient clip and now faces a Cincinnati stop unit that ranks below the league average in dropback EPA. Assuming Winston gets the starting nod in place of the banged-up Derek Carr (head, shoulder, back), his gunslinger play style could lead to a respectable fantasy output against the reeling Panthers.\nMayfield wasn't asked to do much with his arm in Week 13, but a potential negative game script in Atlanta could force him to air the ball out at a higher clip, boosting his fantasy prospects. Although the Browns didn't get the win in Flacco's first start with his new team, the veteran did everything he could to keep Cleveland within striking distance, racking up 254 yards and two TDs. Another 250-plus yard, multi-TD effort could again be in store if he continues to start in place of Dorian Thompson-Robinson (concussion).\nWEEK 14 FANTASY ADVICE:\nSleepers | Busts | Projections | Start-sit\nWho are the biggest potential QB busts in Week 14?\nMatthew Stafford (@ Ravens), Geno Smith (@ 49ers), and Josh Dobbs (@ Raiders) are all risky against some of the league's better pass defenses. Stafford faces a sound Ravens stop unit that entered their Week 13 bye allowing the second-fewest FPPG to QBs.\nThere's a chance the Vikings opt to start fellow QB Nick Mullens over Dobbs after his debacle last Monday night against the Bears, but if Minnesota elects to stick with Dobbs, his rocky Week 12 outing concerns us against a Raiders defense that's been one of the more efficient pass defenses since Week 5, sitting eighth in dropback EPA.\nOn the other hand, after an elite Week 13 effort in Seattle's one-possession loss to Dallas, fantasy owners might go looking to chase points with Smith, but replicating last week's showing against the 49ers is a completely different ask for a QB who's underwhelmed this season.\nWEEK 14 DFS:\nDK lineup | FD lineup | Best values | Best stacks\nWhat are the biggest QB injuries in Week 14?\nLeading into Week 13, Dorian Thompson-Robinson (concussion) was the lone QB injury situation we were closely monitoring. Even if Thompson-Robinson is able to clear concussion protocol in time for Week 14, we expect Flacco to make his second start as a Brown.\nThis week, we unfortunately saw Kenny Pickett (ankle) and Derek Carr (head, shoulder, back) exit their respective contests with injuries, complicating their statuses for Week 14. We've replaced both QBs with backups Mitchell Trubisky and Jameis Winston, respectively, as early indications point toward both missing time.\nUPDATE: Trevor Lawrence suffered an ankle injury on Monday, which will likely keep him out for at least a week and open the door for C.J. Beathard (vs. Browns) to start.\nWe'll be updating these QB rankings throughout the week, so check back for the latest player movement and analysis.\nFantasy QB Rankings Week 14: Who to start, sit at quarterback\nThese rankings are based on four-point passing TD scoring\nRank Player\n1 Josh Allen, Bills @ Chiefs\n2 Tua Tagovailoa, Dolphins vs. Titans\n3 Dak Prescott, Cowboys vs. Eagles\n4 Jalen Hurts, Eagles @ Cowboys\n5 Patrick Mahomes, Chiefs vs. Bills\n6 Lamar Jackson, Ravens vs. Rams\n7 Jared Goff, Lions @ Bears\n8 C.J. Stroud, Texans @ Jets\n9 Brock Purdy, 49ers vs. Seahawks\n10 Jordan Love, Packers @ Giants\n11 Justin Herbert, Chargers vs. Broncos\n12 Russell Wilson, Broncos @ Chargers\n13 Justin Fields, Bears vs. Lions\n14 Gardner Minshew, Colts @ Bengals\n15 Matthew Stafford, Rams @ Ravens\n16 Trevor Lawrence, Jaguars @ Browns\n17 Geno Smith, Seahawks @ 49ers\n18 Derek Carr, Saints vs. Panthers\n19 Joe Flacco, Browns @ Jaguars\n20 Baker Mayfield, Buccaneers @ Falcons\n21 Josh Dobbs, Vikings @ Raiders\n22 Jake Browning, Bengals vs. Colts\n23 Bryce Young, Panthers @ Saints\n24 Aidan O'Connell, Raiders vs. Vikings\n25 Desmond Ridder, Falcons vs. Buccaneers\n26 Will Levis, Titans @ Dolphins\n27 Bailey Zappe, Patriots @ Steelers\n28 Mitch Trubisky, Steelers @ Patriots\n29 Tommy DeVito, Giants vs. Packers\n30 Zach Wilson, Jets vs. Texans\n\nThis article, authored by Nick Musial, was published by Sporting News on 2023-12-07 under the category 'sports'.\n\n","id":553}
{"title":"Totals Betting - What is an Over\/Under Bet?","context":"## Totals Betting - What is an Over\/Under Bet?\n\nIn sports betting, betting on totals is a favorite option alongside point spreads and moneylines.\nRather than pick the winner or the winning margin, with totals betting (a.k.a. over\/unders), you predict the game’s combined score.\nIn the sections below, we'll explain totals betting completely incluidng its main attributes, over\/under examples from multiple sports, and some totals betting pointers for both novice and seasoned bettors.\nWhat is an over\/under bet?\nA totals bet, commonly known as an over\/under bet, involves betting on the combined score of both teams in a game.\nBookmakers set a predicted total score for the game, and bettors choose whether they think the actual combined score will surpass (over) or fall short of (under) that number.\nFor instance, if an NBA betting site sets the total for a basketball game at 210.5 points, those who bet the \"over\" would win if the combined score of the two teams is 211 or more.\nThose who bet the \"under\" would win if the score totals 210 or less. The 0.5 ensures no chance of a tie, as teams can't score in half-points.\nYour only concern is whether the final combined score will fall over or under the line set by oddsmakers.\nHow do over\/under odds work?\nWhen placing totals wagers, you’ll see odds listed alongside the over\/under number. These odds indicate the potential payout for the bet.\nTypically, the odds for totals bets are close to even, ranging from -105 to -120.\nThis narrow range reflects the bookmakers' belief that the event has a roughly even chance of going either way, with neither the over nor the under being heavily favored.\nDoes the totals line move or change?\nYes, the totals line can move. The line movement occurs in response to various factors:\nBetting Activity: One of the most common reasons for line movement is a significant amount of money being wagered on one side (either over or under). Bookmakers adjust the line to balance the action and protect themselves from potential losses.\nOne of the most common reasons for line movement is a significant amount of money being wagered on one side (either over or under). Bookmakers adjust the line to balance the action and protect themselves from potential losses. Injury Updates: If a key player is injured or unable to play, this can influence the expected total score, leading bookmakers to adjust the line accordingly.\nIf a key player is injured or unable to play, this can influence the expected total score, leading bookmakers to adjust the line accordingly. Weather Conditions: In outdoor sports, weather can play a significant role. For example, heavy rain or snow in a football game might lead to expectations of a lower-scoring game, causing the line to move down.\nIn outdoor sports, weather can play a significant role. For example, heavy rain or snow in a football game might lead to expectations of a lower-scoring game, causing the line to move down. Other News and Updates: Any news that might affect the performance of the teams, such as changes in team strategy or recent performances, can influence totals lines.\nTotals betting outcomes\nWhen placing an over\/under wager, there are a few potential outcomes to consider. If the combined score exceeds the set total, the \"over\" bet wins.\nConversely, if the score is below the set total, the \"under\" bet wins. If the combined score of the game matches the total, the bet is typically considered a \"push,\" and the wager is refunded.\nNow, let’s break down those three scenarios.\nTotals win\nImagine the NBA over\/under odds for a game between the Los Angeles Lakers and the Boston Celtics is 220.5 points. If a bettor believes that the game will be high-scoring and that the teams' combined score will exceed this mark, they might place an \"over\" bet.\nThe game then unfolds, and the Lakers score 115 points while the Celtics score 110, resulting in a combined score of 225 points. Since 225 exceeds the set total of 220.5, the bettor who wagered on the \"over\" wins their bet.\nTotals loss\nSuppose a top sports betting app sets a total of 200.5 points for an NBA game between the New York Knicks and the Chicago Bulls.\nIf a bettor believes the game will be defensive and low-scoring, they might place an \"under\" bet, predicting that the combined score of both teams will be 200 points or less.\nHowever, if the game turns out to be offensively charged and the Knicks score 105 points while the Bulls score 100 points, the combined score becomes 205 points. Since 205 exceeds the set total of 200.5, the bettor who wagered on the \"under\" loses their bet.\nPush\nA push occurs when the combined score of a game matches the set total established by the bookmaker, meaning that bettors neither win nor lose, and their original wager is refunded. However, to avoid this outcome, most sportsbooks employ half-points in their totals.\nBy using half points, such as setting a total at 200.5 instead of 200, the sports betting sites ensure that a game's combined score cannot possibly match the set total exactly.\nTotals betting by sport\nOver\/under betting is a major draw across many popular sports. Let’s break down how it can look across sports.\nOver\/under odds in football\nLet's consider some NFL over\/under odds between the Dallas Cowboys and the Philadelphia Eagles.\nThe bookmaker sets the over\/under total at 47.5 points for the combined score of both teams. A bettor believes it will be a high-scoring game and places an \"over\" bet.\nThe game concludes with the Cowboys scoring 28 points and the Eagles scoring 24 points, leading to a combined score of 52 points. Since 52 exceeds the set total of 47.5, the bettor who wagered on the \"over\" wins their bet.\nOver\/under odds in basketball\nImagine NBA over\/under odds between the Charlotte Hornets and the Houston Rockets. The bookmaker sets the over\/under total at 215.5 points for the combined score of both teams. A bettor, expecting a defensive showdown, places an \"under\" bet.\nThe game ends with the Hornets scoring 105 points and the Rockets scoring 108 points, yielding a combined score of 213 points. Since 213 is below the set total of 215.5, the bettor who wagered on the \"under\" successfully wins their bet.\nOver\/under odds in baseball\nLet's look at MLB over\/under odds between the New York Yankees and the Boston Red Sox. The bookmaker establishes the over\/under total at 8.5 runs for the combined score of both teams.\nA bettor, thinking it'll be an offensively charged game with both teams having their best hitters in the lineup, places an \"over\" bet. The game wraps up with the Yankees scoring 5 runs and the Red Sox tallying up 6 runs, resulting in a combined score of 11 runs.\nSince 11 exceeds the set total of 8.5, the bettor who wagered on the \"over\" comes out on top.\nOver\/under odds in hockey\nLet's consider NHL over\/under odds between the Toronto Maple Leafs and the Montreal Canadiens.\nThe bookmaker sets the over\/under total at 5.5 goals for the combined score of both teams. A bettor, anticipating a game dominated by goalkeepers and defense, places an \"under\" bet.\nThe game ends with the Maple Leafs netting 3 goals and the Canadiens scoring 2, leading to a combined score of 5 goals. Since 5 is below the set total of 5.5, the bettor who opted for the \"under\" secures a win on their wager.\nOver\/under odds in soccer\nLet's take some Premier League soccer odds between Manchester United and Chelsea. The bookmaker determines the over\/under total at 2.5 goals for the combined score of both teams. A bettor, feeling that both teams have been on a scoring spree lately, places an \"over\" bet.\nThe match ends with Manchester United scoring 2 goals and Chelsea netting 2 as well, resulting in a combined score of 4 goals. Since 4 surpasses the set total of 2.5, the bettor who wagered on the \"over\" enjoys a winning bet.\nOver\/under odds in MMA\nIn an MMA context, over\/under bets often refer to the duration of the fight rather than points or scores. Let's consider a UFC bout between Fighter A and Fighter B. The bookmaker sets an over\/under line at 2.5 rounds for the fight's duration.\nA bettor, believing that both fighters have aggressive styles and the fight will conclude early, places an \"under\" bet. If the fight ends midway through the second round due to a knockout or submission, the total rounds would be 1.5.\nSince this is below the set total of 2.5 rounds, the bettor who wagered on the \"under\" wins their bet. Conversely, if the fight extends beyond the midway point of the third round, \"over\" bets would win.\nSee more: Best MMA betting sites\nOver\/under odds in tennis\nAt tennis betting sites, over\/under betting typically revolves around the total number of games or sets played in a match. Let's consider a Grand Slam match between Player A and Player B. The bookmaker sets the over\/under total at 40.5 games for the entire match.\nA bettor, anticipating a closely contested match with many extended sets, places an \"over\" bet. The match unfolds with the following set scores: 7-5, 6-7, 7-6, and 6-4. The combined total number of games played is 42. Since 42 exceeds the set total of 40.5, the bettor who wagered on the \"over\" wins their bet.\nOver\/under odds in golf\nAt golf betting sites, over\/under betting often pertains to a golfer's score for a specific round or the entire tournament relative to par. Let's consider a major tournament where a notable golfer, say Rory McIlroy, is playing. The bookmaker sets an over\/under line at 69.5 strokes for his first-round score.\nA bettor, analyzing the challenging course conditions and believing McIlroy might face difficulties, places an \"under\" bet, predicting he'll finish the round in 69 strokes or fewer.\nIf McIlroy concludes the round with a score of 68, which is 3 under par on a par-71 course, the bettor's \"under\" wager wins. Conversely, if McIlroy shoots a 70 or higher, those who bet the \"over\" would win.\nTotals betting FAQ\nHow do over\/under bets work?\nOver\/under bets, also known as totals bets, involve wagering on whether a particular number (like combined points scored in a game, total rounds in a fight, or total games in a tennis match) will be over or under the figure set by the bookmaker.\nDoes overtime count in totals wagering?\nYes, in most sports and with the majority of sportsbooks, overtime does count toward your totals wager. Always check the specific rules of the sportsbook you are betting with to confirm, but generally, overtime is included in totals wagers.\nWhy does the over\/under betting line change?\nSportsbooks set game totals considering factors like recent performances, weather, and player status. As new data emerges and betting trends develop, this line can shift.\nFor instance, if many bettors choose the \"over,\" the sportsbook might raise the total to balance the bets. Line movements often reflect public betting sentiments and offer insights to informed bettors. Therefore, bettors must monitor any line changes before the game starts and strategize accordingly to optimize their betting success.\nIs it better to bet over or under?\nNeither wager holds a universal advantage. Success in over\/under betting hinges on a thorough evaluation of both the set line and the competing teams.\nHow do you read an over\/under bet?\nReading a total bet involves understanding the combined score set by the sportsbook and the odds associated with that number. When you see a total, such as 210.5 in a basketball game, it represents the combined score anticipated from both teams. Beside this number, you'll typically find \"over\" and \"under\" options.\nIf you believe the actual combined score will surpass this number, you'd bet on the \"over.\" Conversely, if you think it will be less, you'd choose the \"under.\" Accompanying these options are odds that indicate the payout for the bet.\nFor instance, odds of -110 (extremely common) mean you'd need to wager $110 to win an additional $100. Evaluating both the total and the associated odds is crucial for informed betting decisions.\nRelated Pages:\n\nThis article, authored by Sam Eggleston, was published by Sporting News on 2023-11-01 under the category 'sports'.\n\n","id":554}
{"title":"The best places to see the Northern Lights in the UK","context":"## The best places to see the Northern Lights in the UK\n\nSign up to Simon Calder’s free travel email for expert advice and money-saving discounts Get Simon Calder’s Travel email Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nSimon Calder’s Travel email {{ #verifyErrors }} {{ message }} {{ \/verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ \/verifyErrors }}\nOne of the world’s most spectacular natural phenomena, at certain periods during the year the Northern Lights regularly light up the skies of northern countries that sit in the ‘aurora zone’ of the Arctic Circle.\nThe light show happens when electronically charged particles enter the Earth’s atmosphere from space, producing dazzling displays of green, yellow, purple and even red lights.\nThis is visible every year in some areas of European countries like Finland, Iceland, Sweden and Norway, while there are regular sightings in parts of Canada and Greenland too. Fortunately for Brits, you don’t necessarily need to trek to these countries to see the aurora borealis; sightings have become more frequent in the UK, with the lights seen as far south as Wiltshire in February 2023.\nAlthough numerous UK locations have reported sightings in recent years, these do tend to be in northern areas of the British Isles. It’s tough to predict exactly when and where the spectacle will make an appearance, but we’ve rounded up a list of the best places where you might be lucky enough to see the Northern Lights in the UK.\nHebrides, Scotland\nThe Lights above Skye in the Inner Hebrides (Getty Images\/iStockphoto)\nThis northern archipelago off the western Scottish coast comprises hundreds of islands, split into the Inner and Outer Hebrides. While the Lights can be seen in Skye and other isles of the Inner Hebrides, your best bet for seeing the lights remains in the Outer Hebrides, likely on the islands of Lewis or Harris. The flat beaches and countryside are great viewing points, while the remote parts of the islands are subject to almost no light pollution. The exceptionally dark skies here are known to be good for star gazing; even if you miss the lights, there’s every chance you’ll see the Orion Nebula, the Milky Way and the Great Andromeda galaxy.\nThe ‘season’ here runs from September to April, though the aurora is most common in winter, when skies get dark in the late afternoon. In February, the Isle of Lewis hosts its own Dark Skies Festival, with events including live music, film and theatre.\nShetland Isles, Scotland\nThe Shetland Isles are a good Scottish destination for light spotting (Getty Images\/iStockphoto)\nThe most northerly point in all of Britain, Shetland lies closest to the North Pole and is a location where locals can expect to see the Northern Lights a few times every winter. Over 100 miles from the mainland, the remote isle is home to plenty of tranquil countryside and coastal scenery, providing dozens of spots where you can potentially watch the lights away from the light pollution of nearby settlements.\nThe season here runs from mid-October to mid-March, with winter again being the best time to try and see the phenomenon (there are less than six hours of daylight during the shortest days). Though light shows aren’t guaranteed during your stay, wildlife spotting, walking and exploring the towns more than make up for any disappointment should the aurora fail to materialise.\nRead more on UK travel:\nCairngorms, Scotland\nThe Cairngorms are home to an area of International Dark Sky Park (Getty Images\/iStockphoto)\nThe UK’s largest National Park is another Scottish destination for potentially seeing the Northern Lights. The park is home to Ben Nevis, the highest peak in the UK, and one of the UK’s International Dark Sky Parks (areas noted for “possessing an exceptional or distinguished quality of starry nights”). This area is situated around the Glenlivet Estate, forming the Tomintoul and Glenlivet park. An area with “remarkably dark skies”, the region is busy all year thanks to its vast amount of wilderness to explore and wildlife to see.\nWhile mountains and hills may block views, there are plenty of dark areas that are perfect for seeing the lights between mid-October and mid-March (especially those nearer the coast, where views are less likely to be interrupted by clouds).\nYorkshire Dales, England\nThe lack of light pollution makes the Yorkshire Dales a great place to spot the aurora (Getty Images\/iStockphoto)\nWith a northerly, light-pollution free location as the gold standard for seeing the Northern Lights in the UK, the Yorkshire Dales are an oft-viable destination. The aurora was seen here as recently as April 2023; the park is one of England’s Dark Sky Reserves and the largest in the UK, and will be hosting a joint Dark Skies Festival with the North York Moors National Park in February 2024. It has four Dark Sky Discovery sites (designated nationwide for “good sightlines of the sky” and a lack of light pollution), which are in Buckden National Park Car Park, Tan Hill Inn and both Hawes and Malham National Park Visitor Centres.\nAccording to the park’s website, on clear nights you can see as many as 2,000 stars, the Milky Way and even the International Space Station. The Perseid meteor shower occurs in August, though the best time to see the Lights is still between September and March – just remember to wrap up warm and follow any aurora updates online or on specially dedicated apps.\nNorthumberland, England\nThe Northern Lights over Bamburgh’s lighthouse (Getty Images\/iStockphoto)\nAnother International Dark Sky Park, Northumberland’s National Park reportedly boasts the darkest skies in the UK (so is also an excellent stargazing spot). Although it sits at a more southerly latitude than many other light-spotting locations, the aurora has been seen over Hadrian’s Wall and Bamburgh in the past, and the county itself remains one of the most reliable locations to see the display in England. Lights are only usually visible here after particularly strong geomagnetic storms, so it may be an idea to keep track of these if planning a visit. Again, the areas near the coast – themselves in an Area of Outstanding Natural Beauty – can be better for seeing the aurora due to the presence of fewer clouds.\nSnowdonia, Wales\nA strong storm made the Lights visible in Snowdonia in this photo (Getty Images\/iStockphoto)\nOne of three Dark Sky reserves in Wales, Snowdonia also boasts the country’s highest peak, largest lake, its own section of mountain railway and 1,497 miles of public footpaths. The 823-square mile park provides views of the Milky Way and major constellations on clear nights, with the odd shooting star to make up for those nights where you miss out on an aurora borealis show. As with most places in the UK, you’re more likely to see the lights between October and March. For the best views, head to the lakes of Llyn Geirionydd and Llyn y Dywarchen or to Ty Cipar, between Llan Ffestiniog and Ysbyty Ifan.\nLake District, England\nThe clear skies over Buttermere in the Lake District (Getty Images\/iStockphoto)\nWhile better known as a destination for walking, hiking and simply enjoying the peace and tranquility of the surrounding nature, the Lake District is also one of the best places in England to see the Northern Lights. The area is an exceptional place for stargazing too and is currently seeking to become an International Dark Sky Reserve. Though the lights are rarer here than in Scotland, the lakeside backdrops make for particularly dramatic surroundings if the lights do appear, with excellent view points at Grizedale Forest, Wasdale, the Langdale Valley and Derwentwater.\nRead our reviews of the best UK hotels\n\nThis article, authored by Chris Wilson, was published by The Independent - Travel on 2023-12-21 under the category 'entertainment'.\n\n","id":555}
{"title":"See stunning images of STEVE and auroras from this weekend's powerful solar storm","context":"## See stunning images of STEVE and auroras from this weekend's powerful solar storm\n\nSkywatchers worldwide were treated to a magnificent aurora light show over the weekend as northern lights were reported as far south as Greece and Turkey.\nThe colorful aurora displays were triggered by a strong geomagnetic storm that peaked as a strong G3 on Nov. 5 at 12:40 p.m. EST (1740 GMT) on the 5-grade scale used by the U.S. National Oceanic and Atmospheric Administration (NOAA) to assess the severity of space weather events.\nGeomagnetic storms are disturbances to Earth's magnetic field caused by solar material from coronal mass ejections (CME) — large expulsions of plasma and magnetic fields from the sun's atmosphere. This particular geomagnetic storm was triggered by not one but two CMEs that slammed into Earth on Nov 4 and Nov. 5, according to spaceweather.com.\nDuring a solar storm, energized particles from the sun slam into Earth's atmosphere at speeds of up to 45 million mph (72 million km\/h) and our planet's magnetic field funnels the particles toward the poles. The supercharging of molecules in Earth's atmosphere triggers the colorful spectacles, which usually remain limited to areas at high latitudes for the aurora borealis (northern lights) and the aurora australis (southern lights).\nBelow, we take a look at some of the best aurora photos captured by skywatchers around the world.\nDebby Thorne captured this beautiful display from Cullen on the Moray Firth in Scotland with an iPhone 14 Pro in night mode on Nov. 5.\nVibrant pink aurora display from Cullen on the Moray Firth in Scotland looking towards Bow Fiddle Rock. (Image credit: Debby Thorne)\n\"I am lucky to have seen the Aurora many times as used to live on the west coast of Scotland — and lucky to still see them on the Moray Firth where we live now.\" Thorne told Space.com \"But I have to say the display last night was incredible\"\n\"I've never seen such bright pinks — usually greens with faint pink. I never tire of seeing them and often feel overwhelmed by this amazing thing going on in the sky and we are but a dot. I often wonder what our ancestors must have made when they saw the sky dancing, I just feel incredibly lucky to be able to experience it from my back door in Scotland.\" Thorne continued.\nMeteorologist Angel Enriquez was working the evening shift at the National Weather Service in Glasgow, northeast Montana when his colleague alerted him to the aurora light show.\n\"A fellow coworker was out gathering her own pictures when she texted 'GO OUTSIDE NOW'\" Enriquez told Space.com. \"I took the tripod to the darkest spot of the office, which happens to be next to the radar, and took some memorable photos.\"\nMeteorologist Angel Enriquez captured pink and green aurora above a round observatory in Glasgow, Montana. (Image credit: Angel Enriquez)\nAstrophotographer Josh Dury saw red auroras from the Mendip Hills in Somerset, UK.\nRed auroras from the Mendip Hills in Somerset, UK. (Image credit: Josh Dury)\n\"On the night of this shoot, I was scouting a number of locations where clear skies would permit.\" Dury told Space.com \"With most of the South-West under cloud, clear skies persisted on The Mendips. Making it possible to view a window to the aurora and capture the beautiful red pillars low on the north horizon.\"\nAstrophotographer Gareth Mon Jones caught a stunning view of the aurora above Penmon Lighthouse, Anglesey.\nRed and green aurora above Penmon Lighthouse, Anglesey. (Image credit: Gareth Mon Jones)\n\"A whopper of a display on Anglesey tonight,\" Jones wrote on X. \"my girlfriend was happy to see one of the best displays of the northern lights in a long time\"\nPhilip McErlean witnessed the aurora borealis shine above the southern shores of Lough Neagh, Northern Ireland.\nPink and green lights above Lough Neagh, Northern Ireland. (Image credit: Philip McErlean)\n\"It was an exceptional night of aurora here in Northern Ireland and one of the best displays I have seen\/photographed.\" McErlean told Space.com\nMany skywatchers also took to X (formerly known as Twitter) to share their aurora encounters.\nSpace weather physicist Tamitha Skov was at a loss for words as she retweeted photographs of bright red auroras seen over Greece.\n\"Even though this #solarstorm peaked at a G3, such a view is indeed special. Wonder if the changing magnetic field of Earth and growing equatorial #auroral shows are playing a role here?\" Skov wrote.\nAt a loss for words: #Aurora is gracing the skies over Greece. Even though this #solarstorm peaked at a G3, such a view is indeed special. Wonder if the changing magnetic field of Earth and growing equatorial #auroral shows are playing a role here? https:\/\/t.co\/eRA9wwlcEhNovember 6, 2023 See more\nAuroras were even reported in Turkey.\nNorthern (polar) lights caused by geomagnetic storm seen in #Hayrabolu, #Tekirdağ, #Turkey.#aurora #solar #geomagneticstorm #jeomanyetik #northernlights#kuzeyışıkları #AuroraborealisVideo @commandouz pic.twitter.com\/DL7fJupRvANovember 5, 2023 See more\nTravel and landscape photographer Paul Pichugin captured this incredible timelapse of the aurora australis lighting up the skies over Busselton, Western Australia.\nA timelapse video of the Aurora Australis over Busselton, Western Australia late last night and early this morning!#WesternAustralia #Aurora pic.twitter.com\/v8KG3UM7WbNovember 5, 2023 See more\nLandscape photographer Alistair Hamill captured his first sub-auroral arc of solar cycle 25.\n\"I had to try for a pano to fit it all in. This arc was right above my head at the time!\" Hamil posted on X (formerly known as Twitter).\nBrilliant aurora display last night at Glenarm - including my first sub auroral arc of solar cycle 25! I had to try for a pano to fit it all in. This arc was right above my head at the time! pic.twitter.com\/MLQOh8Lp14November 5, 2023 See more\nBut not all the light shows were auroras! During the peak of the storm, STEVE made an appearance for some!\nSTEVE is an aurora-like glow that often accompanies the northern lights, yet is a distinct phenomenon, according to the American Geophysical Union (AGU). The acronym stands for Strong Thermal Emission Velocity Enhancement. STEVE is caused by hot (5,400 degrees Fahrenheit or 3000 degrees Celsius) streams of gas snaking through Earth's magnetosphere. When these streams are energized by geomagnetic storms they emit light, according to spaceweather.com.\nSteven lomas managed to photograph mysterious STEVE above Dunstanburgh Castle Northumberland, UK.\nImage 1 of 3 (Image credit: Steven lomas) (Image credit: Steven lomas) (Image credit: Steven lomas)\n\"It was the strongest display of the aurora that I have seen in 8 years of photography\" lomas told Space.com. \"The highlight was seeing the corona and also STEVE!\"\nlomas also captured quite the mythical scene with vibrant green and red auroras dancing over Dunstanburgh Castle.\nImage 1 of 3 (Image credit: Steven lomas) (Image credit: Steven lomas) (Image credit: Steven lomas)\nPhotographer Martin McKenna (Nightskyhunter) took to X to post some awesome STEVE photographs.\n\"I've been observing aurora since 1998 with 180 displays and this is my first sighting, what a show!\" McKenna wrote on X.\nSpectacular sight over Swatragh last night in the form of STEVE (proton arc) extending across the entire sky from W to E and flaring near Jupiter. I've been observing aurora since 1998 with 180 displays and this is my first sighting, what a show! https:\/\/t.co\/19Wt2BjIl1 #steve pic.twitter.com\/6Vma3zeAfNNovember 6, 2023 See more\nEditor's note: If you capture stunning photographs of the aurora (or any other night sky phenomenon) and would like us to consider featuring them on Space.com please email them over to space@spacephotos.com.\n\nThis article was published by Live Science: The Most Interesting Articles on 2023-11-09 under the category 'science'.\n\n","id":556}
{"title":"Fly with Delta frequently? Small business owners can score a solid welcome bonus and other perks with the Delta SkyMiles Gold Business Card","context":"## Fly with Delta frequently? Small business owners can score a solid welcome bonus and other perks with the Delta SkyMiles Gold Business Card\n\nOur take: If you’re a small business owner who flies with Delta regularly and wants to score a solid welcome bonus, consider the Delta SkyMiles® Gold Business American Express Card. This card has a welcome bonus of up to 75,000 miles and perks like free checked bags and priority boarding with a $0 intro annual fee for the first year (then $99).\nPros Free checked bag free on Delta flights\nGenerous welcome bonus of 75,000 miles\nNo foreign transaction fees Cons No lounge access\n$99 annual fee ($0 intro fee for the first year)\nTo view rates and fees of the Delta SkyMiles® Gold Business American Express Card, see this page.\nDelta SkyMiles Gold Business Card Highlights\nCard Type: Airline\nWelcome bonus: 75,000 Bonus Miles after you spend $6,000 in purchases on your new Card in your first 6 months\n75,000 Bonus Miles after you spend $6,000 in purchases on your new Card in your first 6 months Annual fee: $0 intro annual fee for the first year (then $99)\n$0 intro annual fee for the first year (then $99) Rewards: 2x miles on purchases made directly with Delta, 2x miles on U.S. purchases for advertising in select media, 2x miles on U.S. shipping purchases, 2x miles on dining at restaurants, 1x mile on every eligible dollar spent on other purchases\nWith the Delta SkyMiles® Gold Business American Express Card, cardholders who frequently fly with Delta can reduce travel costs and upgrade their travel experience. For $99 a year, cardholders receive benefits like priority boarding, the first checked bag benefit (and for guests), discounts on in-flight purchases, and baggage insurance. The card, however, doesn’t provide access to Delta Sky Club or Delta’s airport lounges.\nThe rewards structure on this card is decent, but it’s nothing to write home about—the card offers 2x miles on just a handful of categories like advertising, shipping, and dining.\nA big benefit of the Delta SkyMiles Gold Business Card is the welcome bonus: 75,000 Bonus Miles after you spend $6,000 in purchases on your new Card in your first 6 months of card opening. And cardholders who use their miles to purchase flights get even more benefits—customers receive a 15% discount when they use miles to buy Delta flights on the Fly Delta app or the Delta website.\nDelta SkyMiles Gold Business Card: Rewards\nThe Delta SkyMiles® Gold Business American Express Card provides higher rewards rates on select purchases that might be helpful to small business owners:\n2x miles on purchases made directly with Delta\n2x miles on U.S. purchases for advertising in select media\n2x miles on U.S. shipping purchases\n2x miles on dining at restaurants\n1x mile on every eligible dollar spent on other purchases\nNew cardholders can receive a welcome bonus of 75,000 Bonus Miles after you spend $6,000 in purchases on your new Card in your first 6 months of card opening.\nHow to redeem Delta SkyMiles Gold Business Card miles\nPurchase flights\nCardholders can use their miles (and their cash) to buy flights. When cardholders book flights through the Fly Delta app or Delta SkyMiles account with their cards, they can get a 15% discount called Takeoff15. Delta has more than 20 airline partners, so cardholders can book through airlines like Air France and Virgin Atlantic—though the 15% discount only applies to Delta and Delta Connection® flights.\nThis discount is a reason to hold onto the card long-term as you could save thousands of miles over the course of a year if you are a heavy Delta user. The best bargains on award flights are found through Delta SkyMiles Award Deals. Recent deals from Seattle (SEA) have included Chicago (ORD) for 8,000 miles or Auckland, New Zealand (AKL) for 64,000 one way in economy plus taxes and fees. Flash sales come and go so it’s a good idea to keep an eye on the site.\nOther options include booking travel through Delta Vacations, using miles for upgrades or even buying champagne at the Delta Sky Club. That said, your best value will most likely be on award tickets.\nRates and fees\nAnnual fee: $0 intro annual fee for the first year (then $99)\n$0 intro annual fee for the first year (then $99) Foreign transaction fee: None\nNone Purchase APR: 20.99%–29.99% variable\nAdditional benefits\nFree first checked bag. Cardholders (and up to nine of their guests) can get the first checked bag for free. The standard bag fee is $30, so if you use this perk more than three times, you’ll save more in bag fees than the annual fee costs you.\nCardholders (and up to nine of their guests) can get the first checked bag for free. The standard bag fee is $30, so if you use this perk more than three times, you’ll save more in bag fees than the annual fee costs you. Main Cabin 1 Priority boarding. Cardholders (and up to nine guests on the reservation) can get priority boarding if they use their SkyMiles number when booking their Delta flights.\nCardholders (and up to nine guests on the reservation) can get priority boarding if they use their SkyMiles number when booking their Delta flights. Flight credit. If cardholders make eligible purchases totaling $10,000 or more in a year, they will receive a $100 Delta eCredit that can be used to purchase Delta flights.\nIf cardholders make eligible purchases totaling $10,000 or more in a year, they will receive a $100 Delta eCredit that can be used to purchase Delta flights. 20% back on in-flight purchases. Cardholders can get 20% back as a statement credit when they purchase eligible pre-purchased meals, in-flight food purchases, alcoholic beverages, and audio headsets on Delta flights.\nCardholders can get 20% back as a statement credit when they purchase eligible pre-purchased meals, in-flight food purchases, alcoholic beverages, and audio headsets on Delta flights. Baggage insurance. Cardholders who purchase plane, train, ship or bus ride tickets with their card are eligible for baggage insurance coverage—which kicks in if your baggage is stolen, lost, or damaged.\nCardholders who purchase plane, train, ship or bus ride tickets with their card are eligible for baggage insurance coverage—which kicks in if your baggage is stolen, lost, or damaged. Car Rental Loss and Damage Insurance. A cardholder can get damage and theft insurance on their car rental. Cardholders must use their card to book the rental and decline the collision damage waiver at the agency to receive it.\nCredit cards similar to Delta SkyMiles Gold Business Card\nCardholders who aren’t loyal to Delta and want more flexible options for redeeming their rewards should consider the Chase Ink Business Preferred® Credit Card, which has a similar annual fee but a more generous welcome bonus and rewards structure.\nInk Business Preferred credit card vs. Delta SkyMiles Gold Business Card\nThe Chase Ink Business Preferred® Credit Card has an annual fee of $95 and a large welcome bonus of 100,000 points after spending $8,000 in the first three months of card opening.\nWith the Ink Business Preferred Card, customers receive 3x points per $1 (up to $150,000 combined) spent on shipping purchases, internet, cable, phone, and advertising with social media sites and search engines. Ultimate Rewards points can be transferred 1:1 to Virgin Atlantic or Flying Blue to book flights on Delta.\nIs the Delta SkyMiles Gold Business Card right for you?\nThe Delta SkyMiles® Gold Business American Express Card is best for business owners who plan to fly with Delta frequently. Many of the card’s perks can be used specifically on Delta flights. It’s a good card to hold on to long-term for the perks and discounts even if your spending is best put on another business card.\nFrequently asked questions\nIs the Delta SkyMiles Gold Business American Express card worth it?\nThe $99 annual fee on the Delta SkyMiles Gold Business American Express card may be worth it for business owners who frequently travel with Delta. The card offers perks like a free checked bag that could easily cover the annual fee.\nHow much is the Delta Gold Business Card annual fee?\nThe Delta Gold Business card has a $99 annual fee, but there’s a $0 intro fee for the first year.\nIs Delta SkyMiles Gold Card hard to get?\nCardholders should aim for a ‘good’ FICO credit score of 690 or better to qualify for the Delta SkyMiles Gold Card, though card issuers look at other factors like income, too.\nPlease note that card details are accurate as of the publish date, but are subject to change at any time at the discretion of the issuer. Please contact the card issuer to verify rates, fees, and benefits before applying.\nTerms apply to American Express benefits and offers. Enrollment may be required for select American Express benefits and offers. Visit americanexpress.com to learn more.\nEligibility and Benefit level varies by Card. Terms, Conditions, and Limitations Apply. Please visit americanexpress.com\/benefitsguide for more details. Underwritten by Amex Assurance Company.\n\nThis article, authored by Trina Paul, was published by Fortune on 2023-12-12 under the category 'business'.\n\n","id":557}
{"title":"Shop 200+ Walmart doorbuster deals for Black Friday","context":"## Shop 200+ Walmart doorbuster deals for Black Friday\n\nTable of Contents Table of Contents What are Walmart's Black Friday hours in 2023? Is Walmart holding a Cyber Monday sale? TV deals Laptop deals Headphone\/earbud deals Tablet deals Smartwatch deals Gaming deals Speaker and soundbar deals Vacuum deals Robot vacuum deals Home and kitchen deals Outdoor deals Apple deals Pet deals Fitness deals Toys and gift deals\nUPDATE: Nov. 25, 2023, 4:00 a.m. EST We've updated this story with the latest deals from the Walmart early Cyber Monday sale.\nEarly birds already know that Walmart launched its first round of Black Friday deals back on Nov. 8 and just dished out another round the day before Thanksgiving. Some of the retailer's most popular rollbacks have already sold out. Leave items in your shopping cart too long and you'll risk losing out on your haul.\nAlthough the official Black Friday programming has kept us busy all month long, the big day has finally arrived — actual Black Friday. If you've held out until now to do your shopping, we've compiled a list of over 180 of the best deals from Walmart's Black Friday sale and highlighted our favorites from different departments. We'll be updating the list throughout Cyber Monday, so keep checking back.\nWhat are Walmart's Black Friday hours in 2023?\nThe days of lining up outside big-box stores on Black Friday eve have officially ended, and we're not sorry. Not only is this kinder on Walmart employees, but it puts the kibosh on the kinds of doorbuster melees that often took place in the past. (They were a national embarrassment.)\nFor 2023, Walmart launched its Black Friday deals online first, with the last round of rollbacks going live Wednesday, Nov. 22 at 3 p.m. ET. In-person shoppers had to wait until Friday, Nov. 24 at 6 a.m. when Walmart stores officially opened their doors, although hours can differ depending on the location. Shoppers will have until 11 p.m. to finish their Black Friday shopping.\nOf course, there's no need to brave the crowds. You can still find the best Walmart Black Friday sales online, and we've got a lot of them for you below.\nIs Walmart holding a Cyber Monday sale?\nGlad you asked. If you don't have time to shop the Black Friday sales or you missed out on a great deal earlier this month, don't you worry. Walmart just announced its official Cyber Monday sale will start on Sunday, Nov. 26 at 7 p.m. ET, exclusively on Walmart.com and the Walmart app. If you're a Walmart+, you can access the sale three hours in advance, starting at 4 p.m. ET. This is the first time Walmart has given early access to Walmart+ members for its Cyber Monday sale (although it usually does for Black Friday). The Cyber Monday sale promises deals on top gifts with savings of up to 80% on apparel, beauty, tech, toys, and more. Stay tuned for the best deals from the sale in the coming days.\nNote: All newly added deals are marked with a ✨. Deals with a strikeout were either sold out or expired at the time of writing.\nTV deals\nWhy we like it\nThe best Walmart Black Friday deals typically include giant rollbacks on TVs, and that tradition continues in 2023. Unfortunately, many popular 4K TVs sold out way before Black Friday officially began, but there are still solid cheap 4K TVs lingering. This 55-inch QLED TV was already affordable at full price and is now seeing an extra $50 discount, pushing it below $350. Thanks to its extra layer of quantum dots, you'll be able to appreciate rich colors and deep blacks even during the day.\nMore TV deals\n43 to 55 inches\n65 inches\n70 to 86 inches\nLaptop deals\nWhy we like it\nThe total discount on this HP laptop isn't the biggest rollback we've seen so far, but it's a deceptively good deal on an underpriced laptop. With an Intel Core i5 processor, this business 2-in-1 will be more than capable of handling your day-to-day work (and after-work streaming and surfing). While supplies last, you can get this device for under $500.\nMore laptop deals\nTraditional laptops\n2-in-1 laptops\nGaming laptops\nHeadphone\/earbud deals\nWhy we like it\nIf you're not ready to make the switch over to USB-C just yet, the second-gen AirPods Pro with a Lightning port are a stellar buy at only $169 — it's their lowest price to date. (For its part, Amazon has never put them on sale for less than $189.) These wireless earbuds from fall 2022 \"sound wonderful and have almost uncanny active noise cancelation,\" said Mashable senior editor Stan Schroeder, and they last for up to six hours on a single charge.\nRead Mashable's review of the Apple AirPods Pro (2nd Generation).\nMore headphone\/earbud deals\nTablet deals\nWhy we like it\nBest tablets under $100? Try best tablets under $30. Sure, this onn. tablet may not have all the functionality of an iPad, but if you're looking for a super basic tablet to watch videos or read on, you'll be hard-pressed to find anything in the $20 range. Even Fire tablets have only dropped down to $40 this Cyber Monday.\nMore tablet deals\nSmartwatch deals\nWhy we like it\nApple's latest entry-level wearable also has a new record-low price at Walmart for Black Friday (which works out to a 28% savings). It's lighter and 20 percent faster than the original Apple Watch SE from 2020, and it features most of the same health tools as the new flagship Apple Watch Series 9 — that includes heart rate notifications, Emergency SOS, Cycle Tracking, and Fall and Crash Detection. It also offers a comparable 18-hour battery life and water resistance.\nMore smartwatch deals\nGaming deals\nWhy we like it\nWith $439 as the new all-time low price for this Xbox bundle, you're basically getting a free copy of Diablo IV on top of a $60 discount on the Series X (which typically sells for $499.99 on its own). The only other retailer that was matching it at the time of writing was the Microsoft Store itself, and its markdown seems to have popped up recently in response to Walmart's doorbuster: A post on the Xbox Wire had previously pegged its Black Friday price there at $509.99.\nRead Mashable's review of the Xbox Series X.\nMore gaming deals\nNintendo Switch\nPlayStation\nXbox\nPC gaming\nVR gaming\nMeta Quest 2 (128GB) — $249 $299.99 (save $50.99) + free $50 Meta Quest Store credit\nOther gaming deals\nSpeaker and soundbar deals\nWhy we like it\nThe older version of our favorite portable Bluetooth speaker is decently loud for its compact size, IPX7-rated for waterproofing, and capable of charging other devices via USB (hence its name) — it's ideal for traveling. It usually retails for $179.95 on the JBL website, meaning Walmart's $89 Black Friday price is an even better deal than advertised.\nMore speaker and soundbar deals\nVacuum deals\nWhy we like it\nDyson's V15 Detect is a cordless stick vacuum with a fancy LCD screen and a bright built-in laser that illuminates tiny crumbs, pet hairs, and dust particles on your floors (so you can be sure you're actually cleaning them thoroughly); the premium Absolute variant has a shiny gold finish, HEPA filtration, and an extra dusting\/crevice tool. Walmart's Black Friday deal saves you 27% and makes it $100 cheaper than the Dyson V12 Detect Slim, which has a smaller dust bin and less suction power.\nRead Mashable's review of the Dyson V15 Detect (non-Absolute).\nMore vacuum deals\nCordless vacuums\nMashable Deals Want more hand-picked deals in your inbox? Sign up for Mashable's daily Deals newsletter. Loading... Sign Me Up By signing up you agree to our Terms of Use and Privacy Policy Thanks for signing up!\nUpright vacuums\nCarpet cleaners\nRobot vacuum deals\nWhy we like it\nThis model of Shark's 2023 Matrix vacuum might just be the most packed standalone robot vacuum you'll find for less than $200 this Black Friday. It maps your home and vacuums and mops the rooms you want it to, offering a more thorough cleaning with Matrix mode. During dry vacuuming, it cleans in a crosshatch pattern to grab any debris missed from the first pass, and during mopping, it scrubs the floor from multiple angles to eat away at stubborn stains.\nMore robot vacuum deals\nHome and kitchen deals\nWhy we like it\nVitamix's professional-quality blenders are great to buy refurbished: You'll save a ton of money while preventing an otherwise serviceable device from going to a landfill. This powerful, 64-ounce Explorian model has three program settings (for Smoothies, Hot Soup, and Frozen Desserts) and a low-profile container that lets it fit under most kitchen countertops. It's been cleaned and tested to work as good as new, save for a few hard-to-see \"micro-scratches,\" and comes with a one-year warranty.\nMore home and kitchen deals\nSmall appliances\nAir purifiers\nCookware\nOutdoor deals\nWhy we like it\nFeaturing a removable ashtray and a lightweight stainless steel design (plus its own carrying case), the Solo Stove Ranger 2.0 is a smaller version of our favorite smokeless fire pit — and yes, it really is virtually smokeless. This bundle throws in a stand that allows it to safely burn on decks or green grass, and it actually retails for $264.99 on the brand's website; Walmart's list price is slightly deflated, so it's an even better deal than it appears to be.\nRead Mashable's review of the Solo Stove Bonfire 2.0.\nMore outdoor deals\nApple deals\nWhy we like it\nThe Apple Watch Series 9 is \"a robust and elite wearable device – the best Apple has ever made,\" according to Mashable Senior Editor Stan Schroeder. While it looks almost identical to its predecessor, it's equipped with a new s9 chip, which makes it about 30 percent snappier than before. It also boasts double the storage and has double the peak brightness and a fun new Double Tap feature. It's not an essential upgrade if you already have a Series 7 or 8, but it's certainly a step in the right direction for those with older watches. At $359 for the 45mm GPS version, it's currently sitting at an all-time low cost at Walmart.\nMore Apple deals\nPet deals\nWhy we like it\nA solid dog tracking device for pet parents on a budget, Tractive gives you the ability to track your dog's live location within the companion app. It also allows you to set up a virtual fence and notifies you when your pet steps out of (or enters) the safe area. It's not perfect — the battery is just so-so and the live tracking can be a bit glitchy — but for the price, it's hard to beat. Save $20 for Black Friday at Walmart and snag it for only $29.99.\nMore pet deals\nFitness deals\nWhy we like it\nThe Walmart-exclusive Echelon Connect Sport is a solid Peloton alternative for a retail price that won't make you cringe. And for Black Friday, it's on sale for over $400 off, knocking the price down to a super impressive $297. But just because it's wallet-friendly doesn't mean its specs don't impress. The Connect Sport features 32 levels of silent magnetic resistance, aero handlebars and adjustable pedals, and Bluetooth technology that lets you connect any smart device to the Echelon Fit app. Speaking of which, the app gives you access to 40+ daily live and 15,000+ on-demand connected fitness classes. The $297 Black Friday cost even includes a 30-day free trial of Echelon Premier membership to get you started.\nMore fitness deals\nToys and gift deals\nWhy we like it\nIn days gone by, Walmart's Black Friday sale was full of 40% or higher discounts, but the era of the doorbuster deal is ending. And that's why it's so refreshing to see a full 50% discount on a popular item like this. The LEGO Star Wars line includes tons of great gift ideas for fans of all ages, from Jedis to Padawans. This building kit of The Child, aka Baby Yoda, is just begging to live on your office desk.\nMore deals on toys and gifts\n\nThis article was published by Mashable on 2023-11-25 under the category 'entertainment'.\n\n","id":558}
{"title":"Travis Kelce admits the NFL is overdoing it with their Taylor Swift coverage","context":"## Travis Kelce admits the NFL is overdoing it with their Taylor Swift coverage\n\nStay ahead of the trend in fashion and beyond with our free weekly Lifestyle Edit newsletter Stay ahead of the trend in fashion and beyond with our free weekly Lifestyle Edit newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nLifestyle Edit email {{ #verifyErrors }} {{ message }} {{ \/verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ \/verifyErrors }}\nTravis Kelce believes the National Football League’s coverage of his rumoured girlfriend Taylor Swift is a bit too much.\nFollowing his game against the New York Jets on 1 October, the 33-year-old Kansas City Chiefs tight end opened up about the NFL broadcast on the most recent episode of his podcast, New Heights with Jason and Travis Kelce. In conversation with his brother Jason, 35, the two addressed concerns from longtime football enthusiasts who were frustrated by the constant Swift references throughout Sunday’s game at MetLife Stadium.\nNot only did the football league promote last Sunday’s game by speculating whether the Grammy winner will attend the Chiefs-Jets match, but cameras were constantly panning to the star-studded suite. During the game, Swift was joined an A-list group of guests, including her best friends Blake Lively and Ryan Reynolds, Game of Thrones star Sophie Turner, and actor Hugh Jackman.\nThe NFL also introduced a special segment with Carson Daly and The Voice, where the famed host attempted to explain the specifics of football to “Swifties.”\nIn the New Heights podcase episode, titled “The NFL Needs to Calm Down”, Jason asked his brother plainly whether he thought the football was “overdoing it” with the coverage of Swift during the game.\n“I think everybody is just, like, overwhelmed,” the Chiefs tight end replied.\n“Take away your feelings for Taylor,” Jason added. “What is your honest opinion on how the NFL is treating celebrities at the games?”\nSeemingly beating around the bush, Kelce remarked: “I think it brings a little more to the atmosphere, it brings a little bit more to what you’re watching. But at the same time, I think...”\nBefore his younger brother could continue his thought, the Philadelphia Eagles player chimed in: “They’re overdoing it.”\n“They’re overdoing it a little bit, for sure,” Kelce agreed. “Especially my situation. I think they’re just trying to have fun with it.”\nWhile sports lovers may not be too pleased with the NFL’s focus on Swift, the football league’s supposed obsession with ongoing Swift and Kelce dating rumours has paid off in terms of ratings. Per a Deadline report, NBC accumulated an average of 27m viewers, with a total of 29m tuning in during the second quarter.\n“That’s gotta be an NFL record right there,” Jason told his younger brother, as he noted that about two million viewers were estimated to be female. “I think a few of them might have been there for Deadpool and, uh, Taylor.”\nIn the YouTube comments under the New Heights video podcast, fellow fans shared their opinions on the NFL’s coverage. “I agree the NFL needs to calm down. Pissing off football fans is not how you repay your boi [sic] for all he’s done for the sport,” one person wrote.\nAnother remarked: “Pity Taylor. All she ever wanted was to watch the football game. Now she’s being blamed and hated left and right.”\n“The NFL needs to seriously tone it down and let Trav and Tay explore this beautiful thing they have going on in peace,” someone else said.\nElsewhere in the podcast, the brothers revealed the one person who was most delighted to see famous musicians, actors, and professional athletes all coming together for Sunday’s game was none other than “Mama Kelce,” aka Donna Kelce. On 1 October, the NFL players’ mother travelled from Philadelphia to New Jersey to watch both her sons play football on the same day.\n“She’s been on top of the f***ing world, man,” Kelce told his older brother. He also acknowledged how his mother seemed to be loving the new guests in her family suite, watching her son play along with her. “I know mom enjoyed it,” Kelce confessed.\n“I shot her a text. I didn’t get a chance to see her, so I shot her a text right after the game on the bus ride to the airport and was like: ‘Hey, mom, sorry I didn’t get to catch you before I left but I hope you enjoyed the game,’” he continued. “I appreciate you always trying to make it to both of our games.”\n“She also told me thank you because she was in an alternate universe, she was sitting there with Deadpooland Wolverine,” Kelce added, referencing Reynolds’ and Jackman’s respective superhero movie characters. “It was a hot ticket, man, you know what I’m saying? That suite was rockin’.\n“They were enjoying themselves. Somebody told me that everybody was enjoying themselves in that suite,” Kelce said.\nNot only has NFL viewership increased since Swift began attending her rumoured boyfriend’s games, but jersey sales for the Chiefs tight end have reportedly spiked by 400 per cent, according to a report from the NFL’s e-commerce partner, Fanatics.\nFollowing critcism the league is focusing too much on Swift, the NFL responded with an official statement handed to People on 4 October.\n“We frequently change our bios and profile imagery based on what’s happening in and around our games, as well as culturally,” the message read. “The Taylor Swift and Travis Kelce news has been a pop cultural moment we’ve leaned into in real time, as it’s an intersection of sport and entertainment, and we’ve seen an incredible amount of positivity around the sport.”\n“The vast majority of our content has remained focused on the game, our players and variety of other initiatives, including our Toy Story Funday Football alt-cast, the international games and more,” they continued.\n\nThis article, authored by Kaleigh Werner, was published by The Independent - Life and Style on 2023-10-04 under the category 'entertainment'.\n\n","id":559}