{"title":"'They seemed primed to take over': How the Great Dying doomed the 'beast tooth' and set the stage for the dawn of the dinosaurs","context":"## 'They seemed primed to take over': How the Great Dying doomed the 'beast tooth' and set the stage for the dawn of the dinosaurs\n\nInostrancevia is a genus from the extinct group Theriodontia that appeared during the Middle Permian. (Image credit: Stocktrek Images\/Getty Images)\nThe excerpt below is taken from \"Our Fragile Moment: How Lessons from Earth's Past Can Help Us Survive the Climate Crisis\" (Hachette Book Group, 2023), by Michael Mann. It looks at how climate change following the Cambrian explosion caused the biggest mass extinction on Earth — dooming the creatures set to dominate and set the stage for dinosaurs to rule.\nThe mechanisms that can freeze the planet, as was the case with Snowball Earth can also lead to inhospitably hot climates, when enough carbon dioxide enters the atmosphere. Arguably the greatest extinction event of all time — called the Great Dying — appears to have resulted, at least in part, from a massive heat-inducing release of carbon into the atmosphere 250 million years ago.\nIs this ancient event a possible analog for a sixth, human-caused, climate-change-driven mass extinction today? In answering this question, we will at times work our way through some details of the science, but the payoff is that we will see not just that scientists are able to unravel such mysteries, but how they do it.\nIn the late Proterozoic eon, around 550 million years ago, Earth had thawed out from a series of major glaciations, perhaps even global snowball conditions. The end of the Proterozoic marked the beginning of a brand new era — the Paleozoic, which extended from around 540 million to 251 million years ago.\nThe first period of the Paleozoic — the Cambrian — saw a remarkable explosion in the diversity of life, known, appropriately, as the Cambrian explosion. Most of the life that exists today emerged during the first 10 million years of that period, including the first complex multicellular life and familiar groups such as mollusks and crustaceans.\nThe ancient supercontinent of Gondwana, which formed around 600 million years ago. (Image credit: Mark Garlick\/Science Photo Library\/Getty Images)\nAmong the reasons for this remarkable diversification was a sustained rise in oxygen from photosynthetic life. Higher levels of oxygen allowed for more diverse, multicellular organisms because they require oxygen in high enough concentrations that it can reach interior cells. The stratospheric ozone layer, which had developed during the Neoproterozoic era (1 billion to 538 million years ago), protected animals from the sun's damaging ultraviolet rays and helped populate the land. Some researchers even argue for a possible \"bottleneck\" effect, where the few life-forms that survived the Neoproterozoic ice ages (Snowball Earth or not) were able to rapidly fill emerging niches as Earth thawed.\nRelated: 'Once again, innovation and proliferation ended with catastrophe': The environmental disaster of plants taking over the world\nA major glacial event occurred at the end of the following period of the Paleozoic, the Ordovician, around 450 million years ago, as chemical weathering outpaced the volcanic emissions of gas and atmospheric CO2 levels dropped. The resulting cooling caused a buildup in ice mass on the large South Pole–centered supercontinent of Gondwana. Sea levels dropped. Much of the coastal habitat that had been home to primitive mollusks and crustaceans disappeared. Some of the creatures scraped by, but about half of all existing genuses perished. Much as we can only wonder today what knowledge was lost in the ransacking of the Library of Alexandria, we can also ponder what sort of magnificent creatures born of the Cambrian explosion were lost. Welcome to the first of the widely recognized global mass extinction events. It will hardly be the last we encounter.\nThe most well-known extinction event ended the reign of the dinosaurs roughly 66 million years ago. But the deadliest extinction event took place at the end of the Permian period, roughly 250 million years ago. It is referred to in the scientific community as the Permian-Triassic (or P-T for short) extinction, but because an estimated 90% of all Permian species disappeared from the face of the planet, it has earned a nickname: the Great Dying. Marine organisms were hit especially hard, with 96% of species perishing. Gone were the trilobites so familiar to amateur fossil collectors everywhere — primitive arthropods that were the distant ancestors of the modern horseshoe crab. Having survived the earlier Ordovician extinction event, their own nearly 300-million-year moment had come to an end.\nA giant dragonfly from the Carboniferous period that was wiped out in the Great Dying mass extinction. (Image credit: Mark Garlick\/Science Photo Library\/Getty Images)\nNot only were the vast majority of marine invertebrates gone, but so were the earliest fish species. On land, more than two thirds of amphibian and reptile species and nearly one third of insect species were wiped out. Another iconic species, a giant dragonfly called Meganeuropsis with a nearly three-foot (0.9 meter) wingspan that is often included in artist depictions of the Carboniferous period — and to this day still haunts my nightmares — was now gone.\nThe P-T extinction event wiped out many of the groups that had dominated life on land, freeing up ecological niches to be filled by new organisms, including reptiles such as crocodiles and the earliest dinosaurs. Once again, there were both winners and losers. Who won and who lost, in this case, came down to geology and geochemical weathering cycles.\nDinosaurs, it turns out, were direct beneficiaries of the P-T extinction event.\nMidway through the Paleozoic, around 420 million years ago, we saw the emergence of plants with roots, stems, and leaves, which as we now know helped accelerate chemical weathering by producing acids that dissolve rock, helping cycle water from the soil back into the atmosphere. This may have led to a slow, steady decrease in atmospheric CO2 levels through the late Paleozoic. The spread of these vascular plants, however, also led to a new source of organic matter that could be buried on land or carried off in rivers for ocean burial. Increased burial of organic matter causes rising atmospheric oxygen levels because that organic matter is the product of photosynthesis, which splits up oxygen and carbon atoms. The carbon, once buried, is no longer available to cannibalize the liberated oxygen. In the Paleozoic, oxygen concentrations climbed as high as 35% (almost twice the current concentration of 21%).\nThose high oxygen levels favored synapsids, creatures with a high metabolism, featuring a single hole in each side of their skull that led to improved jaw function. They were part of a diverse group of four-legged terrestrial animals, including carnivores, insectivores, and herbivores, that first arose in the late Carboniferous and would evolve into the group we today know as mammals.\nSkull of a Rubidgeinae, an extinct subfamily of gorgonopsid therapsids. (Image credit: RMDobson\/Getty Images)\nBy the early Permian, they were the dominant terrestrial species. By the mid-Permian, another group of proto-mammals — the possibly warm-blooded, somewhat rodent-like therapsids — emerged and became the new dominant species. By the late Permian, they may have even developed fur. One group, known as Theriodontia (Latin for \"beast tooth\"), displayed a number of evolutionary innovations: A shift in the bones supporting the jaw allowed the jaw to open wider, and may have aided hearing as well. The skull and teeth became larger, the teeth more specialized, and the jaw more powerful. They seemed primed to take over. But it was not to be.\nEverything changed at the Permian-Triassic boundary. Levels of CO2 spiked. That led to massive warming. Plate tectonics by now had brought all the continents together into a single giant continent — Pangea — straddled across the equator. It was already difficult for maritime moisture to penetrate deep into the center of the continent. Rapid greenhouse warming made it even hotter and drier, according both to climate model simulations of the end of the Permian and analyses of the fossil river deposits from Pangean floodplains. The sudden drying would have led to the massive die-off of the tenuous, moisture-dependent forests that had arisen over the course of the Paleozoic. That meant less burial of organic matter on land, assisted perhaps by decreased carbon export to the deep oceans due to a collapsing marine food web. Atmospheric oxygen levels appear to have dropped precipitously as a result, reaching concentrations as low as 15% at the P-T boundary.\nPlummeting oxygen levels helped dinosaurs become the dominant group on Earth. (Image credit: Roger Harris\/SPL\/Getty Images)\nThe drop in oxygen was a further contributor to the mass die-off. The combination of greenhouse warming and low oxygen would have led to widespread hypoxia — a state where organisms simply cannot take in enough oxygen to support metabolism. That's where the dinosaurs come in. The proto-mammals that had come to dominance during the Permian — the synapsids and therapsids — had thrived off high oxygen levels. But as oxygen concentrations dropped, they were now poorly suited to their environment.\nEnter the diapsids, a wide-ranging group of tetrapod vertebrates that first emerged during the Carboniferous around 300 million years ago. They include the reptiles, birds, and now-extinct dinosaurs. What distinguished them from their relatives, the synapsids and therapsids, was the presence of two holes (instead of one) on each side of their skull. One subgroup of synapsids, known as archosaurs — which includes crocodilians and the earliest dinosaurs — exploited that innovation to develop a more efficient respiratory system that could make more effective use of the available oxygen. That gave them a leg up on the competition when oxygen levels plummeted at the P-T boundary. Dinosaurs, it turns out, were direct beneficiaries of the P-T extinction event.\nOnly a handful of proto-mammals survived. One group that did was known as Cynodontia (\"dog teeth\"). They were our ancestors, and the ancestors of all mammals. At first, they probably looked somewhat like a huge, scaly rat, growing to as much as six feet (1.8 m) in length. Truly a Rodent of Unusual Size if ever there was one. But by the end of the Triassic, they had shrunk to the size of modern-day field mice, hiding behind rocks from their reptilian predators.\nExcerpted from \"Our Fragile Moment: How Lessons from Earth's Past Can Help Us Survive the Climate Crisis\" by Michael E. Mann. Copyright © 2023. Available from PublicAffairs, an imprint of Hachette Book Group, Inc.\n\nThis article was published by Live Science: The Most Interesting Articles on 2023-10-01 under the category 'science'.\n\n","id":460}
{"title":"The new, ‘efficient’ Spotify has a very different approach to podcasting","context":"## The new, ‘efficient’ Spotify has a very different approach to podcasting\n\nThis is Hot Pod, The Verge’s newsletter about podcasting and the audio industry. Sign up here for more.\nIn pursuit of profit, Spotify looks to AI rather than original content for its podcasting future\nSpotify shareholders are thrilled with the company reporting an operating profit for the first time in a year, sending the stock up nearly 10 percent on the news. The revenue bump was in large part due to the streamer’s $1 price increase earlier this year, but executives also pointed to the downsizing of the podcast operation — which included hundreds of layoffs and the dissolution of Gimlet and Parcast — as a contributing factor. The adage that “content is king” no longer applies, with Spotify increasingly focusing on tools that will scale the business rather than content that will attract listeners.\nIn a call with investors, CFO Paul Vogel said that after being a real “drag” on profit margins in the past, podcasting will soon break even and turn toward profitability. CEO Daniel Ek echoed that sentiment. “We’re constantly finding new ways to bring more efficiencies out of the business… We’ve seen some improvements, but you should expect us to continue to look for more improvements going forward because that’s just our modus operandi.”\nWhile Ek and Vogel really hammered that “efficiency” theme (according to my transcript, they said the word more than 30 times over the course of the 50-minute call), what was left unsaid about podcasting spoke louder. In the past, they would excitedly tout how many millions of podcasts were on the platform, the latest new celebrity show, and the area’s explosive growth. But as investors have run out of patience for the time and money such ambitions required, the company’s leadership changed its tune.\nRather than emphasizing, say, its new revenue sharing deal with Trevor Noah or the reliability of The Ringer, Ek pointed to Spotify’s new AI-driven translation product. He pointed to the automatic translation tool as a way of seamlessly scaling podcasts and increasing the amount of content in non-English speaking markets. He also expects AI will be a boon for podcast advertising, as well.\n“Creating a great audio ad is something that’s quite costly and quite expensive for marketers to do,” he said. “What generative AI has the promise to do is allow for that creative cost to come down… It [also] allows you to scale that creative in unimaginable ways. You can translate whatever creative you had into lots of different languages; you can use the same voice actor; but instead of producing one or two ads, you can have 1,000 or 10,000 or even 100,000 ads that are individually created to each user.”\nI would take that with a grain of salt (we know Ek loves to dream big!!), but it does underscore the newest iteration of Spotify’s podcasting business — leaner, less splash, and more scale. It doesn’t mean that Spotify’s contributions to podcasting will be insignificant — as one audio industry professional said to me, the translation thing could be a total game-changer for the medium (if it’s not a complete dud). But we should not expect those contributions to come in the form of original content.\nThe main question I am left with after these results is where Spotify’s licensing deals fit in. I wish during the call that someone had asked Ek about the plan for big-name talent like Joe Rogan, Alex Cooper, and Dax Shepard as their deals come up for renewal. On one hand, they have the scale (Rogan especially). On the other, they cost a chunk of cash (... Rogan especially). I will have more on this later this week, but it will be interesting to see how much Spotify and its investors can stomach spending on the biggest names in podcasting.\nWondery puts its podcasts on TV\nThat’s certainly one way to get podcasts to the masses. Wondery, which is owned by Amazon, will make many of its podcasts available on three new channels on Freevee, an ad-supported video streaming service also owned by Amazon that was formerly known as IMDb TV (yes, Amazon owns IMDb, too).\nOn October 31st, Freevee will launch three dedicated Wondery channels: a flagship channel focused on entertainment programming like Baby, This is Keke Palmer, Business Wars, and American Scandal; Exhibit C, which will feature true crime shows like This is Actually Happening, Dr. Death, and Morbid; Wondery; and Wondery Sports, with shows including Don’t Call It a Comeback and Gladiator. The visuals will be a mix of on-camera recordings, animations, and show art — but I wouldn’t bank on that being the main draw.\nIt’s an interesting strategy for discovery, though I am not sure how replicable it is beyond Amazon. If it is successful, I could see a situation where other AVODs license podcast programming (it’s certainly cheaper than video), but Amazon is in the unique situation where it owns the whole pipeline, so there is not much risk here.\nJoe Rogan Experience is the most-searched podcast, followed by Call Her Daddy and This American Life\nPodBam released a list of the 40 most-searched podcasts, and it is no surprise that Rogan is number one. The Joe Rogan Experience averaged 135,000 monthly searches on Google, followed by Call Her Daddy with 106,000 and This American Life with 81,000.\n\nThis article, authored by Ariel Shapiro, was published by The Verge on 2023-10-25 under the category 'technology'.\n\n","id":461}
{"title":"Concert movies are the future of pop music fandom","context":"## Concert movies are the future of pop music fandom\n\nConcert tickets are more expensive than ever. Inflation, Ticketmaster’s monopolistic practices, and increased demand after COVID-related touring delays have coincided to create a perfect storm of ticket-buying agony. Tours were never accessible to everyone: Geography, economics, health and safety concerns, and physical or mental ability make stadium and arena concerts — held only in major metropolitan areas, and only in certain countries — infeasible and\/or unaffordable for large swaths of global pop music fandom. As fandom’s role as a source of identity and community becomes more precious, and more people than ever want to see certain concerts, the barriers to attending live shows are rising — so it’s no wonder that concert films are finding expansive new footing.\nTake Taylor Swift: The Eras Tour, an almost three-hour filmed version of the pop star’s ongoing concert tour. The movie is now the highest-grossing concert film of all time. That isn’t just because of Taylor Swift’s expansive fandom — it’s a direct response to the difficulty of getting tickets to her shows. For fans, The Eras Tour offered up-close, intimate access to a show they never would have been able to attend otherwise.\nIn July, Pitchfork reported that the average cost of a ticket for the North American leg of Swift’s Eras Tour was $3,801 — a 2,321% increase from her 2018 Reputation Stadium Tour, where the average resale price for North American shows was $157. Taylor Swift: The Eras Tour tickets are $19.89 for adults. And people buying those tickets don’t even have to wait in the Ticketmaster queue of terror.\nIn February, one of the other biggest musical artists in the world, K-pop septet BTS, released a filmed version of their “Yet to Come” concert, which had been a one-night-only performance for 50,000 lucky fans in Busan, South Korea. The concert film made more than $50 million worldwide, even though the show had previously been streamed via Korean platform Weverse, allowing a reported 49 million fans to watch at home.\nSeeing a concert film in a movie theater isn’t the same as attending a live concert, but it isn’t an inherently lesser experience, either. At least, it isn’t for me, and I attended the Yet to Come concert both in person and in cinemas.\nThe concert film experience has value past its re-creation of a specific intersection of place, time, and performance. I went to theaters to relive the once-in-a-lifetime experience of seeing the show live, but the film version was also its own unique collective fan experience. While I don’t think I need to expound on the glories of in-person shows — concerts are awesome, and BTS is very good at them — some aspects of the filmed version gave me new insight into my own live experience.\nIt also let me revisit it without any of the anxiety that often comes with a stadium concert experience. The logistics of getting 50,000 people into a 20-year-old stadium for the Yet to Come show weren’t simple. By the time the members of BTS took the stage in Busan, most of us had been in line for hours with limited access to bathrooms, water, or information about what was going on.\nOnce the concert started, conditions in the 3,000-strong standing areas got intense, as fans pushed toward the stage, crowding people at the front and prompting BTS to alter plans to come down into the audience for their performance of their 2018 hit “IDOL.” This wasn’t my first chaotic, stressful in-person stadium concert experience, and I doubt it will be my last. I’m able and willing to make this trade for the chance to see my favorite musical group perform, but not everyone is, even if they could get tickets.\nWatching the movie version of Yet to Come, I was able to show up at the theater just 20 minutes before showtime. My BTS fan friends and I were all able to go together this time. And we watched the film in a theater full of fellow fans, BTS lightsticks in hand and BT21 Tata headband on head, giving us the same sense of fandom camaraderie as the in-person concert.\nI missed some of the freedom of the in-person concert experience, like being able to choose where to direct my attention across the expansive stage, bedecked with intricate sets calling back to different eras in BTS history. But the clarity and focus of the detail in the concert film helped even the score. At the film, I got a much closer view of the choreography and the BTS members’ interaction, with a close-up camera intimacy I hadn’t gotten in person. I was sharing those fandom moments not only with the other people in my cinema, but with the millions of other fans viewing the same concert film around the world. Yet to Come will stream on Amazon Prime Video starting Nov. 9, further expanding the number of fans who will be able to see it.\nFans usually assume the live experience is superior to the filmed version, but in a time when in-person community is harder to come by than ever and can sometimes mean pushing people’s financial and\/or physical limits, a filmed concert can feel like a gift. BTS, Taylor Swift, and Beyoncé — whose concert film Renaissance: A Film by Beyoncé hits theaters in December — all have massive fandoms. But we’re geographically scattered, and often stigmatized by a mainstream culture that belittles female-driven fan culture. I go to a BTS concert to see BTS perform, but also to be among other BTS fans, who already understand why I care so much about a Korean boy band. We trade freebies and photocards, help each other set up our lightsticks, and share our favorite songs or members. Whether in a stadium in Korea or a cinema at my local mall, I go to these events to feel that sense of belonging.\nAttending a concert in person is sometimes used as a way to enforce a kind of fandom hierarchy, as if attending a concert in person makes you a bigger fan. It doesn’t. Fans who are able to attend the stadium and arena concerts for the biggest musical artists in the world aren’t necessarily more passionate. They just have a combination of luck and privilege that others lack. But concert films are leveling the field, dropping some of the barriers of price, location, and accessibility. They may not be the future of pop music for everyone, but they are increasingly looking like the future of pop music fandom. And that’s a good thing. Pop music fandom is a way for us to find collective joy and connection in art, and I want anyone who wants in to be able to join the party.\n\nThis article, authored by Kayti Burt, was published by Polygon on 2023-11-07 under the category 'entertainment'.\n\n","id":462}
{"title":"From FAPE\/PEAC to PhilEd","context":"## From FAPE\/PEAC to PhilEd\n\nWe recently presented a paper at the 5th Paderanga-Varela Memorial Lecture entitled “Alternate Service Delivery Systems: Health and Education.” In that lecture, we looked at the Department of Health (DoH) and the Department of Education (DepEd) as service delivery systems, delivering healthcare and education respectively.\nWe concluded that the service delivery system of the DoH is far superior to the DepEd for two main reasons. The first is that the DoH has devolved its hospitals to the local government units while the DepEd has not. Secondly, the DoH has spun off its health financing into the Philippine Health Insurance Corp. (PhilHealth) while the DepEd has not. In this article we argue for the creation of the Philippine Education Development Fund (PhilEd).\nWhen Isidro Consunji, President of DMCI Holdings, Inc. was asked by his officers what the role of his Chief Financial Officer (CFO) would be, he gave a three-word answer, “Fund my dreams.”\nLikewise the role of PhilEd would be to fund the education dreams of all Filipinos especially the neediest and most deserving.\nFilipinos have three dreams in education. The first is to enroll in a chosen course in the school of their choice. This dream will be funded by the School Vouchers Program which will now be transferred from DepEd to PhilEd.\nThe second dream, especially for Filipino parents, is to save enough money to fund the college education of their children, hence the prevalence of pre-need Educational Plans. Unfortunately, most of the pre-need companies went into bankruptcies causing financial ruin and emotional distress to their plan holders. There has been a massive market failure and so government must intervene. But intervention should not involve the government offering educational plans but rather in insuring these plans. Just as the Philippine Deposit Insurance Corp. (PDIC) insures the bank deposits of Filipinos, so will the PhilEd insure their educational plans. Just like PDIC which is funded from the premiums paid by the banks, PhilEd will fund this program from the premiums by the educational plan companies. PhilEd will be ideally suited to do this as it could swap the failed educational plans with school vouchers from its repository of school vouchers.\nThe third dream is based on the realization of Filipino school graduates that their learning must continue even as they leave their alma maters. For in this modern age, the fount of personal knowledge must continuously be replenished. In healthcare, we have the Health Maintenance Organizations (HMOs) which continuously monitor and minister to our health. We need Lifelong Learning Organizations (LLOs) to continuously monitor and minister to our learning. HMOs exist in the Philippines. LLOs do not. In partnership with the international development agencies and the private sector, PhilEd will create this industry. The international development agencies will provide the technical assistance grants that will create the developmental and regulatory framework for the industry while the private sector will organize the LLOs. PhilEd will be the “bastonero” or project manager, managing the project as well as mobilizing government support and assistance.\nFAPE or the Fund for Assistance to Private Education was a part of the Special Fund for Education set aside by the American government in 1963 from the surplus funds authorized by the War Damage Act of 1962 and organized under Executive Order 156 issued by President Ferdinand Marcos on Nov. 5, 1968.\nFrom the initial seed money of $6,154,000 or P215 million (based on the 1968 peso to dollar exchange rate), the FAPE fund in 55 years had barely grown to P277 million. In contrast the trustees managing the fund have expanded their services, basically as service provider to the DepEd. As a consequence, it has been spun off as a separate organization, the Private Education Assistance Committee (PEAC).\nOver the years, PEAC has evolved into co-implementing externally funded programs, namely the DepEd’s Education Service Contracting (ESC), Teachers’ Salary Subsidy (TSS), the SHS Voucher Program (SHS VP), the In-Service Training (INSET), and the Bayanihan for Basic Education (BBE) as well as implementing internally funded programs of assistance for private education in the areas of training, school quality assurance, school improvement programs, and grants programs.\nIn sum, the PEAC has been an effective instrument to operationalize “complementarity” between private and public schools as provided in the Philippine Constitution. It has also been an incorruptible partner of the education agencies in efficiently co-implementing national subsidy programs for students and teachers in private schools.\nWe propose that FAPE\/PEAC structure and organization be moved to PhilEd. Operationally this would mean folding into PhilEd, the roles and responsibilities of FAPE and PEAC as well as their financial resources.\nFolding FAPE\/PEAC into PhilEd would mean the transfer of the funds of FAPE amounting to P277 million as of May 31, 2022 as well as the assets and liabilities of PEAC amounting to P567 million as of May 31, 2022.\nThe DepEd programs presently being managed by PEAC and lodged in the DepEd budget such as the Educational Service Contracting (ESC) of P9.3 billion in School Year 2021-2022, the Senior High School Voucher Program of P20.3 billion in School Year 2021-2022, and the Teachers Salaries’ Subsidy of P793 million in School Year 2021-2022 will now be lodged in PhilEd.\nThe present Board of Trustees of the Fund which consists of the Secretary of Education as Chairman with the Director-General of the National Economic and Development Authority, the three Presidents of the Association of Christian Schools, Colleges and Universities (ACSCU), the Catholic Educational Association of the Philippines (CEAP) and the Philippine Association of Colleges and Universities (PACU) shall also constitute the proposed Board of Trustees of the PhilEd.\nThe management team of PEAC will be the incoming management team of PhilEd.\nInterestingly, PhilHealth, in addition to premiums collected from members as well as subsidies from local governments who have enrolled indigents in the program, receives a share of the “sin taxes” collected from Tobacco and Sugar Sweetened Beverage. The justification for this is that tobacco smokers and sugar sweetened beverage drinkers impose an additional burden on the healthcare system of the Filipinos and so must contribute to their health services. In Fiscal Year 2022, this amounted to P74 billion.\nMoreover, under the Universal Health Care Law, PhilHealth receives 50% of the government share from the income of the Philippine Amusement Gaming Corp. (PAGCOR) as well as 40% of the Charity Fund of the Philippine Charity Sweepstakes Office (PCSO). In 2022, this amounted to P188 billion.\nIn like manner, in addition to the school vouchers funded under the Expanded Government Assistance to Students and Teachers in Private Education Act, we suggest that PhilEd be allocated a share of the taxes imposed on our extractive industries. This is based on the argument that the depletion of our natural resources can only be justified if the taxes collected will enhance our human resources.\nLike PhilHealth, PhilEd could also be mandated to receive a percentage from the collection of documentary stamps which have recently been raised.\nFinally, PhilEd can be given access to the Special Education Funds of the local school boards of the Local Government.\nCongress enacted Republic Act 7875, known as “The National Health Insurance Act of 1995,” which created PhilHealth. We are hoping some members of Congress would file a Universal Education Financing Law which would create PhilEd.\nDr. Victor S. Limlingan is a retired professor of AIM and a fellow of the Foundation for Economic Freedom. He is presently chairman of Cristina Research Foundation, a public policy adviser and Regina Capital Development Corp., a member of the Philippine Stock Exchange.\n\nThis article, authored by BusinessWorld, was published by Business World on 2023-11-12 under the category 'business'.\n\n","id":463}
{"title":"Hipgnosis Songs Fund Chair, Andrew Sutch, to step down; all-important ‘continuation vote’ likely to take place on October 26","context":"## Hipgnosis Songs Fund Chair, Andrew Sutch, to step down; all-important ‘continuation vote’ likely to take place on October 26\n\nHipgnosis Songs Fund (HSF), the UK-listed music rights fund, looks likely to hold its all-important 2023 ‘continuation vote’ on Thursday, October 26, according to an announcement from the firm today.\nWhy’s that ‘likely’ rather than ‘definitely’? Because there’s still a possibility it might get bumped into November – the reasons for which we’ll get into later in this article.\nThe ‘continuation vote’ will take place at HSF’s Annual General Meeting (AGM), and will see the firm’s shareholders vote on whether to keep the entity going as a closed-ended investment entity i.e. a publicly-traded bundle of music rights.\nHow will that vote go? Obviously we don’t know yet – and there’s the small matter of a $440 million transaction looming that could potentially influence things.\nEven so: one wonders if some new changes at HSF, announced today, are related to this ‘continuation vote’ – and whether or not they amount to concessions to help keep HSF investors happy and confident in the firm’s long-term prospects… and voting ‘yes, let’s keep going’.\nThe shareholder frustration: NAV vs. public market\nFirst, a bit of important context.\nThe fundamental revenue performance of HSF doesn’t seem to be under scrutiny from shareholders: the company posted its best-ever revenues in the 12 months to end of March, while streaming ‘pro-forma’ revenue was up 14.8% YoY in calendar 2022.\nWhere HSF shareholders – as well as its management – are finding frustration is in the current gulf between the firm’s ‘operative Net Asset Value’ (‘operative NAV’) and its value on the public market (i.e. its share price).\nFor example: On September 14, HSF’s market cap stood at approximately GBP £1.125 billion, which represented a 40% discount on the firm’s operative NAV of USD $2.316 billion as of the end of March this year.\n(Said ‘operative NAV’ was calculated by an independent valuer – Citrin Cooperman – using a discount rate of 8.5%.)\nThis is where the importance of that potential $440 million transaction comes in.\nAs MBW reported earlier this month, Hipgnosis Songs Fund’s shareholders are currently considering a proposal to sell 29 of the company’s catalogs to another Hipgnosis company – the Blackstone-backed Hipgnosis Songs Capital (HSC) – for USD $440 million.\nThat potential transaction is being managed for both HSF and HSC by two separate teams within their mutual investment advisor, Hipgnosis Song Management (HSM), which is run and part-owned by Merck Mercuriadis.\nWhen it announced its intention to explore the $440 million catalog sale to HSC two weeks ago, Hipgnosis Songs Fund confirmed that one of its motivating factors was that the transaction could potentially act “as a catalyst for a re-rating of [HSF’s] share price”.\nAka: Increasing that share price to bring it up closer to the current operative NAV of the company.\nHSC’s $440 million offer to acquire the 29 catalogs, HSF confirmed earlier this month, equates to a 26% increase on the amount HSF paid for those catalogs to acquire them in the past.\nThe $440 million price also reflects a +51% premium on the value of the 29 catalogs implied by Hipgnosis Songs Fund’s public market cap for the 30 days ending September 13.\nWhat happened today?\nAmongst the news confirmed by HSF today (September 28) is that the firm’s Chair of its board since 2018, Andrew Sutch, 73, is stepping down, both as HSF board Chair and as a director of the company.\nHSF says it’s begun a process to recruit a new Chair; Sutch (pictured inset) will leave his post as and when this person is hired, or in any case before HSF’s AGM next year (in Q4 2024).\nIn addition, Andrew Wilkinson, 72, has informed the HSF board of his intention to retire as a board director, which will reduce the company’s board to five directors.\nHSF also confirmed a number of other new measures in a ‘circular’ to its shareholders today.\nThese measures included the fact that, if Hipgnosis Songs Fund shareholders vote to remain a publicly-traded fund (via that 2023 ‘continuation vote’) at the firm’s next AGM, then another ‘continuation vote’ will be put in front of HSF shareholders at an Extraordinary General Meeting in January 2026.\n(The ‘continuation vote’ that will take place in Q4 2023 has been scheduled ever since HSF went public in 2018 – i.e. five years after it floated. The 2026 ‘Continuation Vote’, as newly-agreed, means another one is now being scheduled for around two years’ time.)\nIn addition, HSF today confirmed some new amendments to its ‘Investment Advisory Agreement’ (IAA) with HSM.\nThese amendments would give HSM a 12-month notice period as HSF’s investment advisor should the IAA be terminated at any point following the upcoming 2023 ‘continuation vote’.\nAnother clause in the new IAA: If HSF’s share price stands at an average discount to ‘operative NAV’ of 10% or more across the month of January 2025 (with that NAV determined at the time of publication of HSF’s interim report for the period to September 30, 2024), the HSF board says it intends to serve notice to terminate the IAA with HSM.\nHowever, HSF’s board has also given itself the freedom to un-terminate the IAA during the entire notice period that would follow (e.g. if HSF’s board serves 12-month notice on HSM at the end of January 2025, it would have until the end of January 2026 to withdraw its termination decision).\nOne factor potentially making the future termination of HSM as HSF’s investment advisor less likely? MBW understands that, in such a scenario, HSM would have a first-refusal option to acquire HSF’s copyright portfolio – and could potentially turn to Blackstone (i.e. the backers of Hipgnosis Songs Capital) to find the money to pull off such an acquisition.\nWhy the $440 million offer is connected to the date of HSF’s ‘continuation vote’\nWhile HSF shareholders are considering the $440 million offer from HSC to buy the 29 catalogs, other non-Hipgnosis companies are also being invited to make bids for the same portfolio.\nThose bids are enabled by a ‘go-shop’ clause in the HSF\/HSC proposal that allows the HSF board to consider these non-Hipgnosis approaches for a limited period (until 11.59pm on October 23, to be precise).\nToday (September 28), HSF informed its investors that “credible third parties are already engaged in this go-shop process” following its announcement on September 14.\nAs we’ve previously reported, there are potential obstacles in the way of these third parties’ bids. These include the fact that HSM (on behalf of HSC) has a ‘matching right’, meaning that if HSC decides to match the higher bid of a rival, HSF has to sell the catalogs to it – rather than the rival.\nIn addition, any ‘superior’ offer would have to exceed the aggregate cash net proceeds that would ultimately reach HSF’s coffers should HSC’s $440 million offer be executed. (Read more about this condition through here.)\nStill, it’s a theoretical possibility that a non-Hipgnosis company swoops for the 29 catalogs from HSF, and gazumps HSC in the bidding process.\nIf a ‘superior proposal’ (versus the $440 million offer from HSC) is received during the ‘go-shop’ period, said HSF today – whether or not HSC uses its ‘matching right’ to beat it – it may be necessary to adjourn the HSF AGM (and therefore the 2023 ‘continuation vote’) into November.\nIn its note to shareholders today, the HSF board reiterated its belief – and Hipgnosis Song Management’s belief – that HSF owns “a unique portfolio of iconic, culturally significant songs that will deliver strong long-term value as they benefit from the structural tailwinds in the music industry”.\nThe note added: “Furthermore, the [HSF] Board believes that the Investment Adviser’s approach to Song Management should enable the Company to outperform the wider music market. This has been evidenced by the 44% total return, including right to income, transaction fees and expected taxes, realised since acquisition on the [$440 million] Transaction.\n“Furthermore, the Board and the Investment Adviser are committed to ensuring that this value is achieved for shareholders by a re-rating of the share price and are determined to deliver on the ongoing opportunity of the Company.”Music Business Worldwide\n\nThis article, authored by Tim Ingham, was published by Music Business Worldwide on 2023-09-28 under the category 'business'.\n\n","id":464}
{"title":"Meet Alliance DAO’s latest accelerator cohort of startups building in crypto winter","context":"## Meet Alliance DAO’s latest accelerator cohort of startups building in crypto winter\n\nMeet Alliance DAO’s latest accelerator cohort of startups building in crypto winter The demo day focuses on an array of crypto subsectors like NFTs, security and wallets\nWhile media attention remains largely fixed on crypto’s best-known players, there are a host of startups in the web3 industry trying to make a name for themselves despite bear-market conditions.\nTechCrunch+ got to see a number of those startups during web3 accelerator Alliance DAO’s latest demo day for All11 program participants, which we’re covering exclusively.\n(Check out the previous Alliance DAO demo days we covered in July 2022, in November 2022, and in May 2023.)\nThe three-month-long accelerator program brings in web3 founders for at least 10 hours per week twice a year. “Each startup in our latest cohort received an average of over 50 intro requests after demo day,” from major VC firms like Paradigm and Multicoin, according to Alliance’s website. Alliance also invests $250,000 in startups that take part in the program.\nThe most recent cohort had 1,083 applications, down 36% from its previous batch, All10, which had a record 1,692 applicants. Of that number, only six teams made it through and are graduating from the program, and two startups from All10 are presenting too (the last cohort had 16 graduating projects). “This is the most exclusive cohort in our history,” Qiao Wang, a core contributor at Alliance DAO, said during Alliance’s demo day.\nMentors for the All11 cohort include Kain Warwick, founder of Synthetix; Jason Yanowitz, co-founder of Blockworks; Anatoly Yakovenko, co-founder of Solana; Ilja Moisejevs, co-founder and CEO of Tensor (from Alliance’s ALL9 cohort); and David Vorick, co-founder of Sia and lead developer of Glow.\nHere’s a breakdown of the eight startups:\nCompany name: Kravata\nWhat it does: Fiat to crypto on and off-ramp for LatAm\nFounders: Felipe Montes, Juliana Montes\nStage: Seed\nThe pitch: Kravata is a Colombia-based platform that aims to connect traditional financial infrastructure and fiat currencies with cryptocurrencies for businesses wanting to get into web3 in Latin America. Its services include on- and off-ramps to convert fiat to crypto (and vice versa), as well as market making and cross-border transfer systems. Its investors include Circle Ventures, Framework Ventures, Alliance DAO and others. It’s raising a seed round.\nCompany name: Thunder\nWhat it does: Onchain trading terminal\nFounders: Jackson Denka\nStage: Seed\nThe pitch: Thunder, which is a product of Eversify, is an onchain “intent-based” trading terminal that aims to give users “an unfair advantage in every way possible,” according to its website. The platform aims to provide users with support for major blockchains and exchanges like OpenSea, Uniswap, Base, Polygon, Blur and Solana, to name a few. It’s currently looking for strategic investors for its seed round.\nCompany name: Sleepagotchi\nWhat it does: NFT-powered Sleep Game\nFounders: Anton Kraminkin\nStage: Seed\nThe pitch: Sleepagotchi is a mobile app game that aims to help people develop healthy sleep habits through gamifying sleep with NFTs. The application is currently available on Apple’s App Store. Its game rewards users daily for hitting sleep goals and also provides the ability to collect items in an effort to motivate people to sleep better. The game has 14,000 monthly active users and a 41% one-year retention rate, its founder Anton Kraminkin said during demo day. According to its website, 60.2% of users reported improved sleep since using its game. In January, it raised $3.5 million from investors, including 6th Man Ventures, Sfermion, 1kx and Shima Capital. It’s currently raising from strategic investors.\nCompany name: Blockcast\nWhat it does: Decentralized broadcast delivery network\nFounders: Omar Ramadan, Lisa Li\nStage: Seed\nThe pitch: Blockcast is a decentralized content delivery network and marketplace that aims to help broadcasters have more traffic and reach wider audiences. The Berkeley-based content delivery platform aims to help broadcasters by bridging the gap between television and online streaming through tokenizing un-utilized TV spectrum to deliver content, its co-founder, CEO, and CTO Omar Ramadan said during the demo day. The cost of streaming a 4K movie to 10,000 viewers is typically about $1,000 through servers like Cloudflare, but with Blockcast it can reduce the cost by 96%, Ramadan said. It’s currently raising a seed round.\nCompany name: Tailwind\nWhat it does: Cosmos-based smart wallet\nFounders: Bao Mai\nStage: Seed\nThe pitch: Tailwind is a crypto wallet focused on the Cosmos ecosystem. It aims to help users focus on decentralized applications by abstracting away from chains and allowing users to pick a single gas token for transactions. Bao Mai, the founder of Tailwind, previously was a founding engineer at JunoSwap, an automated market maker. It’s raising a seed round.\nCompany name: Tazz\nWhat it does: Debt market for protocols\nFounders: Mark Cinali, Alan Hampton, Anthony Fahden\nStage: Seed\nThe pitch: Tazz is a decentralized lending protocol that aims to make buying and selling debt tied to digital assets more efficient. It allows users to trade debt through decentralized exchange Uniswap V3. It accepts any type of crypto collateral, according to its website. The company is in “discussions with a very large protocol to issue $5 million in debt,” Alan Hampton, CEO and co-founder of Tazz, said during his demo day presentation. It’s raising a seed round.\nCompany name: Upshield\nWhat it does: Web3 security platform\nFounders: Paul Vijender, Preston Thornburg\nStage: Seed\nThe pitch: Upshield is a full-stack security platform for web3 protocols, assets and communities. It aims to be user friendly for people building applications that are non-security experts. The startup launched two weeks ago after being in beta mode for two months and currently has an ARR of $120,000, Paul Vijender, co-founder and CEO of Upshield said during his presentation. Its engine has over 100 web3 threat detectors as well as on-chain and off-chain coverage for projects across smart contracts, application front ends and social channels, to name a few. It can work with web3 applications built on eight blockchains and networks like Coinbase’s Base, Ethereum, Avalanche, Binance and Polygon. It is raising a seed round.\nCompany name: Inco\nWhat it does: Encrypted Ethereum virtual machine\nFounders: Remi Gai\nStage: Seed\nThe pitch: Inco Network is an encrypted Ethereum virtual machine (EVM) layer-1 protocol that aims to help decentralized applications (dApps) operate on-chain. Its technology is fully homomorphic encryption (FHE), which is jargon for encryption that allows computations to be performed on encrypted data, without having to decrypt it — meaning its confidentiality is maintained throughout the computation. With that said, the FHE helps users write private smart contracts and perform computations. The network can be used for a number of different use cases like card games and private voting and is live on DevNet (developer network) with its mainnet launching in 2024, founder Remi Gai said during his demo day presentation. Inco is currently raising a seed round.\nBuilding in bad times\nThese eight companies are not building in the most winsome conditions. “The crypto industry is likely near the bottom of the cycle in terms of venture funding and developer activity,” Wang told TechCrunch. Despite a chilly market, there were a number of novel startup ideas among Alliance startups. And if history is an indication, the winners of the next cycle are likely being built now.\n\nThis article, authored by Jacquelyn Melinek, was published by TechCrunch on 2023-10-18 under the category 'technology'.\n\n","id":465}
{"title":"What about the Mediterranean lifestyle reduces mortality? Scientists find out","context":"## What about the Mediterranean lifestyle reduces mortality? Scientists find out\n\nScientists unravel the factors of the Mediterranean lifestyle that lead to reduced mortality and how it can be adopted in non-Mediterranean populations.\nPicture this: Olive oil, tomato, garlic, and an abundance of fruits — a delightful communal meal followed by a short nap. Throw in some sun and moderate warm temperatures and you might find yourself transported to the idyllic Mediterranean.\nBut what if I told you that you bring the benefits of the Mediterranean lifestyle home with you, even if you live far from the region? Just like a cherished souvenir brought back from holidays.\n“The Mediterranean lifestyle represents a traditional way of living based on a plant-based diet rich in fruits, vegetables, legumes, nuts, whole grains, and healthy oils (e.g., olive oil), moderated intake of fish, dairy and very low in red and processed meats or sweets along with food habits such as adding spices instead of salt,” explained Mercedes Sotos-Prieto, assistant professor at the Department of Preventive Medicine, Public Health and Microbiology at the Universidad Autónoma de Madrid.\n“Meals are something that happens around family and friends,” she continued. “The conviviality and social aspect are also characteristic. Physical activity is important in the context of community life, and adequate rest including the typical short mid nap or siesta.”\nSotos-Prieto and researchers from the Universidad Autónoma de Madrid in Spain and the Harvard Chan School of Public Health in the USA are exploring the feasibility and impact of adopting the Mediterranean diet and lifestyle among non-Mediterranean populations using locally available products and within their own cultural contexts.\n“We are seeing the transferability of the lifestyle [outside the Mediterranean] and its positive effects on health,” she added. The most significant perk? A 29% lower risk of mortality in both men and women.\nBreaking down the effects\nScientists stress that the Mediterranean diet should be understood more as a way of life than a mere dietary pattern with scientific evidence acquired over the last four decades establishing its benefits on life expectancy, quality of life, and the prevention of several chronic diseases.\nHowever, the challenge lies in deciphering which elements of the Mediterranean lifestyle contribute most significantly to improved health. Sotos-Prieto and her team designed and developed a Mediterranean lifestyle index called MEDLIFE using a questionnaire that calculated an individual’s adherence to a Mediterranean way of life. This index considers three primary components: food consumption, dietary habits, and physical activity, including rest, social habits, and conviviality.\nThis type of analysis allowed the researchers to dissect the impact of each of these components, even drilling down to specific items like “hours of sleep” or “socializing with friends”. Moreover, the MEDLIFE index could help capture synergistic effects of multiple components that may not be apparent when examining individual components in isolation.\nIn their study, the team evaluated the impact of a Mediterranean-like lifestyle over the course of ten years in more than 110,000 participants located in the UK.\nThe scientists found that adoption of the Mediterranean lifestyle was indeed feasible and could be adapted to local contexts, such as availability of ingredients, their affordability, local culinary traditions, and food preferences. Participants were found to have lowered their risk of cancer and cardiovascular disease relative to the general population.\n“We found that the three blocks of the MEDLIFE were independently associated with lower […] mortality,” explained Sotos-Prieto. “And within block 3 [physical activity, rest, social habits, and conviviality] we found that participating in collective sports, limiting sedentary activities, and having adequate hours of sleep (6-8 hours) were associated with lower mortality.”\nHowever, there were some variables that could not be taken into account due to a lack of information. This was the case for olive oil consumption, a prominent component of the Mediterranean diet previously associated with protective roles in many chronic diseases. “It is probable that we are underestimating the Mediterranean lifestyle association,” said Sotos-Prieto.\nTo nap or not to nap?\nThe siesta, a brief afternoon nap, is a traditional habit in Mediterranean countries. But scientists are undecided as to whether it is a healthy practice.\nIn the current study, specific napping habits were found to be associated with higher risk of mortality and cardiovascular disease. However, and similar to the case of olive oil consumption, the researchers say they did not have detailed information on frequency and duration of naps or sleep structure, such as how often and for how long, which they say weakens their conclusion.\n“Moreover, reverse causation is also possible, with people napping because of subclinical conditions or other chronic diseases (for instance, if they had more prevalence of sleep apnea), especially since napping faces a stigma in Anglo-Saxon countries,” said Sotos-Preito.\n”Previous studies have found a J-shaped relationship — a smile-like curve — between napping and cardiovascular diseases,” said Sotos-Prieto. This type of chart illustrates situations in which low values of one variable (in this case, a short nap duration) lead to a decrease in the values of the second variable (incidence of cardiovascular events), while the trend reverses at higher values.\n“Short naps, which range from 0 to 30 minutes, were associated with lower incident cardiovascular disease,” said Sotos-Preito. “An inverse association between short naps and mortality and cardiovascular diseases was found in our previous publications.”\nWhen asked for a definitive answer as to whether napping was indeed beneficial or not, Sotos-Prieto indicated that more research is needed in this regard.\nAdapting to the lifestyle\nThe challenge remains in how to put these results into practice in other countries with different, deep-rooted customs. Cultural adaptation of beneficial practices is essential to make the Mediterranean diet and habits more appealing and practical for diverse populations in non-Mediterranean countries.\n“One way to start could be to emphasize the use of fresh, local products and ingredients in Mediterranean-style meals,” said Sotos-Prieto. “[But] changing dietary habits and lifestyle is a gradual process, and affordability is also an important question.”\nOther questions remain as to how governments should invest in introducing new healthy habits, which ones should be given preference, and how much change is it enough to start seeing benefits.\nThe task is not simple since culture can define anything from ingredients and recipes to different social habits and work-life schedules. But Sotos-Prieto is optimistic.\n“I think that picking realistic goals, even if small, and sustaining them over time can make a difference [in public health],” concluded Sotos-Prieto.\nReference: Maroto-Rodriguez J. et al., Association of a Mediterranean Lifestyle With All-Cause and Cause-Specific Mortality: A Prospective Study from the UK Biobank, Mayo Clinic proceedings (2023). DOI: 10.1016\/j.mayocp.2023.05.031\nFeature image credit: Brooke Lark on Unsplash\n\nThis article, authored by Jesús Victorino, was published by Advanced Science News on 2023-09-26 under the category 'science'.\n\n","id":466}
{"title":"Ultraprocessed foods with ‘feel-good chemicals’ could be as addictive as cigarettes and drugs, study suggests","context":"## Ultraprocessed foods with ‘feel-good chemicals’ could be as addictive as cigarettes and drugs, study suggests\n\nCould a craving for salty chips actually be a sign of addiction?\nA new study from the University of Michigan suggests that could be the case.\nResearchers reviewed 281 studies from 36 different countries, finding that 14% of adults and 12% of children showed signs of addiction to ultra - processed foods , according to the Yale Food Addiction Scale (YFAS).\nULTRA-PROCESSED FOOD CONSUMPTION LINKED TO HIGHER RISK OF DEATH FROM OVARIAN, BREAST CANCERS: NEW STUDY\nThat’s close to the addiction levels seen for alcohol and tobacco, noted the study article, which was published in the journal BMJ.\nUltra-processed foods are those that are high in carbohydrates and fats, such as candy, ice cream and potato chips.\nThe study suggests that some people’s consumption of these foods may meet the criteria for substance use disorder , resulting in the \"biopsychological mechanisms of addiction and clinically significant problems.\"\nPart of the reason that ultra-processed foods have addictive properties is that they deliver fats and carbs to the gut much faster than minimally processed foods, the researchers wrote.\nThese foods also contain flavor and texture additives that could make them more addictive.\nDEPRESSION RISK SPIKES FOR THOSE WHO EAT THESE UNHEALTHY FOODS, STUDY FINDS: ‘NOT A COINCIDENCE’\n\"There is converging and consistent support for the validity and clinical relevance of ultra-processed food addiction,\" said lead researcher Ashley Gearhardt, a professor of psychology at the University of Michigan, in a press release announcing the study.\n\"By acknowledging that certain types of processed foods have the properties of addictive substances, we may be able to help improve global health.\"\nTanya Freirich, a registered dietitian nutritionist in Charlotte, North Carolina , who was not involved in the study, called out several warning signs of addictive behaviors surrounding food.\nThese include thinking about food all the time or obsessively, craving foods when not hungry, craving foods as a coping mechanism, eating even after feeling full, having reduced control over intake, experiencing symptoms of withdrawal, and continuing to eat certain foods despite negative consequences.\nSUGAR SUBSTITUTES NOT ADVISED FOR WEIGHT LOSS OR DISEASE PREVENTION, SAYS WORLD HEALTH ORGANIZATION\n\"While you can enjoy food thoroughly, being addicted to food starts to veer into an unhealthy territory with detrimental effects for the rest of your life,\" Freirich told Fox News Digital.\n\"For example, overeating past the point of comfort or to the point of causing digestive distress, or struggling to concentrate on other topics besides food and meals, can be signs of a food addiction.\"\nGearhardt noted that 103 countries have passed \"sugar-sweetened beverage taxes,\" and several others have additional taxes for ultra-processed foods.\nMore than 20 countries have also added nutrition labels to these foods, she wrote.\n\"It’s essential to understand the addiction to these ultra-processed foods globally, particularly in low- and middle-income countries,\" Gearhardt said in the release.\n\"Chronic dieting, food shame, food accessibility and even early childhood feeding experiences can all be tied back to food choices and disordered eating habits.\"\n\"It will take courageous action to change these and other economic and structural factors that drive people toward ultra-processed foods.\"\nFreirich noted that many countries have banned the production of foods with certain additives that are shown to be detrimental.\n6 WAYS TO TAKE YOUR SALAD FROM BORING TO BOUNTIFUL: HEALTHY FATS AND SMART PREP ARE JUST SOME OF THE SECRETS\n\"The USDA and FDA could make similar steps to ensure that foods are safe for consumption,\" she recommended.\nErin Palinski-Wade, a New Jersey-based dietitian with a focus on diabetes and nutrition, is skeptical that foods can be as addictive as drugs. (She was not involved in the study.)\n\"Although foods rich in added sugar may stimulate the feel-good chemicals in the brain and become habit-forming, sugar itself is not addictive in the way cocaine or another drug may be,\" she told Fox News Digital.\n\"Consuming sugar and then reducing or eliminating it from the diet will not result in withdrawal symptoms or side effects as would happen from a true addiction,\" she continued.\n\"Food cravings are complex and tied into not just the nutrition profile of a food, but also the emotions and learned behaviors around eating.\"\nAPPLE A DAY — AND 4 OTHER GREAT FALL FOOD CHOICES THAT ARE HEALTHY, DELICIOUS AND FUN\nEmotions, stress, overall metabolic health, sleep habits and learned feeding behaviors all shape people’s food choices, behaviors and responses, Palinski-Wade said.\n\"A food craving or binge-eating is almost always tied to an emotional response,\" she said. \"Chronic dieting, food shame, food accessibility and even early childhood feeding experiences can all be tied back to food choices and disordered eating habits.\"\nAlthough she believes that no single food is addictive, Palinski-Wade acknowledged that foods that are high in added sugar or added fats tend to be associated with the strongest cravings and desire.\n\"These foods often trigger the release of feel-good chemicals such as dopamine in the brain, leading to cravings and potentially addictive-like eating behaviors,\" she said.\n\"As you consume more and more of these foods, you build up a dopamine tolerance, meaning that you will have to eat even more of this food to experience the same pleasure response,\" Palinksi-Wade said — which can contribute to the development of cravings and loss of control over eating behavior.\nMore research is still needed to fully understand the relationship between food and addiction, the experts all agreed.\nCLICK HERE TO SIGN UP FOR OUR HEALTH NEWSLETTER\nThe University of Michigan study was a review and compilation of many other studies' data, Freirich pointed out.\n\"Ideally, to see if the type of food made a difference, you could run a controlled study with people consuming one meal plan with ultra-processed foods and another with minimally processed foods and then measure their reactions — thoughts about food, rated enjoyment of food, cravings and dopamine levels,\" she said.\nThose who are struggling with disordered eating , binge-eating or uncontrolled food cravings should work directly with a therapist or registered dietitian experienced in eating disorders, Palinski-Wade recommended.\n\"They can help you to better understand your behaviors and emotions around food and improve your relationship with food so that cravings and addictive behaviors can decrease,\" she said.\nAdditionally, Freirich recommended filling the majority of meals with minimally processed foods , as consuming more of these may result in eating fewer ultra-processed foods.\nCLICK HERE TO GET THE FOX NEWS APP\n\"Lastly, speak to a dietitian about how to get started on changing your diet for your personal health goals,\" she said.\nFox News Digital reached out to the University of Michigan researcher for additional comments.\n\nThis article was published by FOX News - Health on 2023-10-19 under the category 'health'.\n\n","id":467}
{"title":"Republicans still don’t know how to talk to young voters online","context":"## Republicans still don’t know how to talk to young voters online\n\nRepublicans still don’t know how to talk to young voters online Vivek Ramaswamy struggles to gain an edge in the face of TikTok trolls\nIn an appeal to younger voters, Republican presidential candidate Vivek Ramaswamy — who proposed raising the voting age to 25 — launched his TikTok presence with an endorsement from Jake Paul, the YouTuber turned boxer who built a content empire by marketing to children.\nRamaswamy is one of the only Republican politicians making an effort to connect with Gen Z and young millennials, a demographic that overwhelmingly supported Democrats in the midterm elections. Despite the popularity and growing influence of far-right creators online, Republican candidates have historically failed to engage young voters on social media, if they try at all.\nWhile Democratic politicians like Rep. Alexandria Ocasio-Cortez and Sen. John Fetterman’s social media campaign strategies set the blueprint for politicians seeking internet fame, Republicans have neglected to adopt the digital fluency required to secure the youth vote. As the 2024 election approaches, Republican candidates may again fall behind in mobilizing voters on social media platforms.\nRamaswamy is also the only Republican presidential candidate to engage with TikTok, and is one of the few in his party to even have an account. His Silicon Valley roots as a biotech entrepreneur and millennial upbringing set him apart from the other candidates, but he faces an uphill battle in convincing Gen Z to like him, much less show up at the polls. Though his videos receive hundreds of thousands of views, his comments are also overrun with sex jokes.\nAnnie Wu Henry, the digital strategist behind Fetterman’s TikTok stardom, noted that younger voters who are very online tend to value raw, unfiltered authenticity. They don’t see that in many older politicians, and especially not in the Republican party.\n“Gen Z does not put up with bullshit,” Henry said. “That’s so much of what platforms like TikTok and Twitch cater to, and why they thrive on those platforms, because you can just pull out your phone and be talking while you’re getting ready with the worst angle possible. Republicans in general, it goes against so much of how they act otherwise and young people know that.”\nRamaswamy’s TikTok strategy is puzzling; he appears to be trying to replicate the success of previous candidates who became social media stars over the course of their campaigns, but his TikTok presence conflicts with his own stances on social media and young voters. His communications director, Tricia McLaughlin, did not immediately respond to TechCrunch’s request for comment.\nLike many of his Republican colleagues, Ramaswamy has accused TikTok of being a threat to national security, and during a town hall days before he launched his account, described the platform as “digital fentanyl” from China. He has also proposed barring anyone under 25 from voting, unless they serve in the military or pass a civics exam.\nHis first videos portray him as the one candidate who cares about America’s youth. While his Republican colleagues have largely shunned TikTok, Ramaswamy is presenting himself as one of the Cool Politicians who will actually use it.\n“We have a generation of politicians that is badly out of touch,” Ramaswamy said in his inaugural video, which did not describe his policy stances.\n@jakepaul Getting Vivek on Tik Tok because i believe our politicians of the future should connect with gen z and milennials on social where we all live and breathe. Its bizarre that in this day and age our presidents have no connection with us via social. Only the occasional tweets. Meet @Vivek Ramaswamy ♬ original sound – GenosPicks\nEstablishing himself as the millennial politician who’s cool enough to use TikTok but anti-woke enough to play in the divisive culture war isn’t working in Ramaswamy’s favor, though.\nHis account, which has amassed over 50,000 followers in the weeks since he joined, has been barraged with comments either criticizing his positions or trolling him. He’s been the butt of Gen Z’s relentless comments about getting off to his content (the top comments on his videos are consistently jokes about edging). He also incited the wrath of witchtok creators, who filmed themselves casting hexes upon him and other conservatives.\nRamaswamy is raking in TikTok engagement — even if it’s not how he intended — but Democrats are still dominating the Republican party in digital strategy. Ocasio-Cortez’s Instagram Stories garnered her nationwide popularity when she campaigned in 2018, reaching further than her local constituency. In the years since, Democratic campaigns have increasingly prioritized social media strategy, establishing politician-influencers who wield content for votes.\nA 2022 midterm report by the Alliance for Securing Democracy found that in the Senate races, 47% of Democratic candidates had TikTok accounts, compared to 12% of Republican candidates. Of the major party House candidates, 30% of Democrats and 10% of Republicans were on TikTok, which as a platform was most prevalent in gubernatorial races.\nThough opposition to TikTok has been bipartisan, the crusade to ban the platform over national security concerns is primarily led by Republicans at the state level — a position that likely factors into the party’s social media struggles with young voters.\nMehmet Oz, one of the few Republican candidates on TikTok, had the advantage of already having a large social media following when he announced his candidacy thanks to his popularity as Dr. Oz. But his TikTok presence consisted of reformatted TV ads, rants attacking his opponent, now-Senator Fetterman, and unrelatable videos that inadvertently portrayed him as wealthy and out of touch.\nThere have been Republican outliers who managed to build significant followings, but so far, none have managed to turn their social engagement into votes the way Trump’s Twitter account did in 2016. Pennsylvania Sen. Doug Mastriano shunned traditional media during the race, instead relying on Facebook Live to build a far-right grassroots network that secured him the Republican nomination in the state’s most recent gubernatorial race. He still lost to Josh Shapiro, whose campaign focused on reaching young voters through collaborations with Gen Z for Change, visiting college campuses and posting updates on BeReal.\nThere’s clearly an audience for right-wing ideology online, as conservative influencers continue to build massive platforms, largely by provoking outrage. On Twitch, debate streams between creators across the political spectrum are wildly popular, and between May 2021 and May 2022, the site’s Politics tag tripled in viewership. The platform itself is a haven for some figures on the far-right who have since been kicked off of YouTube.\nRepublican politicians, however, have failed to establish the rapport with young voters that their Democratic counterparts have. While X, the site previously known as Twitter, has become a conservative incubator, Republican politicians haven’t taken advantage of the platform the way far-right influencers have.\nThat gap in digital fluency is most apparent in the way politicians approach new platforms. In 2020, Ocasio-Cortez encouraged viewers to vote in the upcoming presidential election by inviting the most popular streamers to play the pandemic’s most popular game on her newly launched Twitch channel. Her “Among Us” stream, which featured creators like Pokimane, Hasan Piker, Corpse Husband, Mxmtoon and other Twitch celebrities, was one of the most viewed streams in the site’s history. Ocasio-Cortez has hosted multiple wildly successful streams since, from charity fundraising streams to discussing labor issues with viewers.\nRep. Matt Gaetz (R-FL) famously struggled with his own Twitch debut. Last year, he launched his channel with a 30-minute diatribe about the January. 6 Capitol riot, featuring former Trump speechwriter Darren Beattie. The stream peaked at just six live viewers. He left his chat room open when he finally went offline, which allowed Twitch users to bombard his channel with ASCII dicks. Between walls of lewd — but incredibly creative — text art, users bashed Gaetz and encouraged other viewers to read about the allegations of sex trafficking against him. (The Justice Department ultimately concluded its investigation without charging Gaetz.)\nLooks like Matt Gaetz foray into streaming on Twitch is working out pic.twitter.com\/S4GEDbgu8v — The Serfs (@theserfstv) September 30, 2022\nPlatform culture matters\nTo engage with users online, politicians must understand the culture of the platform. The streamers who appeared on Ocasio-Cortez’s stream brought their own fans, who may not have been politically engaged at all before their favorite creator introduced it to them. As a regular gamer herself, the representative is also up to date on the most popular games on Twitch; in 2020, it was “Among Us,” but in her most recent stream, she played the cooperative puzzle game “Pico Park.” Gaetz, on the other hand, fumbled his launch by treating his stream like a podcast recording, limiting the back-and-forth banter with viewers that makes Twitch so engaging.\n“The amount of media and content that we consume, political and cultural, where people get their information … It’s getting more and more intertwined,” Henry said. “To be effective ideologically, when it comes to campaigns and these wins that we want, we have to understand how these ecosystems work, and be strategically using them or else we risk being left behind.”\nEngaging with voters online requires more than just working with popular creators. In Ramaswamy’s case, an endorsement from Jake Paul only drove animosity from TikTok viewers. While his older brother, Logan Paul, has made the occasional social commentary on his podcast, the younger Paul has rarely engaged with politics or social issues. Jake Paul is generally disliked online for the running list of allegations against him, including sexual assault accusations.\nThe Paul brothers have a reputation of promoting anyone and anything for a paycheck, and when Jake Paul posted a political endorsement out of the blue, viewers immediately questioned how much Ramaswamy paid him.\nEven if Jake Paul was less despised online, endorsements aren’t as valuable as they used to be. A paper published in the International Journal of Communication this year reported that mobilizing influencers to build support for political causes is more effective than using their endorsements to gain votes. Blatant endorsements lack personal connection, and create an “authenticity gap.” Authentic creators are trustworthy, and in campaign strategy, that’s more valuable than the size of their following.\nMartin Riedl, a University of Tennessee, Knoxville professor who studies social media and co-authored the paper, said that society tends to reward public figures for speaking out on social justice issues because there’s more “situational awareness.”\n“If you use influencers in your campaign, it’s important that they can authentically believe in what you promote,” Riedl said. “And if that’s not the case, that makes it really difficult for people to take your campaign seriously.”\nAuthenticity reigns\nFacebook ads, celebrity endorsements and campaign trail rallies aren’t enough to engage voters online. Neither is recycling press releases as posts. To keep up with the evolving culture, candidates are expected to be content creators as much as they are politicians, regardless of the social media platform they’re using. Authenticity is currency online, even if it’s manufactured by a team of strategists. Candidates don’t need to have the innate knack for posting for successful campaigns, Riedl said, as long as they hire someone who does.\nGen Z voters are particularly resistant to flagrant pandering, and quick to shut down any forced pop culture reference as cringe. Cringe exists across party lines — Hillary Clinton’s “Pokémon Go to the polls” still haunts the internet — but candidates don’t need to rely on youth culture to build followings.\nMemeing throughout his campaign worked for Fetterman, Henry said, because that dry humor aligns with his background as “a guy from rugged Pennsylvania” who “doesn’t try to act cool.” Ken Russell, a Democrat who left the Miami City Commission to run for a House seat in 2022, leaned into the cringe with bait-and-switch thirst traps reminding viewers to vote. In another video titled “Appealing to the youth vote,” he recreated Steve Buscemi’s “How do you do, fellow kids?” to encourage voter registration.\nAudience engagement doesn’t rely on forcing fun. North Carolina Rep. Jeff Jackson updates constituents on TikTok, breaking down topics like the government shutdown in concise explanatory videos without the frills of internet humor. Even though his content is less exciting, his account has over 2.2 million followers.\nAs an alternative to the politician-influencer, some campaigns are focusing on mobilizing creators who already have an engaged audience. Biden is not on TikTok, but his digital strategy team is building an “army of influencers” to reach viewers who wouldn’t typically keep up with the White House press corps. White House deputy chief of staff Jen O’Malley Dillon told Axios that the administration is trying to not only reach young people, but “people whose main way of getting information is digital.”\n“If you’re not going to be directly on the platform, having surrogates — whether those be influencers, celebrities, normal people — do the messaging, that’s likely going to be reaching people at a more personal level anyway,” Henry said.\n“Everyone has a vested interest, for the most part, in what the president of the United States has to say, but if it’s your friend, if it’s this person you’ve followed for five years, you have a vested interest that’s a little bit more personal. Usually that’s more effective.”\nThe “influencer army” strategy could be legally and ethically murky when influencers are paid to spread political messaging, potentially skirting both federal campaign ad laws and platform rules. TikTok bans political ads, and in recent elections, cracked down on posting sponsored political content. Influencer marketing agencies on both ends of the political spectrum are ramping up their recruitment faster than the Federal Elections Commission can regulate the industry. This year, the conservative agency Influenceable has been recruiting Gen Z creators to rally behind far-right politicians and parrot GOP talking points, without disclosing their pay. The tactic irked some Republicans, the Texas Tribune reported, including a Texas state representative who called for an investigation into the company.\nGiven the resistance to Republican politicians in online spaces that attract young people, it’s unsurprising that candidates may rely on shadowy agencies like Influenceable to do the work for them. Republican politicians have a reputation for botching even the most straightforward digital campaigns. In May, Florida Gov. Ron DeSantis launched his presidential campaign on Twitter Spaces in an audio conversation with Elon Musk. The conversation started late and was so riddled with technical issues that it ended after just 21 minutes. Critics on both the right and the left described the launch as a disaster.\nConservative organizations have proven especially out of their depth when facing the wrath of extremely online social media users, who mobilize trolling for social justice. In 2020, TikTok users reserved hundreds of tickets for a Trump rally and never showed up, leaving the president to face swaths of empty seats. When a Texas anti-abortion group opened an anonymous tip form to enforce the state’s ban on abortion after six weeks, Gen Z activists flooded the site with Shrek porn. This year, TikTok and Twitter users shut down the Missouri attorney general’s tip form for reporting clinics that provide gender-affirming care. Within days of launching, the site was spammed with fanfiction, satirical anecdotes about kids getting “transed” and fanfiction. The attorney general’s press secretary blamed the site’s downfall on activists “hacking the system.”\nThe presidential election is more than a year away, but it may be too late for Ramaswamy to make any headway on TikTok, where the platform’s young users still don’t take him seriously. He recently posted a video about getting ready for the next Republican debate, and was hit with yet another wall of edging comments.\nEven if candidates like Ramaswamy did everything right — like having a platform that didn’t alienate young voters and working with creators with more favorable reputations — they’d still represent a party that many Gen Z and millennial voters aren’t aligned with.\n“It’s really hard to be effective with a generation when a lot of your policy is attacking them,” Henry said. “If all of your policy is highly unfavorable for that generation, that’s a hard sell in itself, even if you’re an effective communicator with all the strategy in the world, to sell someone something they don’t want.”\n\nThis article, authored by Morgan Sung, was published by TechCrunch on 2023-10-02 under the category 'technology'.\n\n","id":468}
{"title":"Gag City is a viral win for Nicki Minaj","context":"## Gag City is a viral win for Nicki Minaj\n\nWelcome to Gag City, the pink metropolis inhabited by stans and brands alike.\nIn the days leading up to the release of “Pink Friday 2,” Nicki Minaj’s fifth studio album and sequel to her debut record “Pink Friday” that dropped on Friday, Twitter was flooded with AI-generated images of pink-toned cityscapes. Gag City, the dreamy false utopia ruled by Minaj and her Barbz, broke through stan Twitter and became a viral meme that brand accounts immediately used for their own marketing — promoting Minaj’s album for free.\nIs it an authentic stan-led campaign to build hype for Minaj? Is it a plant to game engagement for both the album and brands? What’s clear is that the viral moment is a win for Minaj, manufactured or not.\nIt started in September, when Minaj teased the album’s cover art online. The image features Minaj on a pink subway car, drifting through pink clouds with a futuristic (and obviously, pink) city skyline in the background.\nShe and her Barbz started referring to the album’s release as “Gag City,” NBC News reports, referencing gay slang for being so amazed that you’re at a loss for words. One might be gagged by witnessing a stunning outfit change, or by listening to a perfect record, like “Pink Friday 2.” Leading up to the release, stans started posted AI-generated images of a pink concrete jungle, joking that fictional characters and celebrities were arriving to Gag City in anticipation of Minaj’s album. In one of the first, posted on December 1 according to Know Your Meme, a fan account shared an image of a pink plane labeled “Gagg City” flying over a similarly pink skyline.\nIn the days before the release, Minaj told fans to “prepare for landing” and teased a description of her pink utopia. Barbz replied with AI-generated renditions of the descent into Gag City.\nLois Griffin, Marge Simpson, and Linda Belcher have arrived in Gag City pic.twitter.com\/ZIjqtPdhZu — Fin (@gofinurself) December 7, 2023\nBREAKING: Starbucks lemon loaf has arrived in Gag City pic.twitter.com\/KY68wp1Ocu — benji (@basicbenny) December 7, 2023\nnot the homophobic dog arriving in Gag City?! pic.twitter.com\/vYMBgm4vd4 — JB 🪩🐻🍉 (@JBfromDC89) December 7, 2023\nfun fact: katy perry is actually the first artist that ever recorded a music video in gag city (2010) pic.twitter.com\/ZIMZ59fuiS — fazpo🦭 (@fazpo) December 7, 2023\nX (formerly Twitter) users began crafting elaborate narratives about Gag City’s inhabitants and government. One posted an image of Barbz storming the Pink House, which another user described as the fandom’s own January 6th. Another posted an image of pink-clad citizens protesting in the streets of Gag City, calling for Minaj to release the album’s track list. Though some may believe that Gag City is a utopia, one account posted an image of a matronly Minaj handing out CDs of her album to impoverished children “on the outskirts of Gag City,” implying that the pink society also has a class divide problem.\nGag City is also riddled with stan wars, as fans of rival pop stars posted images of their faves vying for Minaj’s seat at the head of her city’s government. In a nod to Greek mythology, one account posted an image of a Trojan horse decorated in Beyoncé’s “Renaissance” disco motif.\n🚨 BREAKING: The Barbz have discovered a mysterious, metallic horse at the front gates of Gag City. An inscription reads “For their return home, the Hive dedicate this offering to Onika.” pic.twitter.com\/64SKkWuGoc — uncle gworl (@_uncle_gworl) December 8, 2023\nnicki minaj addresses the citizens of gag city prior to the inauguration tonight pic.twitter.com\/sfC964ly7o — Xeno👾 (@AClDBLEEDER) December 7, 2023\nNever one to miss out on an easy trend, brand accounts started joining in on the Gag City hype. Chili’s posted an image of rosy smoke billowing from its restaurant, which makes me wonder if air pollution exists in Gag City. Wheat Thins, Baskin-Robbins, Dunkin’ Donuts, Pizza Hut, Red Lobster, Oreo, Bing (??), the Empire State Building and countless others posted their versions of Gag City.\nOn one hand, memes tend to die the minute brand accounts start co-opting them — nothing is more tiresome than seeing a fun joke turn into a corporate-friendly marketing ploy. AI-generated images are already ethically fraught, and critics have raised concerns over AI generators trained on artwork without the consent of the work’s artists. Artists have also criticized brands for using AI-generated art instead of commissioning work from a real, human artist. Though using AI-generated art for commercial use is legal, as copyright laws pertaining to AI are virtually non-existent, it’s generally seen as a shitty move by many in the art world.\nOn the other, it’s free promotion for Minaj, and as a lifelong Barb who spent her adolescence running a stan account for “Pink Friday,” I consider it a win.\nNicki Minaj is an artist who’s been embroiled in controversy throughout her career, from posting bad takes about COVID vaccines to defending her husband Kenneth Petty, a convicted sex offender. She may be a brilliant artist, but her problematic history makes her far from the family-friendly public figure that brands are more likely to endorse.\nBut with Gag City, Minaj has brands doing all of her marketing for her. “Pink Friday 2” is an artistic marvel in itself (though I am probably biased), but the free promotion that it’s been getting as a viral meme is particularly astounding. Artists have spent the last few years trying to drum up engagement for their work by making their songs trend on TikTok, which audiences have started to resist. Gag City doesn’t bank on being the viral song of the summer to drive streaming numbers — the bit is removed enough for non-stans to enjoy it, while still revolving around the album it’s promoting.\nBrand Twitter tends to turn fun trends into advertising opportunities, taking organic community interactions and spitting out contrived versions clearly made to go viral. It may be grating, but in this case, it’s working in Minaj’s favor. This week, everyone wants to go to Gag City.\n\nThis article, authored by Morgan Sung, was published by TechCrunch on 2023-12-09 under the category 'technology'.\n\n","id":469}
{"title":"Fifth Third 1.67% Cash\/Back Card: One of the simplest cash back credit cards with an above-average return","context":"## Fifth Third 1.67% Cash\/Back Card: One of the simplest cash back credit cards with an above-average return\n\nWhy we like this card: The Fifth Third 1.67% Cash\/Back Card has one of the simplest rewards structures you’ll find on a card. Not only does it earn easy-to-use cash back (at an abnormally high rate), but its redemption options are equally straightforward.\nPros Unlimited 1.67% return rate on all purchases\nSimple rewards structure\n$0 annual fee Cons No welcome offer\nNo bonus spending categories\nYou must already be a Fifth Third customer to qualify\nFifth Third 1.67% Cash\/Back Card: Overview\nAPR:\nIntro: 0% introductory APR with balance transfers for the first 12 billing cycles after account opening. (After that, your APR will be 20.74%–29.99% based on your creditworthiness.)\n0% introductory APR with balance transfers for the first 12 billing cycles after account opening. (After that, your APR will be 20.74%–29.99% based on your creditworthiness.) Purchase: 20.74%–29.99% variable\n20.74%–29.99% variable Balance transfer: 20.74%–29.99% variable (plus a fee of $5 or 4% of the transferred amount, whichever is greater)\n20.74%–29.99% variable (plus a fee of $5 or 4% of the transferred amount, whichever is greater) Cash advance: 29.99% (plus $10 or 5% of the amount of your advance, whichever is greater)\nAnnual fee: $0\nForeign transaction fee: $0\nConvenience check fee: Either $5 or 4% of the amount of each check, whichever is greater\nLate payment fee: Up to $40\nMinimum interest charged: $1.50\nThe Fifth Third 1.67% Cash\/Back Card is a mostly vanilla cash back credit card. It’s got a fixed 1.67% earning rate on all purchases with the option to redeem for either a direct deposit or a statement credit on your card. This super-simple approach may be a big draw for some—but it can be a deterrent for others. Its one-dimensional approach means that it’s impossible to get outsized value for your rewards.\nMany credit cards tack on up to 3% of your total overseas spending. The Fifth Third 1.67% Card waives these foreign transaction fees, so it’s a good companion for international trips. It also doesn’t charge an annual fee, which means it can continue to benefit your credit profile even if your credit card strategy evolves away from using the card regularly. A big factor that makes up your credit score is “length of credit history,” which is determined by the average age of your accounts. By keeping the card open, your length of credit history will grow even if you don’t use it (though you should swipe it once every six months to avoid account closure due to inactivity).\nFifth Third is a bank that operates primarily in the Midwest—but it has branches from Illinois to West Virginia to Florida. If you don’t live in an area where it has physical locations, you may likely have never heard of it.\nHere’s why that’s important: If you don’t have a Fifth Third checking or savings account, you’re ineligible to open the Fifth Third 1.67% Cash\/Back Card. Only those with a previous relationship with the bank will qualify.\nFifth Third 1.67% Cash\/Back Card: Rewards\nThe Fifth Third 1.67% Card offers a unique fixed return rate for all purchases: 1.67% uncapped. Sounds random, but it ties in with the bank’s “Fifth Third” motif (5\/3 = 1.67). This is an above average return for a no annual fee cash back credit card with a flat earning rate. More common are offers between 1% and 1.5%.\nThe card technically earns “Rewards Points,” that can be redeemed at a rate of 1 cent per point. When you make a purchase, your points earnings will be rounded (up or down) to the nearest whole number. For example, if you spend $6, you’ll earn 10.02 points. This will be rounded to 10 points.\nDoes Fifth Third 1.67% Cash\/Back Card offer a new customer bonus?\nThe Fifth Third 1.67% Card doesn’t currently offer a welcome bonus to new members.\nHow to redeem Fifth Third 1.67% Cash\/Back Card rewards\nWhen it comes to using your rewards, the Fifth Third 1.67% Card doesn’t have many tricks up its sleeve.\nStatement credit\nWhen you earn points with the Fifth Third 1.67% Card, you can use them toward a statement credit on your card to offset your balance. You can do this immediately after the rewards are posted to your account.\nMany cash back credit cards require you to earn a specific amount before you’re eligible to redeem them ($25 is a common threshold). This card does not.\nDirect deposit\nAlternatively, you can request a direct deposit into your Fifth Third checking or savings account if you don’t currently have a balance on your credit card, or if you’d like to use your funds in some way other than lowering your credit card debt.\nAutomatic redemptions\nIf you want to spend as much brain power redeeming your points as you do earning them (i.e., none), you can enroll in auto-redemption which will empty your full rewards balance into your account each month.\nAdditional benefits\nThe Fifth Third 1.67% Card’s ongoing benefits aren’t jaw-dropping, but few no annual fee cash back credit card benefits are. Here’s what you can expect:\nCell phone protection: If your cell phone is lost or stolen, you’ll receive up to $800 per claim (maximum two claims or $1,000 per 12-month period) with a $50 deductible. All you’ve got to do is use the card to pay your monthly phone bill. This is excellent for a no annual fee credit card.\nIf your cell phone is lost or stolen, you’ll receive up to $800 per claim (maximum two claims or $1,000 per 12-month period) with a $50 deductible. All you’ve got to do is use the card to pay your monthly phone bill. This is excellent for a no annual fee credit card. Contactless payments: You can use your card touch-free with eligible credit card terminals. You can add the card to Apple Pay, Google Pay, and Samsung Pay.\nYou can use your card touch-free with eligible credit card terminals. You can add the card to Apple Pay, Google Pay, and Samsung Pay. Easily lock your card: The Fifth Third mobile app allows you to effectively activate and deactivate your credit card at will, similar to flipping a switch. For example, if your card goes missing, you can immediately lock the card until you find it.\nThe Fifth Third mobile app allows you to effectively activate and deactivate your credit card at will, similar to flipping a switch. For example, if your card goes missing, you can immediately lock the card until you find it. Mastercard ID Theft Protection: Mastercard will monitor the internet (including the dark and deep web) to find any of your sensitive information, including compromised credentials. This is a benefit that all Mastercard credit cards customers have.\nIs the Fifth Third 1.67% Cash\/Back Card right for you?\nIt’s true: Many other credit card rewards programs have a higher potential value than the Fifth Third 1.67% Card. Earning airline miles, hotel points, or transferable rewards that can be converted to travel loyalty programs can literally be worth exponentially more. The caveat is that these programs take a lot of research and experimentation to maximize.\nThe Fifth Third 1.67% Card is for those who don’t have a master’s degree in credit card rewards—and aren’t interested in putting in the effort. With this card, you can guarantee that you’ll get a solid return every time you swipe the card. There are no catches (except perhaps the fact that you must have a Fifth Third checking or savings account to qualify).\nCredit cards similar to Fifth Third 1.67% Cash\/Back Card\nThere are plenty of other cash back credit cards that can compete with the Fifth Third 1.67% Card, many of which don’t require you to have a previous relationship with the bank to secure an approval. Here are some of the best credit cards to consider if the Fifth Third 1.67% Card just isn’t doing it for you.\nCapital One Quicksilver Cash Rewards Credit Card vs. Fifth Third 1.67% Cash\/Back Card\nThe no annual fee offers an unlimited 1.5% cash back return. This is slightly below the Fifth Third 1.67% Card, but it makes up for the deficit in other ways.\nFor example, you’ll earn 5% cash back on hotels and rental cars booked through Capital One Travel. You’ll also earn $200 after spending $500 in the first 3 months from account opening. The card even offers six months of free Uber One membership through Nov. 14, 2024 (otherwise $9.99 per month).\nCiti® Double Cash Card vs. Fifth Third 1.67% Cash\/Back Card\nThe no annual fee earns 1% back when you make a purchase and 1% back when you pay off that purchase. That’s 2% everywhere, which is notably higher than the Fifth Third 1.67% Card.\nThe card doesn’t earn a welcome bonus. And its benefits are comparatively slim. For example, it doesn’t waive foreign transaction fees and it doesn’t offer cell phone insurance. If the extra 0.33% in earnings doesn’t offset these shortcomings, the Fifth Third 1.67% Card is likely your better option.\nFrequently asked questions\nIs the Fifth Third 1.67% Cash\/Back Card worth it?\nThe Fifth Third 1.67% Card is worth it for anyone who values simplicity above all else. It’s got a solid return rate for all purchases—and because it doesn’t incur an annual fee, you’re guaranteed to make a profit (as long as you stay away from other fees like APR and cash advances).\nHow does a Fifth Third cash back card work?\nThe Fifth Third 1.67% Cash\/Back Card offers a fixed 1.67% return for all purchases. You can redeem them as a direct deposit into your Fifth Third checking or savings account, or you can request that a statement credit be applied to your card.\nWhat is the APR for the Fifth Third 1.67% Card?\nThe Fifth Third 1.67% Card comes with a 20.74%–29.99% variable APR.\nPlease note that card details are accurate as of the publish date, but are subject to change at any time at the discretion of the issuer. Please contact the card issuer to verify rates, fees, and benefits before applying.\n\nThis article, authored by Joseph Hostetler, was published by Fortune on 2023-11-13 under the category 'business'.\n\n","id":470}
{"title":"American Express Cash Magnet® Card review: a simple, no-nonsense cash back card","context":"## American Express Cash Magnet® Card review: a simple, no-nonsense cash back card\n\nWhy we like this card: It offers a flat cash back rate on all purchases, so you don’t have to worry about the hassle of keeping track of and activating bonus spending categories. So this card is ideal for those looking for a basic rewards card without annual fees.\nPros No annual fee\nFlat cash back rate\nAttainable new-cardmember bonus Cons Charges foreign transaction fees\nLimited redemption options\nFew card benefits\nAmerican Express Cash Magnet® Card: Overview\nIntro APR: 0% for the first 15 months from the date of account opening. After that, your APR will be 19.24%–29.99% variable\nAPR\nPurchase: 19.24%–29.99% variable\n19.24%–29.99% variable Balance transfer: 0%, APR for the first 15 months from the date of account opening on balance transfers requested within 60 days of account opening. After that, your APR for those transactions and any other balance transfer requests, will be 19.24%–29.99% variable Balance transfer fee: Either $5 or 3% of the amount of each transfer, whichever is greater The minimum balance transfer amount is $100. The maximum is less than your credit limit, but may not be more than $7,500.\n0%, APR for the first 15 months from the date of account opening on balance transfers requested within 60 days of account opening. After that, your APR for those transactions and any other balance transfer requests, will be 19.24%–29.99% variable Cash advance: 29.99% Cash advance fee: Either $10 or 5% of the amount of each cash advance, whichever is greater\n29.99% Penalty: 29.99% variable, this APR may be applied to new transactions on your account if you make one or more late payments; or your payment is returned by your bank\nAnnual fee: $0\nForeign transaction fee: 2.7% of each transaction after conversion to US dollars\nLate payment fee: up to $40\nReturned payment fee: up to $40\nWhether you’re looking for a basic rewards credit card or want to take advantage of a low APR for a major purchase or balance transfer, the American Express Cash Magnet® Card could be a worthwhile option for you. With a $0 annual fee, it offers a flat cash back rate on all purchases, and there’s no limit on how much you can earn in rewards.\nPlus, it offers new cardmembers 15 months at 0% APR on purchases and balance transfers completed within the first 60 days of opening an account, giving you more than a year to make payments without interest.\nHowever, the card isn’t particularly useful if you travel often. It charges foreign transaction fees, and it lacks the travel benefits that other cards offer.\nAmerican Express Cash Magnet® Card: Rewards\nUsing the Cash Magnet Card to earn rewards is simple: you’ll earn an unlimited 1.5% cash back on every purchase you make. The only transactions you won’t earn rewards on are the following:\nBalance transfers\nCash advances\nPurchases of traveler’s checks\nPurchases of prepaid cards or reloading card balances\nPerson-to-person transfers, such as Venmo transactions\nOne important thing to note: American Express doesn’t allow cardholders to earn rewards during a billing period if the cardmember hasn’t paid the minimum payment due by the due date.\nDoes American Express Cash Magnet® Card offer a new customer bonus?\nIf you are a new customer, you can qualify for a $200 statement credit if you spend $2,000 in the first 6 months of card ownership. Once you’ve reached the spending threshold, American Express will credit the $200 to your account as a statement credit. However, it can take eight to 12 weeks after reaching the spending requirement to receive the credit.\nThe bonus on the American Express Cash Magnet® card is relatively low—it’s possible to find cards without annual fees that offer higher bonus amounts—but the bonus offer gives customers more time to reach the spending threshold.\nMany cards require cardmembers to reach the spending threshold within three months, so unless you spend a significant amount of money each month with your card, you’re unlikely to reach the spending requirement.\nWith the American Express Cash Magnet® card, you have six months to reach the spending threshold. Even if you only use the card for routine expenses, such as utility bills, streaming services, gas for your car or groceries, you could likely reach the spending requirement within six months and earn the $200 cash back bonus.\nHow to redeem American Express Cash Magnet® Card cash back rewards\nIf you have the American Express Cash Magnet® card, you can redeem your cash back rewards for statement credits to your account.\nThere is no minimum required to redeem rewards. Rewards will be in the form of a statement credit of $1 for every reward dollar you redeem. For example, if you have 50.50 reward dollars, you can redeem those rewards for a $50.50 statement credit.\nStatement credits will be applied to your account within three days, but statement credits cannot be used toward the minimum amount due. Unless the statement credit reduces your balance to $0, you’re still required to make the minimum payment.\nAdditional benefits\nCompared to the benefits of other credit cards, the American Express Cash Magnet® Card is more limited. However, it does offer the following perks:\nAmerican Express Experiences: With American Express Experiences, you get access to exclusive ticket pre-sales and cardmember-only events. Events include major Broadway shows, concerts, and sport competitions.\nWith American Express Experiences, you get access to exclusive ticket pre-sales and cardmember-only events. Events include major Broadway shows, concerts, and sport competitions. Car rental loss and damage insurance: When you use the Amex Cash Magnet Card to pay for your entire car rental cost and decline the rental company’s collision damage waiver, you automatically receive secondary coverage against damage or theft of the rental vehicle.\nWhen you use the Amex Cash Magnet Card to pay for your entire car rental cost and decline the rental company’s collision damage waiver, you automatically receive secondary coverage against damage or theft of the rental vehicle. Global assist hotline: If you are traveling 100 miles or more from home, you can use the Global Assist Hotline to get emergency assistance, including medical referrals, emergency cash wires and missing luggage services. However, you are responsible for paying for the charges of any third-party service provided.\nIf you are traveling 100 miles or more from home, you can use the Global Assist Hotline to get emergency assistance, including medical referrals, emergency cash wires and missing luggage services. However, you are responsible for paying for the charges of any third-party service provided. Plan It: On purchases of $100 or more, you can take advantage of Amex’s Plan It feature. It allows you to split purchases into equal monthly payments at a fixed fee—similar to how buy now, pay later apps work.\nIs the American Express Cash Magnet® Card right for you?\nThe American Express Cash Magnet® Card is best for those who are looking for a simple and easy-to-use card they can use for all of their purchases. With no annual fee and 1.5% cash back on every purchase, it’s a no-frills, no-hassle addition to your wallet.\nBut if you love to travel, you’ll likely need another credit card. Other options offer more comprehensive travel benefits, such as reimbursing you for TSA PreCheck fees or travel interruption\/cancellation insurance, and you can find other cards that don’t charge foreign transaction fees.\nCredit cards similar to American Express Cash Magnet® Card\nIf the American Express Cash Magnet® Card isn’t the best choice for you, consider these alternatives:\nAmex Blue Cash Everyday vs. ​​American Express Cash Magnet® Card\nThe Blue Cash Everyday® Card from American Express is similar to the American Express Cash Magnet® Card in its fees and APR offers, but it has a different rewards structure. With this card, you’ll earn:\n3% cash back on up to $6,000 spent on groceries per year\n3% cash back on up to $6,000 spent on U.S. online retail purchases per year\n3% cash back on up to $6,000 spent at gas stations per year\n1% cash back on all other purchases\nIf you tend to spend more money in select categories, such as groceries or online retail purchases, the Blue Cash Everyday® Card from American Express may be a better fit.\nDiscover it® Cash Back Credit Card vs. ​​American Express Cash Magnet® Card\nLike the American Express Cash Magnet®, the Discover it® Cash Back Card doesn’t have an annual fee. But it has a very different rewards system than the Amex card; rather than earning a flat cash back rate, you can earn 5% cash back on up to $1,500 in combined quarterly purchases in various categories throughout the year (then 1%).\nIt takes a little more work to take advantage of rotating spending categories. But if you tend to spend money in the different categories—such as restaurants, Amazon purchases or gas—you could earn more cash back rewards with the Discover it® Cash Back card. Plus, Discover will match all of the cash back you earned during your first year as a cardmember.\nFrequently asked questions\nIs the Amex Cash Magnet Card hard to get?\nAmerican Express doesn’t disclose its minimum credit score requirement for its cards. But generally, you need to have good credit—according to Equifax, that means you need a score of 670 or higher—to qualify for the Amex Cash Magnet Card or other American Express cards.\nAmex does have a card pre-qualification tool you can use to find out the likelihood of getting approved without affecting your credit score.\nWhat is the limit on the Amex Cash Magnet Card?\nSome cards list their minimum spending limit in their terms and conditions, but American Express doesn’t list the minimum for the Cash Magnet Card. However, card users reported limits as low as $1,000. Others reported significantly higher limits, with some receiving limits over $10,000.\nIs Amex Cash Magnet a metal card?\nUnlike the American Express Platinum Card, which is a metal card with a heavier weight than most cards, the American Express Cash Magnet® is a standard plastic credit card.\nPlease note that card details are accurate as of the publish date, but are subject to change at any time at the discretion of the issuer. Please contact the card issuer to verify rates, fees, and benefits before applying.\nFortune Recommends™ credit ranges are a variation of FICO® Score 8, one of many types of credit scores lenders may use when considering your credit card application.\nTerms apply to American Express benefits and offers. Enrollment may be required for select American Express benefits and offers. Visit americanexpress.com to learn more.\nEligibility and Benefit level varies by Card. Terms, Conditions, and Limitations Apply. Please visit americanexpress.com\/benefitsguide for more details. Underwritten by Amex Assurance Company.\n\nThis article, authored by Kat Tretina, was published by Fortune on 2023-11-03 under the category 'business'.\n\n","id":471}
{"title":"Could CRISPR cure HIV someday?","context":"## Could CRISPR cure HIV someday?\n\nScientists have been experimenting with how to use CRISPR to treat and potentially cure HIV since the gene-editing tool was developed.\nIn an ongoing clinical trial , researchers are testing whether just one dose of a new gene therapy that might effectively cure human immunodeficiency virus ( HIV ) infections is safe in humans.\nThe therapy, named EBT-101, involves using CRISPR-Cas9 gene editing to treat HIV. This potential treatment strategy has been studied in animal models since the development of CRISPR-Cas9 in 2012. However, this is the first time such a gene-editing treatment for HIV has been tried in humans. The latest data from the trial suggest that EBT-101 is safe at the doses tested, but we don't yet know if it cures HIV.\nAccording to the United Nations Programme on HIV\/AIDS (UNAIDS) , approximately 39 million people globally were living with HIV in 2022, and there were about 630,000 AIDS-related deaths that year, making HIV a continued public health burden. There is no vaccine or easily accessible cure for HIV, although a handful of people have been effectively cured through intensive stem-cell transplants.\nThe EBT-101 trial \"is an important step forward in the development of this technology to treat human disease and infection, including HIV,\" Thomas Hope , a professor of cell and developmental biology at Northwestern University who was not involved in the work, told Live Science in an email.\nBut how likely is it, really, that we could use CRISPR to cure HIV someday?\nRelated: We could end the AIDS epidemic in less than a decade. Here's how.\nHow CRISPR could (theoretically) cure HIV\nHIV infects immune cells that are normally used to fight infection in the virus's host. The virus uses an immune cell's machinery to insert its own DNA into the host's genome, allowing the virus to replicate. If an HIV infection is not treated, it can lead to acquired immunodeficiency syndrome (AIDS), which results in a severely weakened immune system and leaves the infected person highly vulnerable to other infections, cancers and early death.\nCombination antiretroviral therapies (cARTs) are the mainstay in HIV treatment and limit the virus' replication, thus extending people's lives to near-normal lengths and cutting their chance of spreading HIV . However, these therapies must be taken for a lifetime and fall short of being a cure .\n\"The existing challenge in HIV treatment lies in the virus creating resilient genetic reservoirs within human cells,\" Elena Herrera-Carrillo , an associate professor of infectious disease at Amsterdam University Medical Centers, told Live Science. Herrera-Carrillo's lab focuses on using CRISPR to edit cells that harbor HIV reservoirs, despite ongoing cART therapy. This phenomenon is known as \"latent HIV\" and occurs when the virus infects a type of immune cell called CD4+ memory T cells, which can persist for decades .\ncART therapies can suppress viral replication, but if the treatment is interrupted, \"the dormant proviruses can reactivate, making a cure elusive,\" Herrera-Carrillo told Live Science.\nCRISPR works by targeting and cleaving specific sequences of DNA from the genome; a \"guide\" leads CRISPR's famous \"molecular scissors\" to the targeted gene. This either deactivates the gene or allows it to be removed and swapped for different DNA. Research groups believe this strategy could be effective in removing latent HIV infections, because it can target the viral DNA embedded in the genome, rather than only stopping replication.\nUsing CRISPR for HIV gene therapy has shown promise in several test-tube studies, a 2020 review in The Journal of Clinical Investigation notes. Various groups have been working to bring the therapies from test tubes to human patients — and that brings us to EBT-101.\nRelated: The world's 1st CRISPR therapy has just been approved. Here's everything you need to know\nHIV infects immune cells in the body. (Image credit: KATERYNA KON\/SCIENCE PHOTO LIBRARY via Getty Images)\nAll about EBT-101\nAccording to a recent presentation at the annual meeting of the European Society for Gene and Cell Therapy in Brussels, EBT-101 uses multiple guides to target multiple sites in the genome and snip out large sections of latently integrated HIV DNA. This stops HIV from replicating.\nKamel Kahlili , a professor of neurovirology and gene editing at Temple University and co-founder of Excision BioTherapeutics , has been working with the company to develop EBT-101 for a decade. In 2020 and 2023 , Khalili and his team published reports that showed that EBT-100, a precursor to EBT-101, safely targeted and removed HIV DNA in infected primates.\nNow, they're testing their EBT-101 targeting strategy in humans in an early-stage clinical trial that primarily focuses on the safety of the treatment. Initial results from three treated patients showed no toxic effects or serious adverse events. All of the patients' HIV is currently suppressed with cART.\n\"The initial safety results are promising because no adverse outcomes have been observed to date,\" said Hope, whose lab studies the mechanisms behind HIV infections. \"But more time is needed to be sure because of the way genetic off-target mutations can take years to manifest into complications,\" he added.\nOff-target effects of CRISPR refer to when the CRISPR molecule alters DNA at sites other than those targeted. These unintended snips have long been a worry for researchers designing CRISPR treatments, so they'll be something to watch for with EBT-101, especially since the treatment targets multiple sites in the genome .\nAdditionally, experts told Live Science that even though the ongoing trial hints that the therapy has a positive safety profile, we still don't know whether one dose can effectively target latent HIV cells and whether it can control HIV in humans.\n\"It is crucial to approach this with caution,\" Herrera-Carrillo said. \"While optimism about being on the right track is justified, it's important to recognize the substantial work that still needs to be done.\"\nThe clinical trial will next test additional doses of EBT-101 for safety and then determine whether the virus stays suppressed when patients are taken off cART. cART therapies pump the brakes on HIV replication, so the only way to determine whether the latent cell reservoirs have been disabled is to temporarily lift those brakes.\nInterruptions to HIV treatment are necessary to determine whether a patient is in remission — as has occurred in the few people cured of HIV — but in general, purposeful treatment interruptions have been debated due to their inherent risks.\nFollowing these tests, EBT-101 trial participants will be enrolled in a long-term follow-up study for 15 years following their initial dose to check for long-term adverse effects. So the data is on its way, but will take years to arrive.\n\nThis article was published by Live Science: The Most Interesting Articles on 2023-11-30 under the category 'science'.\n\n","id":472}
{"title":"Here are the shipping deadlines to get your holiday gifts on time","context":"## Here are the shipping deadlines to get your holiday gifts on time\n\nThe same thing happens year after year. Things get busy with work, school, and life in general until you’re suddenly up against the clock as you race your gifts to your local post office, FedEx store, or UPS location. We’ve all been there, but we’d like to be of some help as you plan your next move and begin sending out your holiday packages.\nIf you plan on sending your gifts via traditional mail, what follows are the upcoming domestic shipping deadlines for various retailers and shipment carriers so you can ensure that your packages arrive before Christmas, Kwanzaa, or whatever holiday it is you celebrate this time of year. Hopefully, it’ll help you avoid some holiday stress, if at all possible.\nUPS 2023 Holiday Shipping Deadlines Final day to ship Ships via this service December 19th UPS 3 Day Select December 20th UPS 2nd Day Air December 21st UPS Next Day Air\nWith UPS, you have until Thursday, December 21st, to ship via Next Day Air and have your package arrive by Friday, December 22nd. Packages shipped via Next Day Air after Thursday won’t arrive until after Christmas. Wednesday, December 20th, is the last day to ship via 2nd Day Air if you want your package to arrive by Friday, December 22nd. You can opt for UPS’s 3 Day Select option until Tuesday, December 19th, to have it arrive by the 22nd. Before then, you can select the normal pickup and delivery service to get your packages where they need to be on time.\nFedEx 2023 Holiday Shipping Deadlines Final day to ship Ships via this service December 19th FedEx Express Saver December 20th FedEx 2Day and 2Day A.M. December 22nd FedEx SameDay\nFedEx’s same-day shipping can get your package where it needs to be by Friday, December 22nd. That’s the last day that FedEx can guarantee that your package will arrive by Christmas. If you ship it by Wednesday, December 20th, you can opt for the two-day shipping method. If you manage to get it to FedEx by Tuesday, December 19th, you can go the Express Saver route and (hopefully) pay a reasonable fee for shipping.\nUSPS 2023 Holiday Shipping Deadlines Final day to ship Ships via this service December 20th First-Class Mail December 20th USPS Ground Advantage December 21st Priority Mail December 21st Priority Mail Express\nThursday, December 21st, is the final day to send packages (and have them arrive by Christmas Eve) through USPS via its Priority Mail Express service. You can also get packages delivered by December 23rd via Priority Mail. First-Class Mail packages and those you intend to send via USPS Ground Advantage, meanwhile, must be sent by Wednesday, December 20th, to arrive in time.\nIllustration by Alex Castro \/ The Verge\nIf you subscribe to Amazon Prime and live in an eligible ZIP code in the US, you can get Same-Day Delivery on certain items through December 24th. You’ll need to meet the “minimum threshold” of eligible items in your cart, however, which can vary by location (see here for more details). In LA, for example, the threshold is over $25.\nPrime members can get One-Day Delivery for eligible products through December 23rd with no minimum purchase amount or Two-Day Delivery through December 22nd.\nIf you’re a Prime member in select US cities, you can take advantage of two-hour grocery delivery through December 24th.\nShipping times and prices may vary depending on the product type, size, and whether it’s shipping directly from Amazon or a third-party seller, so make sure to check the expected arrival date at checkout, then choose accordingly.\nIllustration by Kristen Radtke\nBest Buy 2023 deadlines\nIf you’re a My Best Buy Plus and My Best Buy Total subscriber, you can get free two-day shipping, and there’s no order minimum.\nOther customers need to clear the $35 order threshold (before taxes but after coupons), and certain items are available for next-day and standard shipping.\nDecember 21st at 11:30AM ET is the cutoff date for free shipping if you want your package to arrive by December 23rd.\nFree next-day delivery is available on select items through December 23rd.\nYou can get free same-day delivery if you order your package on December 23rd or December 24th. You must place your order by 12PM local time for free same-day delivery by 7PM.\nYou can also order online by 5PM local time on Christmas Eve for an in-store pickup at 7PM.\nBest Buy’s shipment arrival dates may vary depending on the kind of item that you’re getting. Major appliances may take longer to be delivered at this point.\nIllustration by Kristen Radtke\nWalmart offers two-day shipping on items sold directly from Walmart, with orders over $35 shipping for free. You must place orders by 2PM local time on December 21st to receive the package in time for Christmas, however. Next-day shipping is also available in some areas.\nWalmart also offers free next-day and two-day shipping to Walmart Plus subscribers with no order minimum. However, the arrival date of your package may vary depending on whether Walmart or a third-party seller is shipping your item.\nThe retailer offers in-store pickup through December 24th, depending on availability, as well as same-day delivery on December 24th. Same-day pickup is available on orders made by 12PM local time.\nYou can also have the package delivered to you in less than two hours on Christmas Eve if you order by 12PM local time and pay a $10 Express Delivery fee. Note that Walmart Plus members also get one Express Delivery free during the month of December.\nIllustration by Kristen Radtke\nBoth same-day delivery and in-store pickup are available to you if you place an order by 6PM local time on Christmas Eve. It helps to choose your desired location as “My store” in the upper-left corner of Target’s website, which will prompt it to automatically indicate if the item you’re purchasing is available for pickup nearby.\nYou can also get packages within an hour on Christmas Eve (if you order before 4PM local time) with a service called Shipt. An annual Shipt subscription provides unlimited deliveries on orders above $35 for $99 a year, though an annual membership is currently going for half off. Alternatively, you can pay for same-day shipping with Shipt on a per-order basis via Target’s website. Shipping fees may vary depending on your location and the contents of the order. Here are answers to some frequently asked questions that might help.\nTarget RedCard credit card holders receive free two-day shipping on many items from the retailer’s website.\nMany (but not all) orders over $35 are eligible for free two-day shipping, even if you don’t have a Target RedCard. It’s determined by the item’s location and your ZIP code.\nTarget stores will be open on Christmas Eve, though it’s wise to get pickup orders and same-day shipping orders in by December 23rd to be on the safe side.\nSimilar to Walmart and Amazon, be aware that items at Target shipped or sold by third-party retailers can result in longer lead times. Product listings usually spell out your options for pickup, same-day delivery, and standard shipping — complete with estimated availability times — before you add them to your cart.\n\nThis article, authored by Sheena Vasani, was published by The Verge on 2023-12-18 under the category 'technology'.\n\n","id":473}
{"title":"Will the Panthers fire Frank Reich? Impatient David Tepper could turn up Carolina's hot seat with 'Thursday Night Football' loss","context":"## Will the Panthers fire Frank Reich? Impatient David Tepper could turn up Carolina's hot seat with 'Thursday Night Football' loss\n\nThe Panthers entered the 2023 NFL season shrouded in optimism. The team had moved on from Matt Rhule, who proved to be an ineffective NFL coach, and added a potential franchise quarterback to the fold in Bryce Young.\nThe hope was that those moves would turn Carolina into a contender in the wide-open NFC South.\nInstead, they find themselves not only at the bottom of the division but also sporting one of the worst records in the NFL at 1-7.\nYoung hasn't yet looked comfortable in the Panthers' offense, and he is coming off one of his worst games as a starter against the Colts. He threw three interceptions in that contest, including two pick-sixes to Kenny Moore in a 27-13 defeat.\nMORE: Full list of rookie quarterbacks to start an NFL game in 2023\nThe rest of the Panthers' offense hasn't been much better. Adam Thielen has looked rejuvenated in his new home, but running back Miles Sanders has been a bust acquisition. And the team's offensive line has allowed 74 pressures on the season, good for the 10th-most in the NFL.\nIndeed, Carolina's offense has been less-than-impressive in 2023. That's the main reason that coach Frank Reich finds himself under fire for the team's performance.\nReich already gave up play-calling to offensive coordinator Thomas Brown after the team's early-season struggles. Now, there are questions about whether the team's lackluster offense — which averages the fifth-fewest yards (283.4) and sixth-fewest points (17.5) per game this season — could ultimately cause owner David Tepper to move on from Reich after just one season.\nWill the Panthers fire Frank Reich?\nThe Panthers aren't guaranteed to fire Reich even amid their poor season. But as ESPN's Adam Schefter implied on \"The Pat McAfee Show,\" the retread coach's seat is growing hotter with each passing week.\n\"I don't think anybody's got a long rope there just because of the type of season that they're having,\" Schefter said when asked about Reich's status in Carolina.\nSchefter stopped short of saying that Reich was on the hot seat. However, he detailed that owner David Tepper wouldn't be afraid to move on from Reich if he deemed it necessary for the success of his team.\n\"One thing about David Tepper: he's not very patient,\" Schefter said. \"He's as successful as he is because of the way he's operated his business. And it's worked for him, basically at every level. He does what he wants. And I don't think that people are thinking that there's trouble right now with those people. But would anybody be surprised with anything that happens in Carolina this year? No.\"\n\"One thing about David Tepper is he's not very patient and he does whatever he wants..\n\nI don't think anybody would be surprised if anything happens in Carolina with the season that they're having\" ~ @AdamSchefter #PMSLive pic.twitter.com\/PV7bfVUtHp — Pat McAfee (@PatMcAfeeShow) November 6, 2023\nSchefter pointed to Carolina's firing of Rhule as an example of Tepper's impatience. There had been rumors that the owner was going to wait things out with Rhule in the weeks leading up to his in-season departure. Instead, he decided to pull the trigger and part with him.\nWhile Reich isn't guaranteed to meet the same fate, it's becoming clearer that he will need to deliver some wins to help earn a second season in charge of the Panthers.\nAnd as Schefter notes, the team's \"Thursday Night Football\" game against the Bears may be among the most important games remaining on Carolina's schedule, as the team grapples with justifying the trade-up to select Young.\nLet's keep in mind, [the Panthers] play the Bears Thursday night. The Bears have their No. 1 draft pick. So if the Bears win on Thursday, that's a huge victory and in a bigger way than just the game itself.\nAgain, that's not to say that Reich will be fired after Thursday's game. After all, he might not be fired at all if he can help Carolina to earn some wins during the second half of the season.\nBut if Tepper loses his patience with Reich, he could go back to the drawing board and bring another new head coach aboard.\nMORE: Panthers' Bryce Young over C.J. Stroud decision comes under fire after Stroud's record-setting day\nFrank Reich coaching record\nReich has posted a winning record of 41-40-1 in his 81 career regular-season games as a head coach. This is despite the fact that the Panthers have posted a record of just 1-7 under his watch this season.\nThe reason for this is that Reich had a solid four-plus-year stint with the Colts. He had three winning seasons during his five campaigns in Indianapolis and totaled a record of 40-33-1 with the team despite dealing with numerous changes at the quarterback position.\nBelow is a year-by-year breakdown of Reich's record with the Colts and Panthers.\nYear Team Record 2018 Colts 10-6 2019 Colts 7-9 2020 Colts 11-5 2021 Colts 9-8 2022 Colts* 3-5-1 2023 Panthers 1-7 Total Colts\/Panthers 41-40-1\n* Fired after Week 9 of the season.\nReich made it to the postseason in two of his first three seasons with the Colts. The team posted a record of 1-2 in three contests across those two appearances.\nIt's also worth noting that Reich has had a different Week 1 starter at quarterback in each of his first six seasons as a head coach. He was hoping to break that streak with Young in Carolina, but he will need to first make it to a seventh season with the club.\n\nThis article, authored by Jacob Camenker, was published by Sporting News on 2023-11-06 under the category 'sports'.\n\n","id":474}
{"title":"No. 17 Arizona dominates No. 22 Utah, 42-18","context":"## No. 17 Arizona dominates No. 22 Utah, 42-18\n\nSaturday’s game between Arizona and Utah was many things for the Wildcats: Senior Day, Military Appreciation Day, and their last home game of the season. With the UA needing a win to keep its own destiny alive for a Pac-12 Championship appearance, it handled the pressure once again against a ranked team.\nThe Wildcats not only got halfway through en route to winning out but did it in statement fashion Saturday at Arizona Stadium in front of a sold out stadium, blowing out No. 22 Utah, 42-18, extending their winning streak to five games, as well as marking their first win over the Utes since 2015. It is also the first time the UA took down four ranked teams in a season since 1989, with it being the only team in the country this season to do so.\n\"Great win for the program,\" Arizona head coach Jedd Fisch said following the win. \"Great win for our team, great win for our seniors, great win for Tucson, appreciate Tucson coming out in full force, selling out the stadium. ... I think you might as well put the season tickets on sale for next year on Monday and see if we can get six sell outs.\"\nLeading the Wildcats was junior safety Dalton Johnson, logging 11 tackles as well as two tackles for loss in the UA’s routing.\n\"Dalton is a fantastic tackler,\" Fisch said. \"When he's around the ball, he gets them down.\"\nAfter failing continuously on trick plays involving receiver Tetairoa McMillan passing behind the scrimmage this season, Arizona head coach Jedd Fisch designed it again — this time to perfection — with McMillan finding a wide-open fifth-year senior Michael Wiley to score a touchdown in his last game in Tucson.\nFollowing the trickery, another huge roar of the Wildcat faithful ensued following a blocked punt and score by Anthony Ward, the first Arizona blocked punt and score since Nov. 13, 2021.\nThe Wildcats’ momentum was rolling like a well-oiled machine on both ends of the ball in the first half, scoring offensive touchdowns on three of four drives, led by Michael Wiley tallying two of them, and outgaining the Utes by 98 yards on the ground, as well as forcing the Utes to two three-and-outs, three punts and a red zone interception, headlined by captain linebacker Jacob Manu, the first Arizona linebacker interception since Anthony Pandy against USC in 2021. With rain starting to pour late in the first half in a rare Arizona “rain game”, the overcast didn’t hinder the Zona Zoo from leaving the stadium, nor the Wildcats from letting up their progression, resulting in the UA taking staggering 28-7 lead at halftime.\n\"I don't think the rain effected us at all,\" Fisch said.\nWith the rain starting to clear up to start the second half, overtime it was clear that the Wildcats’ defense was holding a cloud over the Utes’ heads. Arizona got off to a slow start but picked up much of its thunderous momentum after junior safety Gunner Maldonado broke up a pass on fourth and three. Since the fourth-down stop, the UA logged an interception and another turnover on downs.\nAlthough the defense was surging, the Wildcats not scoring since the first drive of the second quarter — their offense seemed to have lost its touch.\nBut then “Swag Surfin” by Fast Life Yungstaz came on, signaling the fourth quarter, the quarter in which going into the game, Arizona was outscoring opponents 90-37. The Wildcats on their first drive put a touchdown on the board a seven play, 61 yard drive, thanks to a 25-yard dash before diving into the end zone by running back Jonah Coleman. The UA then ran away from the Utes, outscoring them 14-8, only allowing a garbage time touchdown in the last minute to secure its 8th win of the season.\nThe last touchdown for Arizona came with backup quarterback Jayden de Laura hitting McMillan for a 51-yard touchdown.\n\"I wanted Jayden to go out with a touchdown pass this season,\" Fisch said. \"I think that he deserves that.\"\nWhen asked about whether the win against Utah, who has beat the Wildcats the last six meetings, signified anything further about the program, Fisch said that the win signified that they are having a great year.\n\"[It signifies] that we're not gonna back down from anybody, and we feel really good about trying to continue to improve, get more physical, get tougher,\" Fisch said.\nFor fifth-year senior captain Jordan Morgan, who missed his opportunity last season to play in Senior Day last season due to injury, the Tucson native noted that being able to compete and win in his final game at Arizona Stadium \"means so much.\"\n\"I finally got to finish off with a bang like this at home for the last time in my career, so really enjoyed it,\" Morgan said.\nArizona (8-3, 6-2 Pac-12) will take on its in-state rival Arizona State (3-7, 2-5) next Saturday for the 97th annual Territorial Cup.\n\"I think our team will be very excited for the game against ASU,\" Fisch said. \"There won't be a question about that. We understand the importance of the game, we want to keep the Territorial Cup here in Tucson and our guys recognize that, understand that and we will put all of our focus starting tomorrow at 9 a.m.\n\nThis article, authored by Aidan Wohl, GoAZCATS.com, was published by Rivals on 2023-11-18 under the category 'sports'.\n\n","id":475}
{"title":"Gabriel Jesus’s sublime goal and assist gives Arsenal vital victory in Sevilla","context":"## Gabriel Jesus’s sublime goal and assist gives Arsenal vital victory in Sevilla\n\nIn the end they were made to resist, but Arsenal are back on top. On a night when Mikel Arteta said his side were forced to play many games in one, controlling when it was called for, holding on when they had to and slipping in the knife when the opportunity arose, the very last kick and the chance to have the last word fell to the Sevilla striker Lucas Ocampos.\nWith the clock on 97 minutes, the hosts 2-1 down and the ball sitting up, he could have changed everything. Instead he sliced past David Raya’s left hand and into the stand, leaving his team facing the prospect of another Europa League adventure and their opponents’ future in the continent’s premier competition in their own hands.\nAs Ocampos sat on the turf, the Sánchez-Pizjuán fell quiet, except for the 3,000 Arsenal fans high in the corner who had watched what their coach described as another step in this team’s development, “a brutal experience”. This, he said, was a victory of merit; it was a demonstration too of the emotional management he had demanded, with Declan Rice and William Saliba among those who impressed. Though none shone brighter than Gabriel Jesus.\nUltimately, two grand moments from the Brazilian either side of half‑time did it: the first an exceptional assist that broke the game open in the blink of an eye, the second the shot that flashed past Ørjan Nyland and into the far corner. Asked afterwards which was better, Arteta replied “both”, adding: “I would like to see a replay of the first in slow motion because it was so sharp. He came for a reason: this is our level now and we need players like that.”\nArsenal’s opener came at the very end of the first half, when the game had begun to tilt slightly away from them and an initially timid Sevilla had started to think they could get a goal of their own. Instead, they found themselves sliced open. Superb footwork from Ocampos enabled him to get away from Bukayo Saka, nicking the ball through the England player’s legs and running at the defence, space opening before him but Dodi Lukebakio’s cross was cleared and Sevilla were suddenly exposed, stripped bare by Jesus.\nA lovely turn enabled him to evade two players and slide the ball into a huge gap. Dashing free was Gabriel Martinelli, alone from the halfway line. A long run to the goal, right through the middle, and Nyland came to him. It was the second time the two men had come face to face, the Norwegian denying Martinelli when he had been released by Jorginho after 10 minutes, but this time the outcome was different. Martinelli slowed, stepped around the keeper to the right and rolled the ball into an empty net.\nArsenal’s Gabriel Jesus curls in a beautiful finish against Sevilla. Photograph: Kieran McManus\/Shutterstock\nWhen that first opportunity had been passed up, it didn’t seem to matter much: at that point it had appeared Arsenal would open Sevilla again and often. They had stepped high and dominated the opening period. And yet Diego Alonso’s side would settle, even if too often their moves ended at the feet of Lukebakio. It was he who missed their best early opportunity, failing to control by the penalty spot after the kind of loose Raya pass that can only fuel the goalkeeping debate had gifted Sevilla possession in a dangerous position.\nThe next chance came Sevilla’s way too, Sergio Ramos stepping out from the back to find Ocampos who nudged it into the path of Youssef En‑Nesyri. Beyond the defence, his shot faded past the far post.\nIf Sevilla were encouraged forward by that, it proved to be their downfall right on the verge of half-time, and soon after the break they had conceded again. Jesus received on the left, cut inside Jesús Navas, stepped on to the sweet spot for a shot and bent a brilliant finish into the far corner.\nskip past newsletter promotion Sign up to Football Daily Free daily newsletter Kick off your evenings with the Guardian's take on the world of football Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\nArsenal had started the second period as if determined to end this and now, nine minutes in, it seemed that they might have done but it did not play out that way. A Nemanja Gudelj header from a corner put Sevilla back in it and then Mariano Díaz, on as a substitute, brought the ball down on his chest and smashed a shot against the bar. Next came a overhead kick from Ocampos, going close; game on.\nSevilla were throwing what they could at Arsenal now. These were the moments Arteta had meant, stressing the importance of knowing that they will always come and having the capacity to withstand them. “These games demand you play lots of different games,” he said. “We controlled it and created chances but at 2-0 we did not kill them off. We conceded from a corner and then we lacked control and had to defend our area, but we are very happy because we found those different things that are very important, and in a stadium where not many teams have won.”\nIf he had warned his side, so had the fans in this arena, a huge banner unfurled at the start declaring: “Europe knows what we are capable of”. They were going to fight, that was for sure. On 90 minutes, En-Nesyri leapt to head. Raya then had to push away a wayward cross that almost sneaked in and Nyland was sent up for a corner until, in the very last second, the ball sat up before Ocampos. Sevilla though could not find a way through. Arsenal, top of Group B, now should.\n\nThis article, authored by Sid Lowe at the Ramón Sánchez Pizjuán Stadium, was published by The Guardian on 2023-10-24 under the category 'sports'.\n\n","id":476}
{"title":"Attorney general going after Jeffrey Epstein's estate says she was fired for her dogged pursuit: 'My bar license, my integrity were more important to me'","context":"## Attorney general going after Jeffrey Epstein's estate says she was fired for her dogged pursuit: 'My bar license, my integrity were more important to me'\n\nSubject: The Epstein files. Message: Wrap them up — ASAP.\nOne after another, the texts, calls and emails rolled in.\nDenise George knew from the beginning that she was going up against powerful players on Wall Street over their supposed links to Jeffrey Epstein. But she soon sensed that she was also up against forces here at home, in the US Virgin Islands, where the financier seemed to have preyed on women and girls with impunity.\nPeople in St. Thomas wanted the Epstein scandal — and the uncomfortable questions it was raising — to go away, and fast. But George says she needed time. She was fired as attorney general after spending more than three years trying to seek justice.\nCorrespondence about the case obtained by Bloomberg News underscores the sense of urgency within the local government and the pressure George came under. Hundreds of pages of court documents offer a window into details about Epstein’s web of influence in the US territory.\nGeorge was the driving force behind three high-profile legal battles involving Epstein, the Svengali who courted a wide circle of rich and powerful men – from Bill Gates to Prince Andrew – even after he was branded a sex offender.\nOn this rain-drenched Tuesday in the Caribbean, George is telling her story about those landmark cases, which reverberated like a thunderclap through the power corridors of business and politics. Even now, four years after Epstein died by suicide in a Manhattan jail cell, it’s hard to shake the feeling that a code of silence, a sort of omerta, hangs over his affairs here.\nGeorge, 64, is sitting inside a poolside restaurant at a flamingo-pink hotel, overlooking the rooftops of St. Thomas. It’s mid-summer in the tropics, low season here. The place is empty. On the silver chain round her neck hangs a gift from her husband: a pendant in the shape of the scales of justice.\nEpstein’s estate was the first to settle with the Virgin Islands. A year ago, it agreed to pay $105 million, plus half the proceeds from the sale of Little St. James, AKA “Little St. Jeff,” the private island where authorities allege some of Epstein’s crimes took place.\nThen, last January, Wall Street billionaire Leon Black settled for $62.5 million. Next came JPMorgan Chase., in September, for $75 million. None of the parties admitted to wrongdoing. All of them declined to comment for this story.\nWithout those cases, the world may have never glimpsed some of the secrets Epstein and his circle harbored, or the depths of his influence here in the Caribbean. Emails that surfaced in the litigation, for instance, revealed Epstein’s unusually close relationship with Jes Staley, a top banker at JPMorgan Chase & Co. who went on to run Barclays Plc.\nJPMorgan had alleged in court that Staley failed to alert the bank of all he knew about Epstein. Staley – who swapped sexually suggestive emails about young women with Epstein and visited Little St. Jeff, according to emails filed in court — hasn’t been accused of wrongdoing by the authorities. Lawyers for Staley claim he had no decision-making authority over Epstein’s JPMorgan accounts.\nIn a nutshell, George’s story behind these stories is this:\nShe felt pressure from the territory’s governor to quickly settle the Epstein cases and move on. To George, the message was clear: Bury the Epstein scandal once and for all.\n“It was very professional but we did have very different values and that created a lot of contention between us throughout the course of the Epstein investigation and other matters as well,” she said.\nAfter George was dismissed last December, Governor Albert Bryan Jr. was clear: He was eager to put the entire scandal behind the US Virgin Islands.\n“If we never mention Jeffrey Epstein again, that would be good for me,” Bryan told The St. Thomas Source. At the time, his office said George’s dismissal was unrelated to her pursuit of JPMorgan. But Bryan later said he couldn’t have an attorney general launching lawsuits he didn’t know about. His office didn’t respond to requests for comment.\nThis much is sure: Over all the years Epstein sex-trafficked and sexually abused dozens of underage girls and young women, he projected money and influence through Virgin Islands as if the territory were his private fief.\nHe cultivated politicians, donated heavily to campaigns and forged close ties with a powerful and well-connected local law firm. Cecile de Jongh, wife of one of Bryan’s predecessors as governor, John de Jongh, even worked for Epstein. She served as his office manager and unofficial political emissary. Mrs de Jongh declined to comment for this story.\nDuring her deposition as part of the JPMorgan litigation, Mrs de Jongh was asked about seeking enrollment in English classes for women at Epstein’s request. She said she never saw anyone under distress and “would never do anything to harm anyone, or aid and abet anyone in harming someone.”\nEpstein lobbied to relax rules that were imposed on him as a sex offender, with mixed success. He also received $300 million in tax breaks from the territory’s Economic Development Commission, some of them while now-Governor Bryan was EDC chairman. Neither Bryan nor any other official has been accused of any wrongdoing.\nWeb of Influence\nEpstein spun his web influence over the islands in order to protect himself and hide his dark secrets, George says.\nDespite the lurid record and all the stories surrounding Epstein, George says she wasn’t aware of the scale of his crimes when she was named attorney general in 2019, less than two months before Epstein was arrested at New Jersey’s Teterboro Airport after flying from Paris.\nIt didn’t take her long to find out. She was only a few weeks into the job when news reporters began calling. They wanted to know if authorities in the US Virgin Islands were investigating what Epstein had been up to for all those years on Little St. Jeff.\nThey weren’t.\nAround the same time, Governor Bryan, who was sworn in in 2019, told George that Epstein had made a request: He wanted a new waiver to loosen certain restrictions placed on him as a convicted sex-offender, according to court filings. Epstein, for instance, had to give the Virgin Islands 21 days’ notice when he planned to travel.\n“In my head I am thinking, Relax?” George recalls. “If anything, wouldn’t you say, Tighten them?”\nA previous attorney general had granted such a waiver but later it had been revoked. Epstein wanted a new one, George testified during a deposition earlier this year.\nGovernor Bryan told her that Epstein’s lawyers would be in touch, she said. They happened to work for Kellerhals Ferguson Kroblin, according to the former prosecutor, the same local firm that supported his gubernatorial campaign.\nErika Kellerhals, who requested the waiver on Epstein’s behalf, had hosted a $1,000-a-head fundraiser for Bryan along with partner Greg Ferguson in 2018. Ferguson later was appointed to Bryan’s transition committee for economic regulation, according to a local press report.\nGovernor Bryan texted George in May 2019, she testified in a deposition, telling her to make a decision. She denied Epstein’s request.\nGeorge later testified that she thought Epstein was “flexing his political influence over or with the governor” rather than going through the usual channels.\nGiven Epstein’s apparent influence in Virgin Islands, who would want to rock the boat? George says she was willing to try. Around St. Thomas, she has a reputation as a straightshooter. The former public-corruption attorney stops short of pointing to official wrongdoing. But on this sticky August day, in her gold-buttoned blazer, she makes clear that she, for one, wouldn’t tolerate it.\n“If I have to lose my job to avoid being part of a conspiracy to cover something up, I would do it,” George says. “My bar license, my integrity were more important to me. I wasn’t going to compromise that.”\nWhen Epstein was found dead a few months later in his cramped Manhattan jail cell, George saw an opening. Epstein had quietly set up a trust in the Virgin Islands as a repository of his personal fortune, valued at $577 million at the time of his death. George decided to go after the estate and those who might have helped Epstein.\n“He is dead,” she thought to herself, “but his accomplices must be alive.”\nThe law firm representing the estate: Kellerhals Ferguson Kroblin, the same one Epstein had used for years here, and the same one with connections to Governor Bryan. In court filings, the firm quickly blasted the Virgin Islands for sitting on its hands while Epstein was alive.\nKellerhals did not respond to a request for comment.\nThe governor gave his blessing when George indicated she wanted to launch a civil enforcement action against the estate. But the tone shifted when the litigation dragged on into a second year.\nPrivately, Bryan expressed frustration. He wanted to know why it was taking so long to settle with Epstein’s estate.\nGeorge claimed the civil racketeering case was complex and warranted a resolution that at least in part met Epstein’s myriad of wrongdoings in the USVI. In the end the estate returned $80 million in tax incentives, agreed to pay half a million to remediate environmental damage to one of Epstein’s islands, committed half the proceeds from the future sale of Little St James and established a victims’ compensation fund.\nOfficially, George, not the governor, was in charge of making the legal calls. But Bryan was still her boss and held the purse strings. It was a delicate balance, George said.\nTrying to untangle a half-billion-dollar estate is a formidable task under the best of circumstances. It was even harder given the code of silence still surrounding the dead financier. Many of Epstein’s employees had signed nondisclosure agreements. Some alerted the estate’s lawyers the moment investigators reached out. On Little St. Jeff, groundskeepers avoided eye contact when authorities approached.\nGeorge herself traveled to Little St. Jeff. She still can’t shake eerie absurdity of seeing a dentist’s chair inside the luxury island villa.\nIn the end, the Epstein estate settled. The other battles would soon follow.\nGeorge didn’t get much time to celebrate. Four weeks after that deal was struck – and four days after George filed the suit against JPMorgan – the official news arrived from the Office of the Governor.\nIt was New Year’s Eve. George was cooking callaloo, Caribbean greens, at her father’s house. A security officer arrived at the door and handed her a letter.\nDenise George, the 16th attorney general of the US Virgin Islands, had been summarily dismissed.\n\nThis article, authored by Ava Benny-Morrison, Bloomberg, was published by Fortune on 2023-11-17 under the category 'business'.\n\n","id":477}
{"title":"Tottenham’s Unbeaten Run Ends With 4-1 Home Loss to Chelsea","context":"## Tottenham’s Unbeaten Run Ends With 4-1 Home Loss to Chelsea\n\nNine-men Tottenham suffered their first loss of the Premier League campaign in a fiery 2-1 defeat at home to Chelsea.\nJackson rifled in a 75th minute winner from Raheem Sterling’s square-ball pass as the Blues came from behind to win at manager – Mauricio Pochettino’s former home ground – with the Argentinean having managed Spurs between 2014-19.\nThe Senegal forward then struck twice in injury time to claim his first hat-trick as a Chelsea player and wrap up a clinical victory.\nDejan Kulusevski had earlier put Tottenham ahead in the sixth minute but Cole Palmer equalised from a 35th minute penalty, after Cristian Romero had been red carded for a foul on Enzo Fernandez.\nThe hosts’ disastrous evening worsened with injuries to Mickey van de Ven and James Maddison, whilst Destiny Udogie was sent off in the 55th minute for a second bookable offence.\nSpeaking to BBC post-match, Tottenham manager, Ange Postecoglou said: “There was a fair bit going on, a lot of VAR intervention, a hard game for me to analyse but I am very proud of the players. Right to the end they were trying to create something for us.\n“The players couldn’t give any more than they did, part of this game is will, effort and determination and they showed that.”\nTottenham now sit second in the table, whilst Chelsea’s win lifted them up to tenth on goal difference from fellow London rivals, Crystal Palace.\nEmbed from Getty Images\nHaving slipped to second in the table over the weekend, Tottenham started with high energy and fluidity which saw Pape Matar Sarr play Son Heung-min through in the fifth minute, but the South Korea international saw his shot saved by Robert Sanchez.\nThat chance proved to be an early warning which Chelsea failed to heed as Sarr flicked on a sixth-minute diagonal pass for Kulusevski, who calmly rifled into the near-right corner to put Tottenham back top of the table at that point.\nPedro Porro almost doubled Spurs’ lead a minute later as he rifled upon goal from Kulusevski’s pullback pass of Brennan Johnson’s cross, yet Sanchez was able to make a comfortable save.\nChelsea’s first chance eventually came in the 11th minute as Jackson forced a save from Guglielmo Vicario, before Son briefly extended the hosts lead two minutes later with a tap-in but he was ruled offside via his right shoulder position.\nTottenham soon afterwards began to lose their composure and Romero was lucky not to be sent off in the 21st minute, after he retaliated with a kick on Levi Colwill following an initial shove on the Argentinean.\nSterling meanwhile scored for Chelsea amidst that incident seconds later but his goal was ruled out for handball, after his first shot rebounded off Porro onto his right arm before he put the ball away beyond Vicario.\nSterling though had found himself the subject of a reckless tackle from Udogie two minutes earlier, with the Italian getting away with a yellow card.\nFernandez and Thiago Silva then saw shots go wide for Chelsea but tensions soon hit boiling point in the 28th minute, as Moises Caicedo had an equalising goal disallowd due to Jackson interfering with play as the Colombian delivered his shot upon goal.\nRomero meanwhile clipped Fernandez inside the box with a high-footed challenge which sent his compatriot to ground, and resulted in a red card for the Spus defender following a lengthy VAR review and referee – Michael Oliver awarded Chelsea a penalty.\nPalmer eventually stepped up in the 35th minute and Vicario got a touch on the Englishman’s penalty, yet could only deflect it onto the right post, which saw the ball ricochet into the bottom-right corner to pull the West London visitors level.\nChelsea quickly pushed on after their equaliser against an imploding Spurs defence but failed to find a breakthrough goal before half-time, whilst the hosts lost Romero’s central defensive teammate – Mickey van de Ven to injury alongside James Maddison in two huge blows.\nTottenham however were lucky to not be down to nine men at the break after Sarr and Colwill came to blows in the tenth minute of injury time, yet Oliver decided to just yellow card both players than send either player off.\nReece James was then lucky not to be dismissed for Chelsea in the 11th minute of injury-time after he elbowed Udogie in the face, yet VAR deemed it a simple incident and not a yellow or red card offence.\nColwill though found himself hooked off at half-time by Mauricio Pochettino for Marc Cucurella, due to his ill-tempered first-half antics.\nUpon the restart, Chelsea quickly made their one-man advantage count but their recurring end product issues reared its head, as Palmer rifled wide in the 47th minute in a fast start from the Blues.\nSterling then broke forward seven minutes later but his shot was blocked by Vicario, before he seconds later broke forward on a counter-attack, which drew a foul from Udogie who was consequently dismissed to put Spurs down to nine men with 35 minutes left on the clock.\nIf Chelsea thought that decision boosted their prospects of a second goal then poor finishing looked to be their Achilles heel, as Jackson flicked over the bar from James’ cutback pass following a short free-kick.\nJackson continued to push for his third goal of the campaign but his 58th minute shot was punched away by Vicario, when then blocked Palmer’s rebound shot.\nChelsea continued to press and eventually got their reward as Sterling broke forward up the right flank at the start of the 75th minute, and found Jackson unmarked to rifle his pass into the left corner to put the Blues ahead at Pochettino’s former team.\nTottenham however seemingly responded three minutes later as substitute, Rodrigo Bentancur flicked a free-kick behind for Eric Dier to volley into the top-left corner, but he was adjudged offside as Bentancur nodded the ball into his path.\nChelsea eventually clung on for a fourth league win of the season after Bentancur narrowly put a 86th minute header wide, as Spurs valiantly tried to chase an unsuccessful equaliser in which Son saw a 93rd minute shot denied by Sanchez.\nJackson subsequently rounded off Tottenham’s nightmare evening a minute later as he turned Gallagher’s pass into the net to seal a triumphant return to North London for Pochettino and his Blues, before he completed his hat-trick two minutes later.\nThe 22 year-old first turned in Connor Gallagaher’s 94th minute pass followed by a clinical strike from Palmer’s pass in the 97th minute, which secured Jackson his first Premier League hat-trick of his career.\nPostecoglou meanwhile suffered a first home defeat as a manager since he began his 52-match unbeaten home run in November 2020 during his time at Yokohama F. Marinos, then two-year spell at Celtic plus now Tottenham.\nWhat’s Next?\nTottenham continue their push for the Premier League title with a trip to Wolves on Saturday 11 November, with kick-off at Molineux set for 12:30pm GMT live on TNT Sport 1 in the UK.\nChelsea host Spurs’ title rivals, Manchester City on Sunday 12 November at 4:30pm at Stamford Bridge, live on Sky Sports in the UK.\nTeam News\nTottenham: Guglielmo Vicario, Pedro Porro, Cristian Romeero, Mickey van de Ven (Hojbjerg 45+1′), Destiny Udogie, Yves Bissouma, Pape Matar Sarr (Bentancur 61′), Dejan Kulusevski (Skipp 61′), James Maddison (Royal 45+1′), Brennan Johnson (Dier 34′), Son Heung-min\nSubstitutes: Oliver Skipp, Pierre-Emile Hojbjerg, Richarlison, Bryan Gil, Emerson Royal, Eric Dier, Giovani Lo Celso, Fraser Forster, Rodrigo Bentancur\nChelsea: Robert Sanchez, Reece James (Gusto 77′), Axel Disasi, Thiago Silva, Levi Colwill (Cucurella 45′), Moises Caicedo, Enzo Fernandez, Cole Palmer, Conor Gallagher, Raheem Sterling, Nicolas Jackson\nSubstitutes: Marc Cucurella, Benoit Badiashile, Mykhailo Mudryk, Noni Madueke, Lesley Ugochukwu, Malo Gusto, Dorde Petroivic, Ian Maatsen, Deivid Washington\nReferee: Michael Oliver\nLike this: Like Loading...\n\nThis article, authored by James Gregory, was published by Sport Grill on 2023-11-06 under the category 'sports'.\n\n","id":478}
{"title":"The housing winter arrives early as existing home sales crash to Great Recession levels and the long-feared ‘deep freeze’ sets in","context":"## The housing winter arrives early as existing home sales crash to Great Recession levels and the long-feared ‘deep freeze’ sets in\n\nAfter a long, hot summer that saw mortgage rates creep ever higher, October has brought an early winter for the housing market. Existing-home sales dropped a stunning 15% in September on a year-over-year basis to a seasonally adjusted annual rate of 3.96 million transactions, according to the National Association of Realtors (NAR). That’s the lowest figure in 13 years, since 2010, when the world economy, and particularly the U.S. housing market, were struggling to pull out of the Great Financial Crisis.\nContributing factors to the continuous decline in home transactions include surging mortgage rates (which just hit 8% this week—a record in the 21st century), low inventory levels, and home prices that refuse to stop rising. In other words, there aren’t enough homes to buy, money isn’t cheap anymore, and the ones for sale are too rich for most homebuyers’ blood.\nIndeed, existing-home sales prices topped $306,000, a 5% increase since the year began, according to the Case-Shiller U.S. National Home Price Index.\n“As has been the case throughout this year, limited inventory and low housing affordability continue to hamper home sales,” NAR chief economist Lawrence Yun said in a statement. “The Federal Reserve simply cannot keep raising interest rates in light of softening inflation and weakening job gains.” The Fed has raised rates several times this year, with Chair Jerome Powell arming his “higher for longer” stance.\nDeclining housing inventory levels also contribute to the drop in housing transactions. Housing inventory is down 8.1% from this time last year, according to NAR. Some real-estate experts and economists argue that housing affordability is even worse now than during 2008, when a damaging downturn in the U.S. housing market set off the dominoes that became the Great Financial Crisis that defined a whole decade economically—and in some ways, our current predicament.\nIn 2010, the last time existing home sales were so low, the global economy was on life support and the Fed slashed interest rates down to zero to revive the flatlining patient—fueling an “everything bubble” that inflated all kinds of assets along the way, not the least, housing. The zero-rate regime persisted until the highest inflation in 40 years surprised many economists and prompted the massive series of rate hikes that have brought us to the once-unthinkable 8% mortgage.\nSome onlookers saw what was coming, for instance Zillow, which warned in May that housing would enter a “deep freeze” if the debt limit standoff failed to resolve and America defaulted, as that would send mortgage rates up to 8%. Of course, the default was averted, but here we have arrived at 8% mortgage rates anyway. But this isn’t like 2008 or 2010 again. It’s time for a 1980s history lesson.\nBack to the 1980s future\nThe housing market today isn’t identical to that of the ‘80s, but it’s pretty close. In a lot of ways, millennials are being forced to follow the housing journey of their boomer parents as they face a frozen, unaffordable market with rising interest rates, as noted recently by both BofA Research economist Jeseo Park and by First American chief economist Mark Fleming.\nEssentially, millennials are a giant generation all collectively coming of homebuying age nearly simultaneously—just like their boomer parents in the 1980s. They’re the “biggest share of the “homebuying pie,” as Redfin puts it, purchasing about 60% of homes bought with mortgages during the past few years.\nPlus, the raising of interest rates in an effort to combat inflation is strikingly similar to the ’80s. Back then, Fed Chair Paul Volcker fought inflation through aggressive interest rate hikes, with the average 30-year fixed mortgage peaking at about 18% by late 1981. Sound familiar? Current Fed Chair Jerome Powell has set the tone for the most aggressive global hiking of rates in the modern era. And in due course, this week, mortgage rates hit 8%, the highest they’ve been in more than 20 years.\nAll things considered, home sales activity also plummeted from 1978 to 1982. Existing-home sales dropped 50% during that period, according to the Office of Policy Development and Research. And while we haven’t seen home sales activity levels this low since the 2000s, the housing market more closely mimics that of the ’80s, according to a report published this week by Fortune 500 financial services company First American.\n“Today’s housing market isn’t anything like the housing market of the mid-2000s,” First American’s Fleming wrote in a Tuesday report titled “1980s Déjà Vu for the Housing Market.” “The housing market today is not overbuilt, nor is it driven by loose lending standards, subprime mortgages, or homeowners who are highly leveraged.”\nWhile some economic factors are stronger today than they were during the GFC, housing affordability is undeniably worse.\n“While housing and more generally consumer fundamentals are in a much stronger position today, affordability for the incremental buyer is worse than it was at the peak in 2006 before the crash,” Roger Ashworth, a managing director at Goldman Sachs, wrote in a credit strategy research paper released last week.\nAnd he’s not hopeful we’ll see home prices drop anytime soon: “Absent any negative shocks to the broader economy that would either boost excess supply of homes on the market or fuel an uptick in unemployment, we continue to expect home prices to rise at a slow pace.” In fact, he predicts we’ll see home prices rise by 1.8% by the end of the year, with a 3.5% increase by the end of 2024.\nLooking at more recent housing inventory data makes the issue even more stark. Between September 2018 and September 2023, the average number of homes on the market dropped a whopping 60% to fewer than 700,000 active listings, according to Realtor.com.\n“Unlike the turn of the millennium, house prices today are rising alongside mortgage rates, primarily due to low inventory,” Sam Khater, Freddie Mac’s chief economist, said in a statement released Sept. 29. “These headwinds are causing both buyers and sellers to hold out for better circumstances.”\nBut with the development that home sales transactions are at their lowest level in the past 13 years coupled with century-high mortgage rates of 8%, many real estate experts and economists aren’t hopeful that affordability constraints will let up soon.\nOut of fear of losing their lower interest rates, current homeowners are resistant to putting their homes on the market, ultimately leading to the abysmal inventory levels—leaving fewer and fewer properties exchanging hands. Indeed, more than 90% of existing-home owners are locked into mortgage rates below 6%, Odeta Kushi, deputy chief economist at First American, previously told Fortune.\n“These homeowners do not have a financial incentive to sell,” Kushi says. “The combination of reduced affordability and an even stronger rate lock-in effect suppresses home sales because you can’t buy what’s not for sale, even if you can afford it.”\n\nThis article, authored by Sydney Lake, was published by Fortune on 2023-10-20 under the category 'business'.\n\n","id":479}