{"title":"Shohei Ohtani rumors tracker: Latest news, updates on free agent's MLB future","context":"## Shohei Ohtani rumors tracker: Latest news, updates on free agent's MLB future\n\nThe Hot Stove dominoes have started to fall, but everyone who loves baseball — fans, players, coaches, front-office types and everyone else — is waiting for free agent Shohei Ohtani’s decision. Where will the global superstar sign his next contract?\nHe’s played his entire six-year MLB career with the Angels, but his teams haven’t even sniffed the postseason and Ohtani’s made his desire to win crystal clear, so he won’t be back. Will he chase every dollar possible, going solely by the highest offer? That seems unlikely, too. Remember, Ohtani wants to win.\nLots of teams can meet Ohtani in that middle ground, offering both lots of money — he will absolutely sign the largest contract in baseball history — and lots of chances to compete for a World Series title (or two or three). It’s a long list.\nMORE: Ranking 15 possible destinations for Shoehei Ohtani\nSo, the baseball world waits for news. We have been promised very little of that, though. ESPN’s Jeff Passan reported this: “If visits between Ohtani and a team are reported publicly, it will be held against the team.”\nSo, yeah. Probably won’t hear a ton, but that won’t stop the speculation. And it won’t stop us from passing along what precious few nuggets that are scattered about.\nMORE: Way-too-early MLB Power Rankings for 2024\nShohei Ohtani free agent rumors and updates\nOhtani has an 'affinity' for Boston, it seems\nDate: Nov. 27\nSource: Jeff Passan, ESPN\nHope everyone enjoyed the Thanksgiving holiday. Us baseball writers are pleased that Ohtani didn't decide to sign while the turkey was still warm. This isn't exactly \"breaking news\" because rumors have been swirling, but it's an aside from an in-the-know reporter that just might give one fan base a little too much hope and excitement.\nPassan wrote a piece about 10 teams to watch the rest of the offseason, and he threw this little note in the section about the Red Sox, and how they needed to sign Yoshinobu Yamamoto.\nBoston's bats are good, or good enough at least, to avoid having to spend like mad in a down year for free agent hitters -- unless, of course, it's for Ohtani, who has an affinity for Boston. If the Red Sox don't hit that jackpot, they're backfilled nicely with a system that includes outfielder Roman Anthony, shortstop Marcelo Mayer and catcher Kyle Teel, among the best trios of offensive prospects in baseball.\nIt's cool when the best player in the world is a free agent and has an \"affinity\" for your town.\n'Money's great, but winning's better'\nDate: Nov. 21\nSource: Max Scherzer, Rangers pitcher on Foul Territory\nOK, so this isn't necessarily a rumor, but an example of how much players would love for Ohtani to join their team. Scherzer was a guest on Foul Territory on Monday.\n\"Money's great, but winning's better.\"\n\nMax Scherzer shares his pitch for Shohei Ohtani to join the @Rangers 🏆\n\n▶️ https:\/\/t.co\/6KoSRqSgk2 pic.twitter.com\/PHW2jHWj6C — Foul Territory (@FoulTerritoryTV) November 20, 2023\nMaybe Ohtani won’t sign quite so soon after all\nDate: Nov. 20\nSource: Ken Rosenthal, The Athletic\nBuried at the bottom of Rosenthal’s piece on what an Ohtani contract might look like — incentives, opt-outs and all sorts of stuff — is this little bit of reporting:\nAn agreement at the winter meetings in Nashville the first week of December would be the ideal outcome for MLB, but not necessarily for Ohtani. He perhaps will be better off waiting for the signing of Japanese righty Yoshinobu Yamamoto, who is expected to be posted for free agency as soon as Monday, triggering a 45-day window for teams to negotiate with him. Losing out on the 25-year-old Yamamoto, who could command more than $200 million, might put certain teams on tilt, improving the landscape for Ohtani.\nInteresting, certainly.\nMariners out of the Ohtani chase?\nDate: Nov. 17\nSource: Daniel Kramer, MLB.com\nHere’s the key piece of the article: “Industry sources told MLB.com this week that landing Ohtani doesn’t appear to be within the Mariners’ realistic agenda this offseason.”\nIn a way, that’s surprising. The Mariners seem to check a lot of boxes for Ohtani. They’re set up to win for a long time with a bunch of young starting pitchers and a co-superstar in Julio Rodriguez. Plus, Ohtani would get to be part of the quest for the franchise’s first World Series title, he’d get to wear the same uniform as his baseball hero, Ichiro, and he’s lived there in the offseason. So it must be about the money, and Seattle’s reluctance to even get in the conversation. That’s gotta be super disappointing for Mariners fans starved for a title, right?\nOn the other hand, maybe the M’s know all about Ohtani’s desire to keep the rumor mill quiet, and leaking “news” like this would please Ohtani and his camp.\n‘Timing could be right for a Cubs-Ohtani union’\nDate: Nov. 16\nSource: Jesse Rogers, ESPN\nThe Cubs were one of the seven finalists for Ohtani the first time around, but lack of the DH in the NL at the time made it hard for Ohtani to choose Chicago. His primary goal was showing he could both hit and pitch at a high level for an MLB team, and trying to play the outfield instead of just DHing would have been too much, even for Ohtani.\nNow, though? The NL has the DH, and the Cubs are itching to make a sport-shaking signing. Well, another sport-shaking signing. They already poached Craig Counsell from the rival Brewers to be their new manager, and it would be shocking if they didn’t make a corresponding player-acquisition move. Ohtani’s at the top of the list.\nOhtani could potentially sign before Winter Meetings\nDate: Nov. 11\nSource: Alden Gonzalez, ESPN\nPretty much everyone in baseball would LOVE for this to happen. The team that winds up signing him, of course, will kick the Ohtani hype machine into gear ASAP. Not only is there merchandise to sell, but the front office will use that signing to help lure other potential free agents, maybe even for a “play with Ohtani” discount. But even for the other teams, knowing that Ohtani is off the board relatively soon into the offseason would allow them to shift to other priorities, like trading for Juan Soto or deciding which free-agent pitchers to pursue with the money that might have been earmarked for Ohtani.\n\nThis article, authored by Ryan Fagan, was published by Sporting News on 2023-11-27 under the category 'sports'.\n\n","id":480}
{"title":"“We Sell More F-150s to NASCAR Fans” – Ford Insider Reveals Insane Mustang Stat Amid Big Change","context":"## “We Sell More F-150s to NASCAR Fans” – Ford Insider Reveals Insane Mustang Stat Amid Big Change\n\nLOS ANGELES, CALIFORNIA – FEBRUARY 05: Austin Cindric, driver of the #2 eCascadia Ford, drives during qualifying for the NASCAR Cup Series Busch Light Clash at Los Angeles Memorial Coliseum on February 05, 2022 in Los Angeles, California. (Photo by Sean Gardner\/Getty Images)\nRyan Blaney’s recent championship victory in his Ford Mustang at the NASCAR Cup Series Championship Race was a moment of pride and celebration for Ford. However, it’s not just about winning the races or championships for the manufacturer. It’s about marketing and maintaining their brand loyalty, as a Ford insider reveals.\nAmerica’s Favorite Video Today\nLast Sunday, Ryan Blaney secured his first-ever championship by skillfully maneuvering his Ford Mustang to victory at Phoenix. He held off the late challenges from Chevrolet drivers Kyle Larson and William Byron. This achievement marks a significant moment for Ford and its NASCAR program, as it made a clean sweep by winning championships in Truck, Xfinity, and Cup Series.\nMark Rushbrook reveals the vehicle NASCAR fans prefer to buy from Ford\nADVERTISEMENT Article continues below this ad\nIn the post-race media conference, Mark Rushbrook, the Global Director for Ford Performance, was asked if winning the championship has any significance for the manufacturer as a whole in terms of marketing the brand globally.\nMark Rushbrook emphasized the importance of winning with the Mustang from a global marketing perspective. He stated, “Yeah, winning is everything for us, just as a point of pride. It’s certainly going to be a celebration in Dearborn. My phone has been blowing up with Ford family members and our senior executives already so excited about it. It means a lot internally to the customer because motorsports is so important to us.”\nRushbrook highlighted that success on the racetrack is the foundation of successful marketing programs. Winning races and championships builds credibility with fans and encourages them to engage with the brand. He explained, “That is the basis for successful marketing programs; it is success on the racetrack. So you have to win the races, you have to win championships to have that credibility, and for fans to engage with your brand and make them proud to have a Ford parked in their driveway or in their garage.”\nWhile Ford’s racing program, featuring the Mustang, certainly boosts the sale of this iconic sports car, the Ford insider dropped an interesting fact. Rushbrook revealed, “For us, NASCAR, even though we’re racing a Mustang, we certainly sell Mustangs because of it. But we sell more F-150s to NASCAR fans. This is a proof point for them.”\nThe Ford F-150 truck, known for its ruggedness and reliability, has garnered a dedicated following among NASCAR enthusiasts. Winning the championship is not only about showcasing the Mustang but also the Ford-150, with which Ben Rhodes won his second Truck Series championship on Friday. This is also a testament to the power of NASCAR in influencing car-buying decisions.\nFord’s global marketing strategy also leverages the success of the Mustang in NASCAR, utilizing it as a marketing tool to promote their road cars worldwide. As the seventh generation Mustang continues to be sold globally as a road car, it’s racing not only in NASCAR but also in various international series, including Australia Supercars, Mustang GT3, Mustang GT4, and Dark Horse R with a Spec Challenge.\nIn essence, Ford takes the benefits from any Mustang’s racing success and uses it to market their cars globally. It’s a win-win situation for both the brand and racing enthusiasts. Although, all this might not have come to pass were it not for a timely intervention by “The Captain.”\nRoger Penske played a big part in calming Ryan Blaney down in the clutch moment of the race\nIn the heat of the championship race at Phoenix, Ryan Blaney’s competitive spirit almost got the best of him. He was racing for the championship and was eager to secure the lead from Ross Chastain in the closing few laps. However, he was also aware that he needed to maintain his position to win the title.\nWatch This Story | Star Wars Saga: Bubba Wallace’s Galactic Surprise for Ryan Blaney\nADVERTISEMENT Article continues below this ad\nIn the post-race conference, the Team Penske driver expressed his frustration, stating, “There is no secret that I can snap on the radio. That’s been my whole life. That’s been my whole career. It’s just kind of something I do.” He described the intense battle with Ross Chastain, who blocked him multiple times, making it a tough fight.\nThe final push came when Blaney made contact with Chastain. A move made out of frustration, as he admitted. But at this crucial moment, team owner Roger Penske, often referred to as “The Captain,” stepped in. He reminded Blaney that he was not racing against Chastain but against the HMS duo. Penske’s calming influence helped Blaney regain composure, ensuring that he didn’t take any unnecessary risks. The result? A championship for Ryan Blaney and another testament to the guidance of “The Captain” in high-pressure situations.\nADVERTISEMENT Article continues below this ad\nIn NASCAR, it’s not just about speed and strategy; it’s also about maintaining composure under intense pressure. The wisdom of experienced leaders like Roger Penske plays a crucial role in the success of their teams.\n“We’re Champions”- Roger Penske Flexes on Rick Hendrick As He Publicly Boasts Team Penske’s Strength With Back-to-Back Titles\n\nThis article, authored by Veerendra Vikram Singh, was published by Essentially Sports on 2023-11-06 under the category 'sports'.\n\n","id":481}
{"title":"ICC World Cup 2023 Most Runs and Wickets: Full List of top 10 batsmen and bowlers in 2023 edition of cricket World Cup, Know where Virat Kohli, Rohit Sharma, Shami, Bumrah, rank","context":"## ICC World Cup 2023 Most Runs and Wickets: Full List of top 10 batsmen and bowlers in 2023 edition of cricket World Cup, Know where Virat Kohli, Rohit Sharma, Shami, Bumrah, rank\n\nICC Men's ODI World Cup 2023 Most Runs and Wickets: With just the final of the ICC Men's ODI World Cup 2023 won by Australia beating India by six wickets on Sunday, November 19, at Narendra Modi Stadium in Ahmedabad, the whole world is ready to witness who will be crowned the World Champions in the 50-over format of the game. India defeated New Zealand by 70 runs in the first semi-final on Wednesday, November 15, at the Wankhede Stadium in Mumbai, and Australia beat South Africa by three wickets in the second semi-final on Thursday, November 16, at the Eden Gardens in Kolkata.\nDuring all these matches played, we witnessed some great knocks by the batter as well as some brilliant spells by the bowlers, which annihilated the opposition and kept the audience in awe.\nHere is the list of the top 10 batsmen and bowlers in this edition of the ODI World Cups—\nTop 10 Batsmen of ODI World Cup 2023:\nRank Player Mat Runs 1 V Kohli (IND) 11 765 2 RG Sharma (IND) 11 597 3 Q de Kock (SA) 10 594 4 R Ravindra (NZ) 10 578 5 DJ Mitchell (NZ) 10 552 6 DA Warner (AUS) 11 535 7 SS Iyer (IND) 11 530 8 KL Rahul (IND) 11 452 9 HE van der Dussen (SA) 10 448 10 MR Marsh (AUS) 10 441\n*Still Batting\n10. Mitch Marsh, Australia\nIn the absence of Travis Head, Marsh has played the role of opener with much responsibility for the Aussies, providing good starts as he accumulated 441 runs in 10 matches.\n9. Rassie van der Dussen, South Africa\nRassie has been a support system for the Proteas in the middle order. Though sometimes inconsistent, he has accumulated 448 runs in 10 innings. He has two centuries and two fifties under his belt in his campaign, with a high score of 133 runs.\n8. KL Rahul, India\nThe Indian number five has been on great form scoring 452 runs giving great support to the Indian middle order. He has one century and two fifties to his name in the World Cup.\n7. Shreyas Iyer, India\nIyer is the backbone of the Indian middle order; these are the words of Head Coach Rahul Dravid. Iyer has provided good support to the team when needed, scoring 526 runs in 10 matches. He also has three fifties and two centuries to his name.\n6. David Warner, Australia\nOne of the most destructive openers of the modern era, Warner has been providing great starts to Australian batting, scoring 528 runs in ten innings. His highest score is 163 runs, along with two centuries and two fifties.\n5. Daryl Mitchell, New Zealand\nMitchell has been a powerhouse for the Kiwis in the middle order, scoring 520 runs in nine matches. His high score was 130 runs in this campaign, and he provided good support from time to time whenever the team needed it.\n4. Rachin Ravindra, New Zealand\nThe biggest find of this year's World Cup has to be this 23-year-old all-rounder, Rachin Ravindra. Ravindra has smashed three centuries and two fifties in this campaign and accumulated a total of 578 runs in 10 matches.\n3. Quinton de Kock, South Africa\nA pivotal part of the South African top-order, de Kock has been a phenomenal batter, scoring 594 runs in 10 matches. de Kock has the most number of centuries in this tournament, with four so far.\n2. Rohit Sharma, India\nThe Indian captain has been on an all-out attack since the start of the World Cup campaign. He has smashed a total of 597 runs in 11 matches with one century and three fifties so far.\n1. Virat Kohli, India\nOne of the best batsmen that ever graced the sport of cricket, Virat Kohli, is at the top with 765 runs in 11 matches. He has five fifties and three centuries to his name, with the highest score of 117 runs.\nTop 10 Bowlers of ODI World Cup 2023:\nRank Player Mat Wkts 1 Mohammed Shami (IND) 7 23 2 A Zampa (AUS) 11 23 3 D Madushanka (SL) 9 21 4 JJ Bumrah (IND) 11 20 5 G Coetzee (SA) 8 20 6 Shaheen Shah Afridi (PAK) 9 18 7 M Jansen (SA) 9 17 8 RA Jadeja (IND) 11 16 9 Josh Hazlewood 11 16 10 MJ Santner (NZ) 10 16 11 BFW de Leede (NED) 9 16\n*Still Bowling\n10. Mitch Santner, New Zealand\nNew Zealand's bowling has mostly depended on Santner, as he has been effective for the Kiwis on the turning tracks of India, as he picked up 16 wickets and conceded 449 runs in 10 matches.\n9. Josh Hazlewood, Australia\nThe Aussie pacer has been phenomenal with the new ball. He has created movements with the ball which the batters struggle to play. He picked up 16 wickets in 11 matches.\n8. Ravindra Jadeja, India\nJadeja has been bowling some beautiful spells in this tournament for India, especially in the middle overs. He picked up 16 wickets, conceding just 398 at an economy rate of 4.25 in 10 matches.\n7. Marco Jansen, South Africa\nStanding at a staggering 6 feet 7 inches tall, Jansen has made full use of his height, and it was evident in his bowling too. The 23-year-old picked up 17 wickets in nine matches for the Proteas, conceding 450 runs.\n6. Shaheen Shah Afridi, Pakistan\nAfridi is the best bowler for Pakistan in this tournament, with 18 wickets and conceding 481 runs in nine matches.\n5. Gerald Coetzee, South Africa\nThe 23-year-old Coetzee has picked up 20 wickets for the Proteas in eight matches, conceding 396 runs.\n4. Jasprit Bumrah, India\nBumrah has taken 20 wickets under his belt, conceding 373 runs. He also has the best economy rate in the whole tournament, with 4.06.\n3. Dilshan Madushanka, Sri Lanka\nDespite such a dreadful performance by the Sri Lankan side in this World Cup, Madhushanka managed to be in the top 2 on the highest wicket-takers list. He picked up 21 wickets, conceding 525 runs.\n2. Adam Zampa, Australia\nAdam Zampa is having a World Cup to remember, as he is the highest wicket-taker for the Aussies. He picked up 23 wickets, in which there were three four-wicket hauls, conceding 515 runs.\n1. Mohammad Shami, India\nShami announced his return to the World Cup with a bang, picking a fifer in the very first match he played for India. He has picked up 24 wickets so far in just six matches, conceding just 257 runs. He has picked up three five-wicket hauls including a seven-wicket haul against New Zealand in the semi-final on Wednesday, November 15 at the Wankhede Stadium in Mumbai.\nCatch the latest stock market updates here. For all other news related to business, politics, tech, sports, and auto, visit Zeebiz.com.\n\nThis article, authored by zee business, was published by Zee Business on 2023-11-18 under the category 'business'.\n\n","id":482}
{"title":"Blackhawks vs. Penguins live score, updates, highlights from Connor Bedard's NHL debut","context":"## Blackhawks vs. Penguins live score, updates, highlights from Connor Bedard's NHL debut\n\nFirst game, first point, first win.\nConnor Bedard's debut did not disappoint on Tuesday, as the Chicago rookie helped the Blackhawks to a 4-2 win over the Penguins on opening night.\nThe Blackhawks rallied from a 2-0 deficit, scoring four unanswered goals to pick up the victory in Pittsburgh.\nBryan Rust opened the scoring for the Penguins in the first period, and a Sidney Crosby goal in the second doubled the Pittsburgh lead. However, Bedard helped set up a Ryan Donato goal in the middle frame to get the Blackhawks on the board, picking up his first NHL point in the process.\nIn the third period, Cole Guttman potted the equalizer for Chicago early in the frame. With less than five minutes left in regulation, Jason Dickinson fired home a shot from the slot that gave Chicago its first lead of the night. A Nick Foligno empty net goal sealed the deal for the Blackhawks.\nBedard was as advertised in his NHL debut. The Chicago rookie led all players on his club in shots on goal, recording five in his first game on 11 shot attempts. His 21:29 time on ice was second to only Seth Jones, as Chicago head coach Luke Richardson did not hold the 18-year-old back. He did struggle in the faceoff dot, winning just two of 13 draws, but it was a strong first impression at the NHL level.\nFor the Penguins, the third period struggles from last season have seemingly carried over to start this year. Last year, Pittsburgh finished tied for the most losses after taking a lead into the third period. The crew followed that trend on Tuesday night, letting a 2-1 lead to start the final frame slip away.\nBedard and the Blackhawks are back in action on national TV tomorrow, as Chicago heads to Boston for a Wednesday night date with the Bruins.\nMORE: Watch Blackhawks vs. Penguins live on Fubo (free trial)\nThe Sporting News provided updates and highlights from Connor Bedard's NHL debut in the Blackhawks vs. Penguins game.\nBlackhawks vs. Penguins score\n1 2 3 F Blackhawks 0 1 3 4 Penguins 1 1 0 2\nBlackhawks vs. Penguins live updates, highlights from Connor Bedard's NHL debut\nAll times Eastern\nFinal: Blackhawks 4, Penguins 2\n10:50 p.m. — The Blackhawks score four unanswered goals to come from behind and take down the Penguins on opening night. Bedard was as advertised in his debut, picking up his first NHL point in the process. The third period struggles continue over from last season for the Penguins.\n10:48 p.m. — Jarry back to the Pittsburgh bench again for the extra attacker.\nBlackhawks 4, Penguins 2\n10:48 p.m. — GOAL! Perry finds Foligno for the empty net goal. The veteran line gave the Blackhawks the lead, and then the unit ices the game with 1:27 to go.\n10:47 p.m. — Penguins head coach Mike Sullivan pulls Jarry for the extra attacker with over two minutes to go.\nBlackhawks 3, Penguins 2\n10:40 p.m. — GOAL! Chicago takes its first lead of the game thanks to Jason Dickinson. Nick Foligno drops a pass on a zone entry to Perry, who tries to get a shot on net, but it deflects to the middle and Dickinson snaps it home. The Penguins, who struggled with third period leads last year, have given up three unanswered and find themselves down one with 4:33 to go.\nJason Dickinson buries the crazy carom to give Chicago the late lead in Pittsburgh!#Blackhawks pic.twitter.com\/rSxEzSnylC — Hockey Daily 365 l NHL Highlights & News (@HockeyDaily365) October 11, 2023\n10:36 p.m. — Mrazek records another sensational save, this time on Guentzel. Karlsson makes an excellent backhand pass down to Guentzel at the dot for a one-timer, but Mrazek pushes over and snags the shot. He's been the best player on either side tonight.\nPenguins 2, Blackhawks 2\n10:31 p.m. — GOAL! We have a tied game in Pittsburgh as Guttman gets the equalizer for Chicago. He found a soft spot in the Penguins defense in the slot, gets a pass from Jones and makes no mistake, beating Jarry by the glove. It's 2-2 with 9:55 left in regulation.\nTie game with less than half the period to go 👀 pic.twitter.com\/uqB1Z2Bnol — B\/R Open Ice (@BR_OpenIce) October 11, 2023\n10:24 p.m. — The Blackhawks can't take advantage of a power play again, dropping to 0 for 4 tonight on the PP. Pittsburgh remains ahead 2-1 with 13:43 left in the period.\n10:20 p.m. — Pittsburgh kills off the Nieto penalty, but seconds after going back to even strength, Letang picks up a cross-checking minor. Chicago goes right back to the man advantage.\n10:19 p.m. — Corey Perry had not just one, but two point-blank chances in front of the Pittsburgh net, but he put the puck right into the midsection of Jarry both times.\n10:17 p.m. — The Blackhawks are going to their third power play of the night as Matt Nieto is called for hooking just 2:28 into the third.\n10:14 p.m. — The third period is a go from Pittsburgh with the Penguins holding onto a one-goal lead.\nEnd of the second period: Penguins 2, Blackhawks 1\n9:56 p.m. — Both teams get on the board in the middle frame, but it's the Penguins that remain ahead going into the final period. Bedard looks to be improving every shift and he picks up his first NHL point on the Donato goal.\n9:54 p.m. — An awful line change by the Blackhawks allows Malkin to send Smith on a breakaway, but Mrazek comes up with the stop.\nPenguins 2, Blackhawks 1\n9:47 p.m. — GOAL! Ryan Donato slips home a rebound from the top of the crease to put Chicago on the board, and Bedard has his first NHL point, picking up a secondary assist on the tally. Alex Vlasic walks in off the wall and puts a low shot on Jarry that is saved, but Donato pulls the rebound around and by Jarry's leg with 4:23 left in the second.\n🚨first NHL assist for Connor Bedard. the full sequence starting with his zone entry pic.twitter.com\/JqJMhchiTN — Shayna (@hayyyshayyy) October 11, 2023\nRyan Donato puts home the juicy rebound to give Connor Bedard his first NHL point!#Blackhawks | #NHLFaceoff pic.twitter.com\/JbjVPvHVLE — Hockey Daily 365 l NHL Highlights & News (@HockeyDaily365) October 11, 2023\n9:46 p.m. — Chicago kills off the delay of game penalty, so it's back to even strength. For all the star power on the top unit, the Pittsburgh power play has not been as crisp as expected.\nPenguins 2, Blackhawks 0\n9:42 p.m. — GOAL! Crosby's goal stands, as the official determine the play was onside. A great cycle from Pittsburgh results in the captain putting home his first of the year with 8:04 to go. With the unsuccessful challenge, the Blackhawks are hit with a delay of game penalty, so the Penguins get the goal and a power play.\nJUST CROSBY DOING HIS THING 💥 pic.twitter.com\/AN0gLjd2lY — B\/R Open Ice (@BR_OpenIce) October 11, 2023\n9:39 p.m. — The Penguins may have doubled their lead, as Crosby sends a loose puck into the wide open net for the score off a give-and-go with Guentzel. However, the Blackhawks are challenging the play for offside. Marcus Pettersson had to reach for the puck along the blue line and it may have come out of the zone.\n9:27 p.m. — Jarry keeps the shutout going with two real strong saves on Johnson. A shot from the point was tipped by an unmanned Johnson at the top of the crease. When that didn't go, he got a second whack at the loose puck, but Jarry stuck out the leg to make the stop.\n9:23 p.m. — Reilly Smith, who was traded to the Penguins this offseason from the Golden Knights, is denied by the glove of Mrazek off the rush. Smith had a puck trickle to him on the right side, but he shot it right into the mitt of the Blackhawks goaltender.\nPetr Mrazek with a nifty glove stop on Reilly Smith#Blackhawks | #NHLFaceoff pic.twitter.com\/AkE9PEgRrZ — Hockey Daily 365 l NHL Highlights & News (@HockeyDaily365) October 11, 2023\n9:21 p.m. — Pittsburgh kills off the Carter minor. Chicago made it fairly easy on that power play, putting just one shot on net and spending a majority of the man advantage passing around the perimeter.\n9:19 p.m. — Jeff Carter gives the Blackhawks an early power play, as the Penguins veteran is called for holding the stick of Korchinski. Chicago gets its second crack on the man advantage.\n9:15 p.m. — Puck is down for the second period in Pittsburgh.\nEnd of the first period: Penguins 1, Blackhawks 0\n8:56 p.m. — The first 20 minutes features tons of shot attempts, but Rust's tally is the only one on the scoreboard. A strong showing so far from Bedard, who has not shied away from putting the puck on net. He had four shot attempts in the opening frame, with two on net. The Blackhawks out-shot the Penguins 17-13, but Pittsburgh holds the lead.\n8:51 p.m. — An excellent shift by Bedard nearly results in his first goal. Initially, Bedard shows off his elite release by zipping a shot from long-range, but it's turned aside by Jarry. Later in the shift, the rookie gets two whacks at a loose puck in front of the crease, but he could not beat the Penguins goaltender.\nBedard shows off the release, Jarry with the save pic.twitter.com\/BKLDkQdpwD — Hockey Realm (@hockey_realm) October 11, 2023\nConnor Bedard with his first good scoring chance. pic.twitter.com\/6TWSCfXUlR — Steven Ellis (@SEllisHockey) October 11, 2023\n8:47 p.m. — Noel Acciari and Tyler Johnson collide in the neutral zone, and Johnson is left leaking from the bridge of his nose. Initially Acciari is assessed a double minor for high-sticking, but after reviewing the play, no penalty was killed. The officials deemed that the stick was not above the shoulders, therefore, no infraction.\n8:46 p.m. — The Blackhawks kill off the Kaiser minor. Pittsburgh managed to get three shots on Mrazek, but could not build on its lead.\n8:43 p.m. — Karlsson dances by Cole Guttman at the blue line, walks into the slot and lets one rip, but Mrazek stares it down the whole way, making the glove stop on the Penguins defenseman.\nErik Karlsson with the moves 👀#LetsGoPens | #NHLFaceoff pic.twitter.com\/GCWVIGnAS2 — Hockey Daily 365 l NHL Highlights & News (@HockeyDaily365) October 11, 2023\n8:41 p.m. — Pittsburgh heads to its first power play of the game, as Wyatt Kaiser trips up Malkin in the neutral zone. This will be the first time seeing Erik Karlsson running the power play for the Penguins, taking Letang's place on the top unit with Crosby, Malkin, Guentzel and Rickard Rakell.\n8:36 p.m. — Evgeni Malkin makes a beautiful saucer pass to Jake Guentzel cutting the net, but the Penguins winger could not elevate the puck over the shoulder of Mrazek. At the other end, Taylor Raddysh took a feed from behind the net, but put it right in the midsection of Jarry.\n8:34 p.m. — Rust opening the scoring for the Penguins to start the year has become a trend. The winger has potted the first goal in the team's opener in each of the last three seasons.\n8:30 p.m. — Moments after the Rust tally, Crosby nearly doubles the Penguins' lead on a breakaway, but his backhand attempt was stuffed by Mrazek's pad.\nPenguins 1, Blackhawks 0\n8:29 p.m. — GOAL! Right after the Penguins killed off the Eller minor, Pittsburgh gets on the board first courtesy of Bryan Rust. Kris Letang throws a shot on net that Rust tips up and over the shoulder of the Blackhawks goaltender. It was not originally called a goal on the ice, but after review, it's 1-0 Penguins with 12:56 remaining in the frame.\nRust gets the Penguins their first of the season 🚨 pic.twitter.com\/RKNyaJT0LD — B\/R Open Ice (@BR_OpenIce) October 11, 2023\n8:28 p.m. — It's a strong showing from the top PP unit for the Blackhawks, but Bedard and Co. can't capitalize on the man advantage. Chicago had four shots on goal, including a Bedard one-timer that was stopped by the pad of Mrazek.\n8:26 p.m. — Penguins forward Lars Eller is called for goalie interference, as he clips the leg of Petr Mrazek in the crease. The Blackhawks head to the first power play of the game about five minutes into the period.\n8:23 p.m. — Through the first four minutes, it's been a back-and-forth affair. Neither team have been able to sustain much pressure. Most of Chicago's shot attempts have been from the outside, making it easy on Tristan Jarry.\n8:19 p.m. — It was an uneventful first shift for Bedard, as the Penguins controlled most of the play in the Blackhawks' zone.\n8:17 p.m. — Bedard and Crosby square up for the opening face off, and Bedard's debut is underway!\nSidney Crosby 🆚 Connor Bedard on the draw to start this one off.\n\nWhat a moment. pic.twitter.com\/4BPboh8jdp — Sportsnet (@Sportsnet) October 11, 2023\nPregame\n7:58 p.m. — Here is how the two sides are lining up for the season opener.\nAlmost time for hockey!\n\n📺: ESPN, ESPN+ pic.twitter.com\/Qsk9Jgfp1c — Pittsburgh Penguins (@penguins) October 10, 2023\n#Blackhawks Opening Night lineup vs. Penguins:\nHall-Bedard-Donato\nT. Johnson-Reichel-Raddysh\nKatchouk-Guttman-Athanasiou\nPerry-Dickinson-Foligno\n\nVlasic-Jones\nKorchinski-Murphy\nTinordi-Kaiser\n\nMrazek\nSöderblom\n\nExtras: Entwistle, R. Johnson, Zaitsev — Charlie Roumeliotis (@CRoumeliotis) October 10, 2023\n7:50 p.m. — Bedard isn't the only rookie making their debut tonight. Blackhawks defenseman Kevin Korchinski is playing in his first NHL game tonight. Korchinski was the No. 7 overall pick in the 2022 draft, one of three first-round selections by Chicago that year. He played his junior career with the Seattle Thunderbirds of the WHL.\n7:36 p.m. — You want to talk confidence? How about going without a bucket in warmups? Bedard is rocking the no-helmet look ahead of his NHL debut.\nConnor Bedard going with the no-helmet look during pregame warmups. #Blackhawks pic.twitter.com\/qrr93vlMsh — Charlie Roumeliotis (@CRoumeliotis) October 10, 2023\n7:33 p.m. — A stick may be important when playing the game of hockey.\nNote to self:\nDon't forget your stick ahead of your NHL debut. pic.twitter.com\/guzVprRXfY — Sportsnet (@Sportsnet) October 10, 2023\n7:02 p.m. — If it feels like Sidney Crosby, Kris Letang and Evgeni Malkin have been in Pittsburgh forever, that's because it had. The trio are set to surpass Yankees legend Derek Jeter, Mariano Rivera and Jorge Posada as the longest-tenured trio of teammates in North American sports history.\nReady for the Big Three to take the ice for their 18th season together.\n\nSidney Crosby, Evgeni Malkin and Kris Letang are set to surpass the New York Yankees’ Derek Jeter, Mariano Rivera and Jorge Posada as the longest-tenured trio of teammates in NHL, MLB, NBA and NFL history. pic.twitter.com\/bvcWZOw7kO — Pens Inside Scoop (@PensInsideScoop) October 10, 2023\n6:45 p.m. — All the buzz has been about Bedard leading up the matchup, but there's a new Penguin on the roster. Erik Karlsson, who won his third Norris Trophy last season, was brought in this summer in a trade with the Sharks. It gives the Penguins a talented duo on the blue line of Kris Letang and Karlsson, although the two likely won't be paired together.\nActually, this is exactly what we’ve been waiting for. pic.twitter.com\/0ZJA4YRs6v — Pittsburgh Penguins (@penguins) October 10, 2023\n6:30 p.m. — Connor Bedard is in the house for his NHL debut. It's the most anticipated first game for a rookie since Auston Matthews' debut in 2016.\nBlackhawks vs. Penguins start time\nDate: Tuesday, Oct. 11\nTuesday, Oct. 11 Time: 8 p.m. ET (7 p.m. CT)\nThe Blackhawks and Penguins are set for puck drop at 8 p.m. ET, 7 p.m. CT in Chicago.\nThe game is being played at PPG Paints Arena in Pittsburgh, Pa.\nMORE: Ranking the NHL's top 50 players for the 2023-24 season\nWhat channel is Blackhawks vs. Penguins on today?\nTV Channel (U.S): ESPN\nESPN TV Channel (Canada): Sportsnet, TVA Sports\nSportsnet, TVA Sports Live stream (U.S.): ESPN+, Fubo\nESPN+, Fubo Live stream (Canada): Sportsnet+\nESPN has coverage of the Blackhawks vs. Penguins game on Tuesday evening. The Pittsburgh-Chicago contest is one of three games that the network has on opening night.\nESPN's \"A-team\" will be on the call for Bedard's debut, as Sean McDonough (play-by-play), Ray Ferraro (analyst) and Emily Kaplan (reporter) will be the broadcast team for Blackhawks vs. Penguins.\nThe game can be streamed through ESPN+, or with Fubo, which offers a free trial.\nMORE: NHL predictions 2023-24: Awards, playoff projections, Stanley Cup pick\nIn Canada, Sportsnet will be bringing the action to TVs. TVA Sports also will have the game for the French-speaking audience. Cord cutters can catch the action through Sportsnet+.\nNHL Opening Night schedule 2023\nThe Blackhawks-Penguins game is sandwiched between two other opening night matchups.\nThe first game on the docket was a matchup between the Predators and the Lightning. Tampa Bay is starting this year without star goaltender Andrei Vasilevskiy, who is expected to miss the first two months of the season after undergoing back surgery.\nAfter the Blackhawks-Penguins contest, the Golden Knights vs. Kraken will wrap up the evening. Before the game in Vegas, the Golden Knights will hold a ceremony to raise their 2023 Stanley Cup banner.\nTuesday, Oct. 10\n\nThis article, authored by Bryan Murphy, was published by Sporting News on 2023-10-10 under the category 'sports'.\n\n","id":483}
{"title":"Ole Miss vs. Georgia live score, updates, highlights from Week 11 college football game","context":"## Ole Miss vs. Georgia live score, updates, highlights from Week 11 college football game\n\nThe SEC East champs put on a show, to say the least. Georgia dominated against ninth-ranked Ole Miss, coming up with a 52-17 win to earn a date with Alabama in the SEC Championship Game in December. All-American tight end Brock Bowers returned to the field for his final homestead only 26 days after TightRope surgery. Starting against the Rebels, he had three catches for 34 yards, adding a touchdown in the fourth quarter. He missed just two games after suffering the high ankle sprain against Vanderbilt on Oct. 14. Georgia didn't need him, though, as the running backs had themselves a night for both teams. Kendall Milton and Daijun Edwards scored two touchdowns each as the Bulldogs finished with 300 rushing yards. Milton ended the night with a career-high 127 yards. For Ole Miss, Quinshon Judkins scored the only two touchdowns and finished with 75 yards. Unfortunately for Rebels, injury continues to plague them after Micah Pettus, the team's top lineman, was ruled out with a broken foot bone he sustained during practice. Quarterback Jaxson Dart left the game at the end of the third quarter after a hit from two Georgia defenders. He held his collarbone as he entered the injury tent. He was taken back to the locker room for further examination and did not return to the game, leaving it in the hands of Spencer Sanders. Before his exit, Dart passed for 112 yards and one interception. Sanders finished it up with 61 yards on four completions. For the Dawgs, Carson Beck finished with 306 yards, two touchdowns and one interception. It's the fourth game this season with over 300 yards and at least two touchdowns. In its trip to the SEC Championship for the third-straight year, Georgia will face Alabama, who it lost to in 2021. A dominant win over the Rebels surely inspires some confidence with two regular season games left. We'll see if the victory was enough to overtake Ohio State as the top team in College Football Playoff rankings.\nMORE: Watch Ole Miss vs. Georgia live with Fubo (free trial)\nThe Sporting News tracked live updates and highlights from Ole Miss-Georgia game.\nOle Miss vs. Georgia score\nQ1 Q2 Q3 Q4 F Ole Miss 7 7 0 3 17 Georgia 14 14 10 14 52\nOle Miss vs. Georgia results, highlights from Week 11 game\n(All times Eastern)\n10:24 p.m. – That'll do it. The SEC East champions make a statement win against Ole Miss to extend its win streak to 27.\nOle Miss 17, Georgia 52\n10:14 p.m. TOUCHDOWN – Still, there's no stopping the Dawgs. Andrew Paul runs in a 4-yard touchdown to further add to Georgia's lead, which now stands at 52-14. Four minutes and 12 seconds remain on the clock.\nOle Miss 17, Georgia 45\n8:05 p.m. FIELD GOAL – Caden Davis knocks in a 29-yard field goal to add three more points. The Rebels still trail Georgia heavily.\n9:59 p.m. – Dayton Wade, are you kidding?! The receiver makes an incredible one-handed catch on the five-yard pass from Sanders. You'll have to see this one to believe it.\nOle Miss 14, Georgia 45\n9:50 p.m. TOUCHDOWN – Brock Bowers is back! Beck finds the tight end on a 8-yard pass for his first touchdown since Oct. 7. The Dawgs have showed no signs of slowing down, scoring 31 answered points against Ole Miss.\nHe's still HIM\n\nWatch live on ESPN#GoDawgs pic.twitter.com\/B5aa6zGpOV — Georgia Football (@GeorgiaFootball) November 12, 2023\n9:48 p.m. – With his 51-yard run to help wrap up the third quarter, Kendall Milton sets a career-high in single-game rushing yards. He has 127 yards entering the final frame.\nEnd of third quarter: Ole Miss 14, Georgia 38\n9:37 p.m. – Dart is down after combining with Zion Logue and Daylen Everette. He enters the injury tent and is replaced by Spencer Sanders.\nOle Miss 14, Georgia 38\n9:32 p.m. FIELD GOAL – Peyton Woodring adds three for the Bulldogs with a 27-yard field goal, his first attempt of the night.\n9:29 p.m. – Forty-three yards for Dominic Lovett just might seal the deal for Georgia. His gain, and a personal foul against Ole Miss, sets the Bulldogs up within the Rebels' red zone.\nOle Miss 14, Georgia 35\n9:17 p.m. TOUCHDOWN – Milton takes it home again! His 33-yard touchdown extends Georgia's lead to 21. Nine minutes are left in the third quarter. Can Ole Miss find some momentum and rally?\n9:07 p.m. – He fakes it! Fraser Masin, the Ole Miss punter, run it himself for 24 yards to the 50. A personal foul pushes the Rebels back to their own 35, and it's first and 25.\n9:06 p.m. – Down goes Dart! CJ Allen reached the Rebels' quarterback for the sack.\nEnd of second quarter: Ole Miss 14, 28\n8:39 p.m. INTERCEPTION – Oh how the tables turn. Beck throws his own miscue, which deflects off receivers' hands for an interception by Daijahn Anthony.\nPick going into the locker room! @daijahn5 | ESPN pic.twitter.com\/GQfhipcsK7 — Ole Miss Football (@OleMissFB) November 12, 2023\n8:34 p.m. INTERCEPTION – Dart misses his target, and it's intercepted! Javon Bullard grabs his second pick in two games. The Dawgs take over at the Rebels' 45-yard line with only a minute remaining in the second quarter.\nGet up, 478.\nJavon Bullard with the INT pic.twitter.com\/BKFncvddTK — Dayne Young (@dayneyoung) November 12, 2023\nOle Miss 14, Georgia 28\n8:22 p.m.TOUCHDOWN – Kendall Milton runs in the score! After review, his touchdown stands, and it's his fifth-straight game with one. The Dawgs take a two-possession lead with only a few minutes until halftime.\nOle Miss 14, Georgia 21\n8:07 p.m. TOUCHDOWN – Edwards runs in his second touchdown of the night! It follows a 41-yard connection from Beck to McConkey. Georgia takes its second seven-point lead of the evening. Just less than 10 minutes remain in the first half.\nFilthy route from Ladd McConkey🤧🤧\n\npic.twitter.com\/4fXroDphi3 — PFF College (@PFF_College) November 12, 2023\nOle Miss 14, Georgia 14\n7:59 p.m. TOUCHDOWN – It's Judkins again! He runs it in for four yards to tie up the game early in the second quarter. There was a flag on the play, but it was on the Georgia defense for having 12 players on the field.\nEnd of first quarter: Ole Miss 7, Georgia 14\nOle Miss 7, Georgia 14\n7:45 p.m. TOUCHDOWN – All Georgia needs is a minute, and it's got another one on the board! Beck finds Ladd McConkey for a 29-yard touchdown. With 3:09 left in the first frame, the Bulldogs have a seven-point lead.\n7:40 p.m. – The Rebels go for it on 4th and three, but Dart throws it away. They turn the ball over on downs at the UGA 40.\nOle Miss 7, Georgia 7\n7:31 p.m. TOUCHDOWN – A quick drive for the Bulldogs, and they're on the board! Beck flicks it to Daijun Edwards for a one-yard touchdown. It's tied up in Athens with 7:28 on the clock in the first quarter.\n7:29 p.m. – Carson Beck tosses to Rara Thomas, who gets a 44-yard gain. The Bulldogs have a first down at Ole Miss's 13.\nOle Miss 7, Georgia 0\n7:23 p.m. TOUCHDOWN – Judkins tries again, and it's good! The Rebels get on the board in their first drive of the game with Judkins' 15-yard touchdown run.\n7:22 p.m. – Quinshon Judkins gets into the end zone, but holding is called on Ole Miss. It takes over at Georgia's 15.\n7:19 p.m. – Jaxson Dart completes pass to Caden Prieskorn for a 33-yard play. The Rebels enter Georgia's redzone at the five-yard line.\n7:14 p.m. PENALTY – On the very first play of the game, Ole Miss's o-line is called for a false start.\n6:50 p.m. – Beware the Rebs.\n6:45 p.m. – Back to back to back. With Missouri's defeat of Tennessee, Georgia clinches the SEC East title for its third-straight and sixth time in seven seasons.\n6:35 p.m. – The celebs have arrived. On Georgia's sidelines are Bubba Watson, AJ Minter, Kelee Ringo and Stetson Bennett, to name a few.\n6 p.m. – The Rebels are ready.\n5:30 p.m. – Will we see Brock Bowers return for his final home game? The tight end is a game-time decision but could return after a high ankle sprain sustained a month ago.\nNo. 19 out for warmups pic.twitter.com\/tXyTEzATk7 — Brooks Austin (@BrooksAustinBA) November 11, 2023\n5:15 p.m. – The weather in Athens is anything but ideal for a top-10 matchup. It'll be in the 40s with a chance of rainfall throughout the evening. But is that better for the Dawgs? Last time ESPN's College Gameday was in town for a crucial SEC matchup, Georgia beat Tennessee on a rainy afternoon. Kirby Smart and his crew seem to only get better in rough weather.\nWhat channel is Ole Miss vs. Georgia on today?\nTV channel : ESPN\n: ESPN Live stream: ESPN App, Fubo\nOle Miss vs. Georgia will be televised on ESPN with the trio of Chris Fowler, Kirk Herbstreit and Holly Rowe on the call.\nStreaming will be available through the ESPN app or Fubo, which offers a free trial.\nMORE: Who are the top four teams in the College Football Playoff rankings?\nOle Miss vs. Georgia start time\nDate : Saturday, Nov. 11\n: Saturday, Nov. 11 Kickoff: 7 p.m. ET\nThe final game of the season in Sanford Stadium takes place Saturday, Nov. 11. Kickoff between the hedges will be at 7 p.m. ET.\n\nThis article, authored by Emily Dozier, was published by Sporting News on 2023-11-11 under the category 'sports'.\n\n","id":484}
{"title":"ASX set to rise ahead of inflation report after big tech lifts Wall Street","context":"## ASX set to rise ahead of inflation report after big tech lifts Wall Street\n\nThe laggards Real estate investment trusts (REITS, down 2 per cent) dropped further following the latest inflation data, with Mirvac (down 3.7 per cent) and Dexus (down 3.3 per cent) sliding lower. Dexus chief executive Darren Steinberg on Wednesday announced he would step down from the position next year after 11 years at the helm. At the annual meeting in Sydney on Wednesday, the remuneration report received a first strike after failing to pass the 25 per cent voting threshold. Loading Consumer staples (down 1.4 per cent) were also weaker with Woolworths losing 2 per cent despite sales across the company rising 5.3 per cent in the 14 weeks to October, as it vowed to pass on easing costs for protein and fresh produce amid rising mortgage and rental pressures. In other company news, shares in embattled funds manager Magellan dropped 3.5 per cent after the abrupt departure of its chief executive, David George.\nInfratil (down 3.6 per cent), Meridian Energy (down 2.7 per cent) and Resmed (down 2 per cent) were among the biggest large-cap decliners. The lowdown The Australian sharemarket shook off a positive lead from Wall Street on Wednesday after hotter-than-expected inflation data raised the prospect of another interest rate rise at the Reserve Bank’s next meeting, which would weigh on the equity market. Interest-rate sensitive sectors, including REITS and consumer companies, were among the weakest on the local bourse as investors digested the news.\nGSFM investment strategist Stephen Miller said the inflation data, taken with the October Reserve Bank board meeting minutes, which revealed the board had “low tolerance for a slower return of inflation to target than currently expected”, made the possibility of an interest rate rise from the central bank in November a “near certainty”. However, commodity prices supported mining companies as iron ore prices increased 2.9 per cent overnight, bolstering Australia’s iron ore giants. It comes as Chinese President Xi Jinping stepped up support for the world’s second-biggest economy and major commodity trading partner for Australia, issuing additional sovereign debt, raising the budget deficit ratio and even making an unprecedented visit to the central bank. Loading Elsewhere, on Wall Street, the benchmark S&P 500 index closed 0.7 per cent higher ahead of tech giants Microsoft and Google’s parent company Alphabet reporting their results after the close. The Dow Jones Industrial Average added 0.6 per cent and the tech-heavy Nasdaq 100 gained 0.9 per cent. Shares in Microsoft climbed 5 per cent in after-hours trading after the tech company said its sales jumped 13 per cent to $US56.5 billion ($88.9 billion) and profits climbed 27 per cent to $US22.3 billion in the three months through September.\nMeanwhile, shares in Alphabet fell 6 per cent after hours, after the Google parent delivered a mixed result. Google, which is also seeking to capitalise on surging demand for AI technology, saw revenue climb 11 per cent to $US76.7 billion, with net income of $US19.7 billion thanks to a recovery in digital advertising revenue. However, its closely watched cloud division, which houses its data storage business and many of its AI efforts, missed Wall Street expectations. “Investors were disappointed by the relatively weak performance at its Google cloud platform, which is at risk of falling further behind” competitors’ offerings, Jesse Cohen, a senior analyst at Investing.com, wrote in an email. Loading During trading hours, the S&P 500 slipped off session highs, led by losses in energy shares as oil slid below $US84 a barrel, but once again the index found support above the key 4200 mark. Verizon Communications, 3M and General Electric climbed on bullish forecasts. Facebook and Instagram owner Meta dropped after being sued by California and dozen of other US states over harmful youth marketing claims. Bitcoin briefly topped $US35,000, while Treasury 10-year yields edged lower, following Monday’s intense volatility. Investors looking to the earnings season for a dose of good news were hanging their hopes on big tech. The five biggest companies in the S&P 500 — Apple, Microsoft, Alphabet, Amazon and AI chipmaker Nvidia — account for about a quarter of the benchmark’s market capitalisation. Their earnings are projected to jump 34 per cent from a year earlier on average, according to analyst estimates compiled by Bloomberg Intelligence.\n“As these big tech stocks go, so does the overall market,” David Trainer, chief executive officer of New Constructs, said before Microsoft and Alphabet’s results. “Strong big tech earnings may just be what’s needed to end the stock market correction that started in late July. If big tech companies blow their numbers out of the water and provide strong guidance for future earnings, then we could see the stock market rally strongly through the end of the year.” Rising rates have made already stretched big tech valuations look increasingly expensive, with the group remaining the most-crowded trade among fund managers, according to Bank of America. That’s prompted some investors to pay up for protection against a sell-off in Alphabet and Microsoft — two of the handful of heavyweights responsible for all of the S&P 500 Index’s advance this year. The pain in long-duration growth stocks, fuelled in recent weeks by a relentless surge in Treasury yields, is finally on the verge of subsiding. The yield on 10-year Treasuries was little changed at 4.85 per cent overnight. Oil closed at the lowest in more than a week amid signs the crude market’s tightness has slackened and the Israel-Hamas war will remain contained for the time being. West Texas Intermediate extended Monday’s drop with a 2.2 per cent fall to $US83.59 a barrel, paring most of the gains made after Hamas’ attack on Israel on October 7.\nConcerns about the conflict spreading more broadly have eased amid growing calls within Israel to rethink a ground invasion of Gaza because of fears about the fate of some 200 hostages held there, the danger of retaliation by Hezbollah and the risk of Israeli military casualties. Tweet of the day Quote of the day “I think when you get to those decisions, you can then sit on them for a while… or you can say let’s just deal with it [and] that’s what we have done today,” said Magellan chairman Andrew Formica as the group’s chief executive stepped down abruptly amid the company’s efforts to turn around its performance.\n\nThis article, authored by Rita Nazareth, was published by The Sydney Morning Herald on 2023-10-24 under the category 'business'.\n\n","id":485}
{"title":"Israel thwarts Hamas on the financial battlefield","context":"## Israel thwarts Hamas on the financial battlefield\n\nTwo weeks into the war, the Israel Money Laundering and Terror Financing Prohibition Authority (IMPA) received secret intelligence information from two European countries that warned: \"A large, well-known organization is raising funds for Hamas through posts on social networks, and fintech company platforms outside Israel, under the guise of donations to Gaza residents.\" The information included the name of the organization, its fundraising methods, and the identity of the entities behind it. Their concern was that, within days, the millions of dollars raised would go directly to the military arm of Hamas. In a swift joint international action, at IMPA’s request, one of the European countries blocked the organization’s money pipeline by immediately freezing its financial activities.\n\"We are talking about a matter of minutes here. From the moment the authorities in Europe received the information, and we requested the money be blocked, with no court orders or delay, they blocked the transfer of millions of dollars to one of the most active organizations, and from it to Hamas. This is a real-time deterrence,\" reveals IMPA director general Adv. Ilit Ostrovitch-Levi. \"And then there was a domino effect. Following this blocking, more countries began to look around, and blocked funds intended for terror. All this information, which is now shared at an international level, leads to the closing of more and more Hamas funding pipelines, in real time. With worldwide cooperation, Israel’s security and enforcement authorities are thwarting the transfer of millions of dollars earmarked for terrorism, every day.\"\nHeaded by Ostrovitch-Levi since May 2022, IMPA is an intelligence body that conducts the most complex of international economic investigations, and fights terror financing routinely. On October 7, Ostrovitch-Levi received a painful reminder of the vital importance of her work. \"Already on that Saturday night, with Israeli under heavy rocket fire, we talked about preparing ourselves for the campaign we’re now entering, the fight against terror financing channels. Dozens of our staff have been called up to reserve duty, in large part managers working regularly in the fight against terror financing.\"\nSince then, most of IMPA’s work has focused on identifying and blocking the terror money pipelines. \"We work very reactively - we see a fundraising campaign, try to deter it, and stop it from happening again. There are no breaks, because they are constantly active. It’s a daily struggle. Our analysts have been sitting on the social networks from day two of the war, just manually monitoring visible sources of information on these networks to locate fundraising campaigns for terrorist organizations operating in Gaza.\"\nThree days after the war began, IMPA also issued a call to all global regulated entities for increased vigilance towards terrorism financing campaigns in response to the ongoing war and state of emergency, and to report all activities that raise suspicion of terror support and terror financing, in an effective and immediate manner.\nRELATED ARTICLES Tech experts battle to shut down Gaza financial pipeline\n\"Overnight, we started receiving hundreds of reports about unusual activity by customers of financial institutions in the State of Israel,\" she says. Before October 7, IMPA received about 100 reports a day dealing with terror financing. That number jumped to about 1,000. \"There is a 900% increase in reports on terror financing, and we don't waste time, everything happens very, very quickly. As we receive the information, we simultaneously pass it on to the operational professionals who locate the money pipelines, and block them. Some information will not necessarily lead to terror financing, but we don’t have time to waste. Bank CEOs call and draw our attention to the information they convey to us that warrants special attention.\"\nHas information from banks and financial institutions led to blocking the money pipeline for terrorism?\n\"There was very high-quality intelligence that we passed on to the security agencies. We don't always know the results.\"\n\"Gaza could be more beautiful than Dubai \"\nThe network to block terror financing funds includes many entities, including private citizens. \"The world's financial intelligence authorities are now at the heart of this struggle, and we’re working together to thwart the financing channels that we’ve located. In addition, we’ve been approached by many experts from the private sector; people with intelligence experience because they’ve worked in these organizations, or have high-tech experience, and have mobilized like crazy. Israeli entrepreneurs in Silicon Valley have contacted us; they write code, search for information, and give us lots of information. We aggregate and examine everything.\"\nIMPA is charged with rooting out the sources of funding for terrorism, working together with the National Bureau for Counter Terror Financing of Israel (NBCTF) in the Ministry of Defense, which is the coordinating body of all activities to thwart terror financing, the Shin Bet, Military Intelligence Directorate (AMAN), and all other relevant intelligence and security agencies. \"The most significant way to finance terrorism is to finance countries, not fundraising campaigns. These have intensified greatly over the last month, but the core of the budget - for Hamas, Hezbollah, the Houthis, and the Palestinian Islamic Jihad is Iran, in particular the Quds Force (the special forces of the IRGC, Iran's Islamic Revolutionary Guard Corps). Hamas has all kinds of additional sources of self-financing, including businesses, associations, investments, and all kinds of arrangements they’ve tried to set up over the years. They need state funding, and without Iran they have no ability to exist.\"\nHow much money does Iran transfer to Hamas?\n\"As far as we know, the budget from Iran to Gaza is in the order of $100 million a year. Gaza could do very nice things with this money, make it even more beautiful than Dubai. But from what we know, most of this budget goes to the military wing of Hamas.\"\nQatar also transfers money to Hamas.\n\"Qatar transferred suitcases of cash to Gaza through Israel. Everyone knows this. This money allegedly went to pay salaries and civilian needs (education, health, infrastructure), and therefore Israel transferred it, so it’s incorrect to say that it all went to fund terrorism.\"\nFrom money-changers to chocolate\nHow have these billions reached the Gaza street, and Hamas over the years? There are quite a few methods, including cryptocurrencies and trade. But the main and easiest method for money transfer to Gaza is hawala.\nOstrovitch-Levi explains, \"Most of the money does not reach Gaza physically through the border crossings, but via hawala, a financial channel that is based on trust and connections, and enables the transfer and exchange of funds between countries, without the cash physically passing through them. It’s a channel for transferring the funds raised in other countries. In Gaza there are all sorts of wealthy individuals who can transfer large amounts in cash to Hamas upon receiving request from entities abroad.\"\nHow does the method work?\n\"Money changers in places all over the world, let's say Turkey, receive money, and inform the hawaladars (money changers) in Gaza who transfer the money on their behalf. When a customer comes to a hawaladar in Turkey and asks to transfer money to Gaza, he does not physically transfer money, but settles accounts internally with money changers in Gaza, and Judea and Samaria. The funds are de facto not transferred. Occasionally, or when the amount of the debt reaches a predetermined ceiling, a transfer is made between the money changers to reset the outstanding debt.\"\nIs it possible detect the money pipeline between hawaladars and halt the transfer?\n\"Transfers are made between two ‘exchangers,’ and don’t include the identity of the beneficiaries, or the persons who gave the money. They don’t know what the transactions were, they only know there are debts to offset. We are in a constant battle against this phenomenon. In recent years, Israeli authorities have designated several currency service providers in Gaza as conduits facilitating the transfer tens of millions of dollars a year to terrorist organizations in Gaza.\"\nAnother way to transfer money is trade. Transferring goods, or inflating their value. For example, only days ago, containers of goods worth hundreds of thousands of shekels were seized at Ashdod Port, which were destined for Hamas merchants in Nablus and other cities, with the proceeds intended to go on to finance Hamas operations. Another example is the 23 tons of chocolate bars that were seized in August 2021 in a joint operation by the NBCTF, AMAN, and the Tax Authority at the Nitzana Border Crossing between Israel and Egypt. It was suspected that the snack bars, destined for Gaza, were purchased with terror financing funds, with the proceeds from their sales earmarked for Hamas.\nAnother affair that was uncovered, combined trade and hawala. Hamas funds originating in Iran, which were transferred in cash to money changers in Turkey for transfer to Gaza. At the same time Hamed al-Khachari, a Gazan money changer who worked for Hamas (who was assassinated by Israel in 2019), located Gazan merchants who imported goods from Turkish companies and owned payment on the goods. They paid cash to Khachari, who transferred the money to Hamas in Gaza. Meanwhile, the money changers in Turkey received funds from Hamas abroad that were used to pay the Turkish companies.\nHamas is already preparing for \"the day after\"\nAlthough it has been almost impossible to transfer money and goods to Gaza since October 7, with hawala shuttered, and no trade, Hamas continues to raise funds. \"The situation in Gaza is known, and nothing can be brought in, but fundraising activity continues in Judea and Samaria. It’s also possible to make bank transfers to Judea and Samaria, and the fundraising activity hasn't stopped, because while the fighting is going on, they’re continuing to fill their reserves for ‘the day after’ [the war]. We realize they’re raising funds for their continued operations. Hamas is taking advantage of the current sympathy for the Gazans’ situation, and is using online platforms, both of organizations whose business is crowdfunding, and also through the creation of fictitious projects to raise funds: throw-pillows, jewelry and whatnot, and more.\"\nAll this happens openly, for all to see, in Europe, and other places around the world. \"Hamas and Islamic Jihad carry out recruitment operations under the guise of humanitarian aid campaigns, and use Telegram, Twitter, Facebook, Instagram and TikTok to disseminate their announcements. The facade is always supporting humanitarian goals, but in practice it's about channels for funding individuals and entities connected directly to Hamas or Islamic Jihad.\"\nHowever, IMPA’s goal, Ostrovitch-Levi explains, is not only to stop the individual raising of funds for terror financing, but the entire interrelated chain, from the fund-raiser to the transferrer, and on through to the recipient. \"We have the ability to build the intelligence scenario, synchronize all the sources of information received, and delineate the money trail from abroad to Hamas. We’re interested not only in who is running the campaign, the association or entity, but where the money is coming from, and where it’s going. We need to stop all of the elements in this network.\"\nEver since October 7, everyone has been discussing and analyzing the question of about the intelligence agencies, and why there was no warning. Where was IMPA before?\n\"Hamas collects lots of money all the time, and the security agencies deter money transfers. There was no sudden increase in the raising of billions, and you must also remember that most of the money is raised globally, not in Israel. The hundreds of millions of dollars that Hamas receives have been accumulating for years. We had no possibility of seeing a spike in fundraising towards October 7.\"\n\"We understand the west is next\"\nIMPA is not alone in the fight against terror financing. Three days after the start of the war, Andrea Gacki, Director of the US Treasury Department's Financial Crimes Enforcement Network (FinCEN) contacted Ostrovitch-Levi to request a meeting. The two met at virtually the same time President Joe Biden met with the families of the hostages. \"She put herself and the entity she heads, one of the most powerful financial intelligence agencies in the world, at our disposal. She said, 'Whatever you want or need, just say the word'\".\nGacki has kept her promise. \"Since that day, we’ve received an unprecedented flow of financial intelligence from the US, unlike anything seen before. They’ve given us valuable information that we’ve passed on to the security agencies, about organizations they didn’t necessarily know about, and people backing them, all in real time. At the same time, they’ve issued alerts to increase vigilance among the US public about terror financing.\"\nOn October 18, the US Treasury Department's Office of Foreign Assets Control (OFAC) announced that it had imposed sanctions on 10 key Hamas operatives and financial facilitators in Gaza and elsewhere including Sudan, Turkey, Algeria, and Qatar. The statement read, \"This action targets members managing assets in a secret Hamas investment portfolio, a Qatar-based financial facilitator with close ties to the Iranian regime, a key Hamas commander, and a Gaza-based virtual currency exchange and its operator… To date, the Treasury has targeted nearly 1,000 individuals and entities connected to terrorism and terrorist financing by the Iranian regime and its proxies, including Hamas, Hezbollah, and other Iran-aligned terrorist groups in the region.\"\nOn October 27, OFAC imposed a second round of sanctions on key Hamas-linked officials and financial networks. The statement read, \"Today’s action targets additional assets in Hamas’s investment portfolio and individuals who are facilitating sanctions evasion by Hamas-affiliated companies. The Treasury is also designating a Hamas official in Iran and members of Iran’s Islamic Revolutionary Guard Corps (IRGC), as well as a Gaza-based entity that has served as a conduit for illicit Iranian funds to Hamas and Palestinian Islamic Jihad (PIJ).\"\nThe US is not the only one. Europe has also been mobilized in the economic fight against terrorism. \"On the third day of the fighting, my colleagues from the Netherlands and Germany, both veteran heads of their authorities for the prohibition of money laundering, phoned to let me know they wanted to establish an international task force to assist Israel in the fight against the financing of Hezbollah, Islamic Jihad, and all terrorist organizations and their satellites. With them and with the US, we established a kind of task force, which is not subject to any country or unifying body, countries that are working in coordination, and meet every few days to exchange intelligence, and advance the struggle.\"\nIn general, following an appeal by IMPA to its counterparts around the world, there has been a dramatic increase in intelligence coming to Israel from abroad. \"The amount of information doubled in the month of fighting, compared with the monthly average. Before the war, we received about 24 intelligence reports a month from parallel authorities, compared with 50 today.\"\nCountries around the world cooperating with Israel to fight terrorism sounds almost ideal, but it’s hard not to wonder where they were before.\n\"Many countries felt this had nothing to do with them, that it wasn’t their struggle. The international and US mobilization, the task force we founded, the fact that the financial sector abroad suddenly wants to accept the Israeli announcements about the terror entities and people involved, receive intelligence from Israel, and cooperate with us is all only because of October 7. Everyone understands that ‘The West is next’ isn’t an empty statement. This event is the one to make the countries of the world understand they must fight effectively against terror financing, that they need to block Iran effectively.\"\nIMPA is trying to convey these messages to the member nations of the Financial Action Task Force (FATF), an international body to combat money laundering and terror financing. \"We are working very hard on isolating Iran in matters of terror financing. But it’s still a cash economy and it is very, very difficult to stop the financing of Hamas, Hezbollah, and Islamic Jihad. Most of the money comes from oil, but there’s actually an Iranian security system budget dedicated to this.\"\nAnother problem to be dealt with is the addiction to the cash received from the terrorist organizations. \"Because it involves cash in such huge amounts, a situation has arisen in which the populations in Gaza and Lebanon become addicted to financing from Iran. There is internal collapse and a complete disruption of the ability to receive funds another way. This makes terrorism a very profitable business. It destroys the civic structure, unemployment rates rise very high, and being a Hamas operator becomes profitable. It's a vicious circle that feeds on itself. This is an alternative banking system disconnected from the general system. The Iranians are building whole mechanisms to enable intake of this money. This is something bigger than deterring one transfer or another.\"\nCan the current global mobilization alter the fight against terror financing?\n\"Discussions with countries around the world and immediate deterrence are not long-term solutions. Stopping the funds from Iran should be carried out at the international level through FATF, through OFAC sanctions, through sanctions from the entire world. In the end, the solution to Iranian financing are global sanctions. It’s not something that one country can prevent. The bottom line is that without money there is no terrorism, and no matter how hard they try to decapitate the terrorist organizations, as long as they have economic oxygen, as long as the countries of the world do not fight terror financing properly, these organizations will continue to breathe.\"\nPublished by Globes, Israel business news - en.globes.co.il - on November 19, 2023.\n© Copyright of Globes Publisher Itonut (1983) Ltd., 2023.\n\nThis article, authored by Ela Levi-Weinrib, was published by Globes English | Israel Business Arena on 2023-11-19 under the category 'business'.\n\n","id":486}
{"title":"NASCAR offseason news roundup: Short track testing in Phoenix, new spotters for stars, more moves for 2024","context":"## NASCAR offseason news roundup: Short track testing in Phoenix, new spotters for stars, more moves for 2024\n\nEvery year, the wintertime and the NASCAR offseason is a welcome -- but very short -- respite from what is otherwise a demanding, year-long grind of racing. Come 2024, that grind is soon to begin again, and exactly what it looks like will be based in large part on these months where driver lineups, crew lineups and rules packages are set.\nWith much activity going on within the confines of race shops across NASCAR, here are some major storylines for the week of Dec. 4 as the offseason continues.\nOffseason testing in Phoenix\nOne month after Ryan Blaney was crowned the Cup Series champion and the 2023 season was completed out west, Blaney and a select group of other drivers and teams returned to Phoenix Raceway for a two-day test as NASCAR looked at a number of aerodynamic and technical changes for the Next Gen car. Blaney was one of six drivers to participate in the test, joining Chris Buescher, Erik Jones, Christopher Bell, Kyle Larson and Corey LaJoie.\nThe first day of testing centered around different splitters and diffusers as well as tires engineered to degrade more during green flag runs as NASCAR tries to build upon marginal improvements made to the Next Gen car's short track package in 2023. According to Cole Cusumano, teams ran a simplified diffuser -- featuring just two fins in the middle at a 90-degree angle -- as well as an alternate splitter design.\nAfter ascertaining a direction on aerodynamics and tires, NASCAR spent the second day of the test experimenting with existing mufflers to slightly soften the otherwise deafening noise made by Cup Series motors. Gearbox and shifting changes were not included as part of this test.\nSpeaking to reporters, Blaney noted the biggest difference came in the alternate splitter, which significantly reduced downforce.\n\"It was big. The first laps I had I was like, 'Man, this thing drives way different,'\" Blaney said. \"... It's a massive aero loss when you do that. And then the simple diffuser wasn't as big of a change as the splitter, but it was still something to feel.\"\nThe topic of mufflers -- while anathema to the purest of gearheads -- has been one that has occasionally popped up in the Next Gen era, particularly with NASCAR now using mufflers in urban settings at stadiums (Los Angeles Coliseum) and on street courses (Chicago) where noise ordinances are more of a consideration. Kyle Larson told reporters he did not notice a difference in cockpit cooling with the mufflers tested on Wednesday, but spoke positively of the idea overall.\n\"I definitely think our racecars are way too loud, and probably are still too loud with the mufflers,\" Larson said. \"I think the cars can be quieter just to help the fan experience.\"\nNotable crew changes\nNot one, but two of the biggest stars in NASCAR will have new eyes in the sky in 2024, as the spotters for both Chase Elliott and Ryan Blaney announced they will be stepping down. Eddie D'Hondt announced Saturday he would not return as Elliott's spotter next season, followed Monday by Josh Williams announcing he would step down as Blaney's spotter.\nAccording to Bob Pockrass of Fox Sports, former NASCAR Xfinity Series driver Tim Fedewa, the longtime spotter for Kevin Harvick, will take over as the spotter for Blaney next season. A possible landing spot for Williams exists at Spire Motorsports, as Williams has previously spotted for Zane Smith in the Craftsman Truck Series.\nSpire Motorsports announced a number of personnel moves this week, hiring Stephen Doran as the crew chief for Smith's No. 71 Chevrolet and Luke Lambert as the crew chief of the No. 77 for Carson Hocevar. Doran joins Spire from Stewart-Haas Racing, where he was an engineer on the No. 4 team, while Lambert moves to Spire after being crew chief of the No. 42 at Legacy Motor Club in 2023.\nIn addition, Spire has also hired Doug Duchardt, whose career in racing has included stints at General Motors and Chip Ganassi Racing, as its new team president.\nDrivers on the move\n\nUnbeknownst to most at last Sunday's Washington Commanders game, many in NASCAR became aware of a part of Joe Gibbs Racing's 2024 plans in the Xfinity Series and the apparent hiring of a Cup veteran. While serving as a guest of the team, Joe Gibbs was seen introducing Aric Almirola to Commanders owner Josh Harris, with lip readers online ascertaining that Gibbs appeared to tell Harris that Almirola is now driving for them.\nAccording to Bob Pockrass, the expectation is that Almirola will drive part-time for Joe Gibbs Racing -- where he began his NASCAR career in the 2000s -- in the Xfinity Series, joining a driver lineup that will also include Chandler Smith and Sheldon Creed. Such would align with the expectations for Almirola's racing future, as he had entertained continuing to race part-time when it was announced he would not return to Stewart-Haas Racing in 2024.\nThe matter of Almirola's replacement in the SHR No. 10 has been a rather poorly-kept secret: It is widely expected the team will hire Noah Gragson as its new driver as Gragson looks to reclaim his standing as a bright young star following a disastrous rookie year in Cup with Legacy Motor Club. Gragson was recently spotted at Stewart-Haas Racing's shop, and he also drove a Ford in this past weekend's Snowball Derby with Rette Jones Racing.\nGragson did not let on to any 2024 plans in a recent conversation with Matt Weaver of Sportsnaut, instead choosing to discuss his regrets and personal growth from the end of his rookie season. Gragson resigned as the driver of the No. 42 in August while serving a month-long suspension after he was spotted having liked a racially insensitive meme on his Instagram account.\n\"There have been some challenges this year, but I wouldn't trade them for anything in the world,\" Gragson said. \"I don't know that I would change anything that has happened because I have learned from it and it gives me a chance to be a better person.\n\"In life, you either win or you learn, on and off the racetrack. The wins have been great, but you learn through the hardships and defeats. I am grateful to have good people around me, and I'm working really hard every day to hopefully get a second chance and to make the most of it.\"\nWhile the Stewart-Haas No. 10 seat is seemingly filled, some intrigue still exists as to exactly who will drive the No. 16 for Kaulig Racing next season. After running the car full-time in 2023, it was announced Thursday that A.J. Allmendinger would go back to full-time Xfinity Series racing for Kaulig in 2024, though he will continue to run a partial Cup schedule.\nThe assumption of many had been that the No. 16 would be taken over by Ty Dillon, but that assumption may have been premature. Weaver shared in a recent thread on X that information suggesting Dillon had been hired to drive the No. 16 was \"incorrect,\" casting ambiguity on both who will join Daniel Hemric at Kaulig next season as well as the exact plans of Dillon, who has bounced from team to team since Germain Racing shut down following the 2020 season.\nNuts and Bolts\n\nThis article, authored by Steven Taranto, was published by CBSSports.com on 2023-12-07 under the category 'sports'.\n\n","id":487}
{"title":"Spill toasts one year with a 2.7M seed extension, Kerry Washington and champagne","context":"## Spill toasts one year with a 2.7M seed extension, Kerry Washington and champagne\n\nAt midnight last Friday, Alphonzo Terrell held up a glass of Dom Pérignon and toasted his one-year anniversary of being laid off at Twitter.\nIf it weren’t for that moment, he wouldn’t be in Austin at an AfroTech after-party, surrounded by thousands of people who now know his name and his social media app, Spill. As a competitor to the platform now known as X, Spill hails itself as a safer place for Black Americans and the LGBTQ community and has amassed around 200,000 users, he said. This past year, the app, which is still in beta mode, has raised a total of $5 million in pre-seed funding, including a recent $2 million extension round led by Collide Capital.\n“We put an invite-only beta in June, and within three weeks, it went viral,” Terrell told TechCrunch. “Suddenly, we’re supporting a city, we have data costs, we have infrastructure, we have to accelerate our building times, so we really needed an extension to do that effectively.”\nHis journey with Spill started last year at AfroTech. He arrived at the conference just days after being laid off from what was then Twitter, along with about 3,000 others amid Elon Musk’s acquisition. Terrell hopped on a call with former Twitter colleague DeVaris Brown about a business idea and spent three days in an Airbnb creating the pitch deck for what became Spill. At AfroTech, he went around taking last-minute coffee meetings, seeing who would give his company a chance. Flash-forward to this year and Spill is the cool kid in town.\nSo many apps have sprung up over the last year in an attempt to become “the new Twitter,” but no app has emerged as the dominant refuge for disillusioned Twitter users. Threads, Instagram’s supposed “Twitter killer,” got 100 million sign-ups within five days; the decentralized platform Mastodon has 1.8 million monthly active users; and the smaller upstart Bluesky hit 1 million users in September. Though still in beta, Spill’s community of 200,000 users may seem small in comparison, but Spill’s rise has shown that quality matters just as much as quantity — that building a strong core community is just as valuable as high-speed growth, even if the traditional venture model may not always incentivize thoughtful product development.\n“If you have a great experience, you’re going to grow,” Terrell said. “Especially in a world where you have so many networks — there are all these choices that people conceivably have — you’re gonna go to the one where you have the greatest experience and want to invest your time.”\nAnother app that spun out from laid-off former Twitter employees, Pebble (formerly T2), recently shut down after a year, growing to just 20,000 registered users. Its CEO, Gabor Cselle, previously had exits to Google and Twitter, but accepted that Pebble simply wasn’t competitive enough to stay afloat. But while Pebble sought to essentially clone Twitter, Spill’s team is building something that looks very little like it.\n“People are looking for something new,” Terrell said. “I think things that have really defined, unique value propositions are going to win over the long term — it might not be like there’s one winner-take-all.”\nEarlier this year, TechCrunch covered the founding of Spill, piquing the interest of Kapor Capital, which ended up writing the company its first check.\n“We had over 25,000 people join our waiting list in less than 24 hours from that article,” Terrell said.\nThis weekend, as CEO, Terrell took the AfroTech stage twice: once to interview Mitch and Freida Kapor, the founders of Kapor Capital, and a second to reveal a new app feature: Tea Party, which is similar to Instagram Live. The first user to host a Tea Party was actress Kerry Washington. Terrell’s next dream Tea Party host? Keke Palmer, who is already on Spill. So are other cultural icons like Questlove, Ava DuVernay and Janelle Monáe.\n“Tea Parties reflect the communities that we have always spoken very clearly that we are here to center,” Kenya Parham, Spill’s Global VP of Community and Partnerships, told TechCrunch. “Black communities, queer communities, women, non-binary and femme stories are all the way at the forefront, and the community is just eating it up.”\nAnne Griffin can attest to that. She’s a product manager based in New York and signed up for Bluesky, Spill and Threads last year. Out of those three, Spill is the only one she is still consistently using. “It feels much more rooted in authentic connection,” she told us about the app, praising its product features. “In a world where many social media algorithms focus on engagement at any cost, it’s refreshing to have an app that is focused on engagement around community in culture.”\nWashington, meanwhile, joined the platform organically; Spill has “not paid for a single acquisition to date,” Parham said, which speaks to the influence and respect that the app’s leadership has established in the entertainment and tech industries. Before Spill, Terrell led marketing teams at HBO and Showtime; Parham ran her own strategic communications consultancy, working with a laundry list of major production studios. So, already, Spill has wooed advertising partners like Netflix, Lionsgate, VH1, Showtime and Sony Pictures.\nSpill has come to be a bright spot in the post-Twitter era. Users are organizing in-person meetups in Atlanta, New York and “Spillicon Valley.” At AfroTech, Spill gave out customized tea bags created with the help of Nigerian-American tea sommeliers while lines formed to use a Spill-branded 360 camera at a house party, inspired by an actual trend on the app where people share photos of themselves on Fridays.\nThe app is set to exit beta and open to the public next year. As Terrell previously discussed with TechCrunch, the app has plans to pay creators for their cultural contributions to the app, which is especially important for Black creators in the creator economy.\n“We don’t get credit for all the contributions that we make,” Terrell said of Black artists in the space.\nDespite the robust year, however, the story for Spill is just beginning, with AfroTech reminding Terrell of how far they’ve come, but also how far they have to go.\n“To be able to make something for the community, it’s just really beautiful,” he said.\nUpdate, November 7, 2:20 PM: Spill’s seed extension is $2 million, not $2.75 million.\n\nThis article, authored by Amanda Silberling, was published by TechCrunch on 2023-11-07 under the category 'technology'.\n\n","id":488}
{"title":"Bears vs. Panthers live score, updates, highlights from NFL 'Thursday Night Football' game","context":"## Bears vs. Panthers live score, updates, highlights from NFL 'Thursday Night Football' game\n\nThe Bears and Panthers entered Thursday night looking for progress, not playoff contention. If any team achieved that goal, it was Chicago.\nIt wasn't an aesthetically pleasing game, but that was never the expectation. The Bears grinded out a 16-13 victory behind a terrific defensive performance, a solid running game, and a few timely throws by Tyson Bagent.\nThe Panthers jumped out to an early lead on a punt returned for a touchdown by Ihmir Smith-Marsette, but they never found the end zone again. The only offensive touchdown of the night came in the third quarter, when D'Onta Foreman rumbled his way into the end zone to give Chicago a 16-10 lead.\nNFL WEEK 10 PICKS: Straight up | Against the spread\nAs it turned out, 16 points was all the Bears needed. After Eddy Pineiro cut Carolina's deficit to three early in the fourth quarter, Frank Reich put his trust in Pineiro again with the game on the line, sending him out for a 59-yard attempt on fourth-and-10 in the final minutes rather than trusting the offense to pick up the 10 yards. Pineiro's kick was short.\nWhile the decision to kick from 59 yards out might be second-guessed, Carolina's offense didn't give Reich much reason to believe. Bryce Young struggled to develop any kind of rhythm through the first three quarters, and even the Panthers' most successful drives were laborious, consistently requiring conversions on third and fourth down.\nWhile Young got little help from his receivers, who failed to get open all night, his struggles — including multiple passes that were nearly intercepted — are a reminder that the Panthers' offense is still a long way from resembling anything like the unit owner David Tepper envisioned when the franchise traded for the No. 1 pick in March.\nMORE: Why Frank Reich's job might already be at risk\nThe Bears (3-7) are hoping to get Justin Fields back in time for their Week 11 game in Detroit, but they've gotten a shot in the arm from Bagent, who improved to 2-2 as a starter with the win. The victory on Thursday was a win-win for Chicago, as the franchise owns the first-round pick of the Panthers (1-8).\nThe Sporting News tracked live scoring updates and highlights from Bears vs. Panthers on \"Thursday Night Football.\" Check out all of the key moments you might have missed.\nBears vs. Panthers final score\n1 2 3 4 F Panthers 7 3 0 3 13 Bears 3 6 7 0 16\nBears vs. Panthers results, highlights from Thursday Night Football\n(All times Eastern)\nFinal: Bears 16, Panthers 13\n11:11 p.m. — And now this one is officially over. The Bears pick up their third win of the season, while Carolina drops to 1-8 and faces more tough questions about Bryce Young and the offense.\n11:08 p.m. — Bagent hits Mooney for the first down on 3rd & 7, and the Panthers now won't be able to stop the clock.\n11:06 p.m. — Pineiro's attempt is SHORT from 59 yards out. The gamble fails for Frank Reich. The Panthers will hope to get the ball back.\n11:04 p.m. — Young is very nearly intercepted on 3rd & 10, and the Panthers say they've seen enough of the offense. Eddy Pineiro is attempting a 59-yard field goal to tie the game.\n11:00 p.m. — Miles Sanders gets himself wide open on fourth down to extend the drive. The Panthers are 3-for-3 on fourth down tonight despite their severe struggles for much of the game.\nBryce Young to Miles Sanders for the 2nd fourth down conversion of the drive#CARvsCHI on Prime Video\nAlso available on #NFLPlus pic.twitter.com\/Moaaj7cpqw — NFL (@NFL) November 10, 2023\n10:58 p.m. — It'll be fourth and about two yards when the Panthers return from the two-minute warning... Carolina is trying to claw its way into field goal range.\n10:57 p.m. — Thielen comes through with a nice catch on the run to give Carolina another first down.\n10:56 p.m. — Hayden Hurst with a bad drop on 2nd & 3. That would've opened up the field a bit for the Panthers.\n10:54 p.m. — Young drops back on 4th & Inches from deep in his own territory, but fortunately for Carolina he's able to run to the right and pick up the first down. The Panthers still have plenty of ground to cover to get into field goal range.\nBryce Young does just enough to extend the drive on 4th and inches#CARvsCHI on Prime Video\nAlso available on #NFLPlus pic.twitter.com\/YWvltQGepB — NFL (@NFL) November 10, 2023\n10:52 p.m. — The tush-push doesn't work for everyone. The Panthers try to push Chuba Hubbard forward on 3rd & 1, and he goes nowhere. It looks like they'll go for it again.\n10:49 p.m. — Deion Jones makes a great tackle to drop Roschon Johnson for a three-yard loss. The Bears will punt, giving the Panthers a chance to tie the game or more.\n10:46 p.m. — Bagent finds Kmet for a first down and more. Another nice play by Kmet, who has become a trusted target for Bagent in these four starts for the rookie.\nBears 16, Panthers 13\n10:42 p.m. FIELD GOAL — Pineiro's kick is good, and the Panthers now trail by a field goal.\n10:41 p.m. — Young's pass to Marshall is incomplete on third down. Marshall was well-defended, but he probably should've had that. It'll be a field goal try for Carolina.\n10:38 p.m. — You have to give some credit to Carolina's offense for converting, as Young finds Tremble for the first down on 4th & 6. The Panthers turn a 1st & 30 into a fresh set of downs.\n10:37 p.m. — A neutral zone infraction pulls the Panthers a bit closer, and they will line up to go for it on 4th & 6...\nEnd of third quarter: Bears 16, Panthers 10\n10:32 p.m. — The Panthers run it with Chuba Hubbard on 1st & 30. They're not showing much interest in letting Bryce Young air it out, even while trailing in a lost season.\n10:31 p.m. — It's 1st & 30 for the Panthers after back-to-back penalties. That's one way to erase great field position.\n10:29 p.m. — A less than impressive punt by Trenton Gill sets up Carolina well inside Bears territory. If there was ever a time for the Panthers' offense to get something going...\n10:28 p.m. — After an offensive pass interference call backs up the Bears, Chicago shows no interest in taking a shot and hands it off on 3rd & 19. The Panthers will have solid field position.\n10:26 p.m. — The Bears come out with three Foreman runs in four plays. After turnovers doomed them last week, they're playing it conservatively.\n10:21 p.m. — Young throws behind the line of scrimmage on 3rd & 15, which doesn't tend to convert. It'll be a Panthers punt, giving the Bears poor field position in the process.\n10:19 p.m. — Now Young hits Adam Thielen for another first down. How about that? Carolina is just about to midfield.\n10:18 p.m. — A rare first down for the Panthers as Young throws to Marshall for an 11-yard gain.\nBears 16, Panthers 10\n10:13 p.m. TOUCHDOWN — Foreman runs it in for the score! That's the first offensive touchdown of the night, and it gives the Bears their first lead of the night.\n10:12 p.m. — A well-designed play is broken up by Donte Jackson in the end zone after the Bears pick up the first down.\n10:11 p.m. — The Bears are inching their way toward the goal line...it's 3rd & 1 from the five.\n10:10 p.m. — Foreman runs 11 yards for a first down, and the Bears are already in field goal range thanks to strong starting field position.\n10:06 p.m. — Outside of a 45-yard completion to Mike Strachan, Young is 7-of-16 for 24 yards. It's tough to recall any positive moments for the Panthers' offense tonight aside from that one play. Carolina has serious questions to answer.\n10:05 p.m. — Young gets a few yards back but is sacked by Yannick Ngakoue on third down. The Panthers will punt again.\nYannick Ngakoue gets his team off the field on 3rd down 😤#CARvsCHI on Prime Video\nAlso available on #NFLPlus pic.twitter.com\/JPt1xc3b93 — NFL (@NFL) November 10, 2023\n10:04 p.m. — Bryce Young is now lining up in his own end zone after Miles Sanders was dropped for a six-yard loss.\n10:01 p.m. — Punt. Again.\n9:57 p.m. — The Panthers get a grand total of one yard (-4 including a delay of game penalty) and punt it away less than a minute into the first half.\nEnd of first half: Panthers 10, Bears 9\n9:40 p.m. FIELD GOAL — In a game that might be lucky to see an offensive touchdown, the Bears deserve some credit for that drive to work their way into field goal range. They trail 10-9 at the half.\n9:39 p.m. — Bagent narrowly avoids a sack and actually runs for positive yardage to move Santos' attempt closer. Chicago is down to three seconds, so here comes Santos.\n9:38 p.m. — A perfectly executed play to get the ball to Cole Kmet, who picks up the first down and then some but still gets out of bounds to stop the clock. The Bears are in field goal range.\nThe always reliable Cole Kmet gets the Bears into field goal range before the end of the half 👀#CARvsCHI on Prime Video\nAlso available on #NFLPlus pic.twitter.com\/ArYhsjmh7M — NFL (@NFL) November 10, 2023\n9:37 p.m. — The Panthers could use this D.J. Moore guy. Moore with a 14-yard grab to take the Bears into Carolina territory and give Chicago a real chance at points here. 46 seconds left.\n9:34 p.m. — The Bears still have plenty of ground to make up to get into field goal range, but a 15-yard unnecessary roughness penalty on Deion Jones helps inch them closer.\n9:29 p.m. — Tyrique Stevenson comes VERY close to a interception on an errant pass by Young, and the Panthers will punt with just over a minute left in the half.\n9:28 p.m. — An illegal contact penalty, the second of the night on the Bears, gives Carolina a fresh set of downs.\n9:25 p.m. — The Panthers will have 3rd & 3 out of the two-minute warning, just hoping to get in position for some points before halftime. They'll start the second half with the ball as well.\nPanthers 10, Bears 6\n9:19 p.m. FIELD GOAL — Bagent is fortunate just to hold onto a bad snap, but his pass is incomplete and brings out Cairo Santos. It's 10-6, Panthers.\n9:17 p.m. — A second big play by rookie Tyler Scott, who catches a 15-yard pass from Bagent to give the Bears a fresh set of downs. Chicago is into field goal range.\nRookie-to-rookie for a key first down 👀#CARvsCHI on Prime Video\nAlso available on #NFLPlus pic.twitter.com\/nIw42qweEE — NFL (@NFL) November 10, 2023\n9:14 p.m. — Bagent hits Roschon Johnson for a first down to give the Bears some life. Chicago started with very strong field position, so this could quickly become a rare scoring opportunity.\n9:11 p.m. — A sack by Justin Jones quickly ends the Panthers' drive. Three-and-out for Carolina.\n9:07 p.m. — A promising drive ends in a punt for the Bears. Carolina has a chance to extend its lead to two possessions if Bryce Young can build on that 44-yard completion he had last time he was on the field.\nJustin Jones brings the heat to force a punt 😤#CARvsCHI on Prime Video\nAlso available on #NFLPlus pic.twitter.com\/wyEgT3GZ7q — NFL (@NFL) November 10, 2023\n9:05 p.m. — A holding call sets the Bears back to 2nd & 20...\n9:03 p.m. — After Foreman pushes forward for a key first down, rookie Tyler Scott takes off for 16 yards to take the Bears over midfield. Chicago is looking to tie the game on this drive.\n9:00 p.m. — Sexiest Man Alive Jason Kelce is in the booth with Al Michaels and Kirk Herbstreit to start the second quarter.\nPanthers 10, Bears 3\n8:55 p.m. FIELD GOAL — Young comes under pressure on 3rd & 11 and just throws it into the ground. Former Bears kicker Eddy Pineiro drills the field goal, so Carolina still adds to its lead.\nEnd of first quarter: Panthers 7, Bears 3\n8:50 p.m. — Young throws downfield and hits Mike Strachan for a 44-yard gain. Mike Strachan? Mike Strachan. The Panthers are suddenly in business in Bears territory.\nMike Strachan's first catch as a Panther goes for 45 yards!#CARvsCHI on Prime Video\nAlso available on #NFLPlus pic.twitter.com\/15stE4IGAz — NFL (@NFL) November 10, 2023\nPanthers 7, Bears 3\n8:45 p.m. — Santos drills it anyway! A 54-yard kick. The Bears cut the deficit to 7-3.\n8:44 p.m. — A false start by Cody Whitehair erases what would've been a good 49-yard field goal...the Bears will keep Cairo Santos out there.\n8:43 p.m. — Chicago will try a field goal from 49 yards out after the drive fizzles out.\n8:41 p.m. — Foreman has been the Bears' best weapon tonight. He rips off an 11-yard run and now has 43 scrimmage yards in this first quarter.\n8:40 p.m. — The Bears rattle off two first downs on their first three plays, with Moore and Foreman grabbing passes from Bagent to take Chicago over midfield.\nPanthers 7, Bears 0\n8:36 p.m. TOUCHDOWN — Ihmir Smith-Marsette returns the punt 79 yards for a touchdown! On a night that could be defined by bad offense, the Panthers get a huge early boost from their special teams unit. Carolina leads, 7-0.\nIhmir Smith-Marsette takes one back against his former team 🏠📞#CARvsCHI on Prime Video\nAlso available on #NFLPlus pic.twitter.com\/4MTENIL0r6 — NFL (@NFL) November 10, 2023\n8:35 p.m. — Bagent throws incomplete on third down, and the Bears will punt for the second time tonight.\n8:33 p.m. — Darnell Mooney goes for a first down after a nice run by D'Onta Foreman set up a 3rd & 2. The Bears have some breathing room.\n8:29 p.m. — Johnny Hekker pins the Bears at the one, so it'll be an uphill battle for Bagent and the offense on this upcoming drive.\nJohnny Hekker punts it to the 1 and @PatMcAfeeShow nods in approval somewhere#CARvsCHI on Prime Video\nAlso available on #NFLPlus pic.twitter.com\/WKffggayuG — NFL (@NFL) November 10, 2023\n8:28 p.m. — Young is forced to throw it away on third down, so he Panthers will punt from just past midfield.\n8:26 p.m. — Young misses a wide open Terrace Marshall Jr. on second down, sailing the pass too high.\n8:25 p.m. — Two third downs, two scrambles for a first down by Young. He's not exactly known for his mobility, but he's far from immobile. Now let's see whether the Panthers can get the passing game going at all.\nSecond straight third down that ends in a scramble for a first down by Bryce Young#CARvsCHI on Prime Video\nAlso available on #NFLPlus pic.twitter.com\/mC5txmYqzP — NFL (@NFL) November 10, 2023\n8:23 p.m. — Nice awareness by Bryce Young to run for the first down on 3rd & 7, and the Panthers add five extra yards on an illegal contact penalty against Chicago.\n8:21 p.m. — Donte Jackson comes through with a nice pass breakup on third down, and the Bears will punt shortly after the quick first down.\n8:19 p.m. — D.J. Moore instantly makes an impact against his former team with a 16-yard grab.\n8:17 p.m. — Bagent and the Bears offense will start with the ball, and we are underway!\n8:09 p.m. — Perhaps the most interesting storyline tonight will be whether Al Michaels can keep a brave face throughout what might not be the most appealing game.\n8:00 p.m. — We're going to keep spirits high tonight despite a matchup of teams with a combined three wins. All football is good football! Let's see how long this mentality lasts...\n7:46 p.m. — It's 52 degrees and clear in Chicago right now, so certainly not as cold as it could be in the Windy City this time of year. Still, it's a rare colder-weather game for Bryce Young.\n7:30 p.m. — The Bears will be donning orange tonight, including an alternate orange helmet.\n7:10 p.m. — D.J. Moore is back facing his former team tonight, eight months after he was traded to the Bears in the deal that sent the No. 1 pick to Carolina.\n6:50 p.m. — Standout edge rusher Brian Burns is out with a concussion, dealing a major blow to the Panthers' defense.\nBrian Burns, CJ Henderson and DJ Chark among inactives.https:\/\/t.co\/mL8EYWQKTs — Carolina Panthers (@Panthers) November 9, 2023\n6:35 p.m. — Bryce Young threw an interception in only one of his last five games before crashing back to Earth with three picks against the Colts last week. More than ever, it feels like this game will be won by the quarterback who can avoid turnovers. Bagent has thrown five picks in his last two starts.\n6:15 p.m. — Tyson Bagent will get the start for the Bears tonight, so it'll be an undrafted rookie facing a rookie No. 1 pick. Despite that, Chicago is favored.\nBears vs. Panthers start time\nDate: Thursday, Nov. 9\nThursday, Nov. 9 Start time: 8:15 p.m. ET\nThursday night's game between the Bears and Panthers is set to kick off at 8:15 p.m. ET (7:15 p.m. local time) from Soldier Field in Chicago.\nWhat channel is Bears vs. Panthers on today?\nGame: Chicago Bears vs. Carolina Panthers\nChicago Bears vs. Carolina Panthers Date: Thursday, Nov. 9\nThursday, Nov. 9 TV channel (Chicago) : WFLD (Channel 32)\n: WFLD (Channel 32) TV channel (Charlotte) : WSOC (Channel 9)\n: WSOC (Channel 9) Live stream: Amazon Prime Video | DAZN (in Canada)\nFor the masses of NFL fans across the U.S., Thursday's clash between the Bears and Panthers will be aired on Amazon Prime Video. The broadcast will be spearheaded by play-by-play announcer Al Michaels and color commentator Kirk Herbstreit. Sideline reporter Kaylee Hartung will offer sideline updates throughout the game.\nFans in the Chicago and Charlotte markets can watch the Amazon broadcast over the air on local channels.\nThose in Canada can stream it on DAZN, which carries every NFL game all season.\n\nThis article, authored by Dan Treacy, was published by Sporting News on 2023-11-09 under the category 'sports'.\n\n","id":489}
{"title":"Rollback Policy, a Boon or a Curse? The Controversial System That Might Redefine the Golfing World by the End of 2030","context":"## Rollback Policy, a Boon or a Curse? The Controversial System That Might Redefine the Golfing World by the End of 2030\n\nThe distance golf balls travel has increased multifold. So a change is necessary to address the issue. Otherwise, the golf courses need to be perpetually extended. Not us. This is the opinion of both Royal & Ancient (R&A) and United States Golf Association (USGA) officials who decided it’s time to bring in the golf ball rollback policy. According to them, with new technologies, golf balls are covering far more distance, resulting in lengthening the courses and incurring a greater financial burden on the golf clubs. Moreover, there are a growing number of voices who feel golf has become way less competitive nowadays.\nAmerica’s Favorite Video Today\nOn the other hand, there is a chance this might create bifurcation, which no one likes. The rules are non-binding in nature. So, tours and regional governing bodies can decide for themselves whether to implement them or not. Regardless, suppose R&A and USGA, which organize 35 championships between themselves, put this into action, and PGA and other Tours reject them. In that case, amateurs might be playing with ‘corrected’ balls, while the Tour pros will be playing with the same balls. Steeped in rich irony, indeed. Although the proposed rules are not set to be implemented before at least 2026, let’s explore the existing complications.\nWhat happens to the majors with the rollback policy?\n\nADVERTISEMENT Article continues below this ad\nIf they pass the rules, the R&A that organizes The Open and the USGA, the organizer of the U.S. Open, will have the limited-flight balls in these two majors. What about the others? That’s for the Augusta National and PGA of America to decide.\nNotably, Seth Waugh, the PGA of America CEO, in a memo to R&A, denounced the proposals, taking along nine other PGAs across the globe. While Fred Ridley, the chairman of Augusta National, didn’t exactly bang the drum for MLR, the former amateur golfer did stand behind the governing bodies, saying he would much prefer to see the issue finally addressed. Notably, Augusta infamously ‘Tiger-proofed’ their course to make it ‘tougher’ for golfers (read Tiger Woods).\nOne thing should be noted here. Although R&A and USGA both organize two LPGA majors, the Women’s Open and the U.S. Women’s Open, respectively, the rules will apply only to two men’s golf. Why? Because the average driving distance on the LPGA Tour is still well within the accepted norm of the two regulatory bodies. We haven’t heard any noise from the female circuit, even though Lexi Thompson shot a 316-yard drive at the Shrines Children’s Open. But the PGA Tour Pros and LIV Golf Pros chimed in with their thoughts.\nWhat do players think of this?\nMost players are less than happy with the change. And that reaction cut across the LIV Golf-PGA Tour divide. Justin Thomas, a fifteen-time winner on the Tour who is also a part of the PGA Tour policy board, termed it “selfish” on the USGA’s part. “I think the USGA over the years has, in my eyes, it’s harsh but made some pretty selfish decisions,” he stated. “They definitely, in my mind, have done a lot of things that aren’t for the betterment of the game, although they claim it.”\nThe 2022 PGA Championship winner drew an interesting comparison. In the NBA, players now jump much higher than they did in the 1990s. But the hoop height has stayed the same at 10 feet above the playing surface. The two-time Major winner credits the player’s grind for this.\nWhat Is the Model Local Rule? As the Golf Ball Rollback Debate Takes Off Once Again, All You Need To Know About the USGA?s and R&A?s Brainchild\nEchoing similar sentiments, Bryson DeChambeau, who joined LIV Golf in 2022, said, “It’s a great handicap for us guys that have worked really hard to learn how to hit it farther.” The 2020 U.S. Open Champion regularly crushes drives to 310–320 yards. No wonder he termed the policy “atrocious.”\nInterestingly, Rory McIlroy, whose average of 326.7 yards puts him on top of the PGA Tour’s driving distance leaderboard, backed this proposal for elite-level golfers. Speaking to the No Laying Up Podcast, the five-time Major winner said, “I think it’s going to help the overall professional game. I think making guys hit some long irons again and some mid irons and being able to hit every club in your bag in a round of golf.”\nWhat does the Big Cat have to say about this? After all, it was Tiger Woods, whose astounding power behind the shots in the late 90s and early 2000s started the debate. Surprisingly, the fifteen-time major winner feels a course correction is necessary here. “I think this should have happened a long time ago.”\nIn fact, he said something that might not sit well with most, “I’ve been of the position if you play in a pro event or you have a P next to your name, you should be playing a pro ball. If you have an A next to your name and you’re playing an amateur event, you should use an amateur ball.”\nADVERTISEMENT Article continues below this ad\nHow will the golf ball rollback policy affect LIV golfers?\nThe R&A and USGA have not made it binding on any governing bodies to implement the rules. For the breakaway league, this is the easiest path. One reason is that power hitters such as Bryson DeChambeau will be affected in more ways than one otherwise.\nSecondly, a league that thrives on thrills and excitement will lose its USP if the ball suddenly doesn’t travel 300 yards on most occasions. As of this year, 28 of 48 LIV golfers average over 300 yards driving distance. Dustin Johnson and DeChambeau are both in the top five.\nADVERTISEMENT Article continues below this ad\nBut one crucial thing to remember here is that the golf ball rollback policy will render most balls totally ‘unplayable’. Moreover, the PGA Tour has contradicted itself several times in the past few years. It won’t be surprising if Monahan & Co. eventually decides to agree with the policy change sometime later. So, the question remains: how viable would it be for manufacturers to produce two types of balls, one for Majors and the other for LIV Golf? This just throws the world of golf into uncharted territory.\nWatch This Story: Is Tiger Woods Making Use Of Any Medical Aid After His Subtalar Fusion?\n\nThis article, authored by Parnab Bhattacharya, was published by Essentially Sports on 2023-12-03 under the category 'sports'.\n\n","id":490}
{"title":"The Apple Watch’s double tap gesture points at a new way to use wearables","context":"## The Apple Watch’s double tap gesture points at a new way to use wearables\n\nThe coolest Apple Watch Series 9 and Ultra 2 feature wasn’t actually available when the watches launched last month. Double tap, which finally arrives today via the watchOS 10.1 update, lets you interact with the watch without ever needing to use the touchscreen. With a quick pinching motion, you can use it to scroll through the new smart stack of widgets in watchOS 10, pause or end timers, skip music tracks, and answer phone calls. It’s the sort of feature that you might read about and scoff at — until you’re unloading groceries from your car, hands full, and an important call comes through on your watch.\nDepending on who you are, this kind of scenario might happen multiple times a day or once in a blue moon. In the past few weeks with the watchOS 10.1 beta, some days I completely forgot double tap existed. Either my hands were free, or muscle memory kicked in and I’d use the watch as I always have. Other days, when my to-do list felt as long as a CVS receipt, I morphed into a double tap fiend, so much so that I sometimes felt like a flamenco dancer snapping away with their castanets.\nDouble tap activates the primary action of an app. GIF by Amelia Holowaty Krales \/ The Verge\nI got a rundown of how double tap works when I reviewed the Series 9 and Ultra 2, but it hits differently once you start using it in your day-to-day life. Controlling gadgets with gestures is often gimmicky — tech that seeks to show off rather than solve a problem. But double tap does solve a genuine problem and is born from accessible design that serves real needs. That, in turn, made me more curious about what went into creating the gesture, the tech behind it, its limitations, and what it implies for the future of smartwatches.\nThe chip behind double tap\nDouble tap technically isn’t a new gesture so much. In 2021, Apple introduced Assistive Touch, an accessibility feature designed for people with limb differences or mobility issues. The idea was to give these folks a way to navigate through menus and control the Apple Watch without needing a second hand.\nOn the surface, it can seem like double tap is a rebadged version of Assistive Touch. That’s led to understandable confusion as to how the two features differ — and why double tap isn’t available on older Apple Watches that support Assistive Touch (Series 4 or later, including the first-gen SE and Ultra).\nThe short answer is that the Apple Watch Series 9 and Ultra 2 have a more powerful chip. Specifically, the new S9 features four neural engines for machine learning, which is what powers double tap. On older watches, Assistive Touch was run on the main CPU. But is that distinction really enough to make a difference?\nThe double tap algorithm has to be able to sort through a lot of noisy data to detect when you are — and aren’t — making the gesture. GIF by Amelia Holowaty Krales \/ The Verge\nYes, according to David Clark, senior director of Apple Watch software engineering. “Because we’re on a purpose-built part of the processor, we’re not contending with all the other things the CPU is doing at any given time,” says Clark. The result is the Series 9 and Ultra 2 are 15 percent more accurate at detecting the double tap gesture, and the feature itself is much less power intensive.\nI wouldn’t blame anyone for feeling skeptical. But there is an absurd amount of data that needs to be processed for double tap to work. At the most basic level, the algorithm that detects the double tap gesture is trained on data from the accelerometer, gyroscope, and optical heart rate sensor collected from the wrist.\nApple says that while the double tap gesture evolved out of Assistive Touch, it requires the computing power of the S9 SiP. Photo by Amelia Holowaty Krales \/ The Verge\nIf you know anything about wearable sensors, that’s not as simple as it sounds. Wrist data is incredibly tricky to work with because there’s a lot of noise in the signal. On top of calculating how light reflects off of blood pumping through your veins, smartwatch algorithms have to account for your arm (plus muscles, veins, and tendons) physically moving around during different activities like walking, running, and gesticulating. Another challenge is no two people have the exact same body. Differences in wrist size and limb length have to be taken into consideration.\nIronically, the years that Apple put into improving heart rate helped cut through that noise. According to Clark, “the gaps in reliable signals for heart rate” were what his team used to confirm subtler motions like the double tap gesture.\n“Reliability also means that when you’re doing things that are almost like a tap, or a double tap, that we’re not erroneously triggering the gesture.”\n“Reliability means that when you do the gesture, we’re able to detect it,” Clark says. “Reliability also means that when you’re doing things that are almost like a tap, or a double tap, that we’re not erroneously triggering the gesture. We got to make sure we’re able to detect the right thing through by tuning these things with the right scenarios.”\nMeaning, the algorithm also has to be able to differentiate when someone is in motion, the type of activities they’re doing, and what other features they may be using on the watch at a given point in time. Streaming music or taking calls might seem unrelated to double tap, but the algorithm must be able to account for the noise introduced by subsystems like LTE and Bluetooth. That’s harder to do well when everything is done on the main CPU.\nDouble-click for the wrist\nThat’s the technical side of the equation. But practically speaking, it’s easier to see how Assistive Touch and double tap differ once you try using both.\n“Assistive Touch is a comprehensive navigational system,” says Eric Charles, senior manager of Apple Watch Product Marketing. For instance, if you use Assistive Touch, you’ll notice a blue outline that visually cues the parts of a screen you can interact with when you can interact with them. You can enable a motion-based cursor as well. Another difference Charles points out is that with Assistive Touch, you have four gestures: single tap, double tap, clench, and double clench. According to Charles, it became evident early on that not everyone has the full strength to clench their hand, while others may not be able to do two quick, subsequent motions — such as a double tap.\nClenching is a gesture you can use with Assistive Touch, but it’s there to provide a wider range of options for people who may not be able to make a pinching motion. GIF by Amelia Holowaty Krales \/ The Verge\n“We don’t think of it necessarily as ‘Hey, there are four available gestures here.’ It’s that audience needs the ability to customize those gestures in a way that you don’t because your ability goes further than what they might be able to do.”\nDouble tap isn’t designed to help you navigate anything. The best way I can describe it is Assistive Touch is like the mouse to your computer. It scrolls, it selects, and it’s highly programmable. Double tap is more like the double-click portion of using a mouse. You use it solely to perform the main action of an app. And to do that, Apple had to spend a lot of time researching what people wanted or expected a single double tap to do.\n“We collected data over hundreds of users, thousands of instances of these gestures internally to create models that represent all the different use cases we think [double tap] will be used in,” explains Clark, noting that Apple cataloged all the potential user experiences that could potentially use double tap. It then solicited feedback from testers about how intuitive the feature was to use and whether it behaved in the way they expected. “There was an exhaustive list of screenshots, what those screens were, how a user could get to them, and then a detailed discussion through each and every one of those areas.”\nThe answers from that internal research were then iterated multiple times, taking into consideration different types of testers. Some were complete novices, while others were more familiar with the gesture, and others yet were experts in human interaction engineering. That extensive feedback process is also why double tap is no longer called double pinch in Assistive Touch.\n“We did a lot of testing internally, and one of the things we learned is that when you tell someone to pinch, they hold the lower part of the gesture more than they release. Tap evokes a release,” says Charles, who explained that the simple name change led to testers performing the gesture more accurately.\n(To be clear, we at The Verge will still be unofficially calling it the pinchy pinch.)\nThe limits of simplicity\nIn talking with Clark and Charles, it’s clear Apple went through such a tedious process because this is supposed to be one of those magical features that “just works.”\nAnd, when double tap performs as intended, it does feel a bit like the watch can read my mind. It’s genuinely cool to see double tap work with not just my index finger but the rest of them as well. To my surprise, it feels less gimmicky than I expected. But despite Apple’s efforts, it doesn’t take long to run into double tap’s limitations.\nDouble tap makes using the Smart Stack more intuitive, but I wish it could scroll AND select. GIF by Amelia Holowaty Krales \/ The Verge\nMedia controls are a good example. Should a double tap either pause or play your music? Or should it let you skip to the next track? If you’re someone who uses your smartwatch to control playback on smart speakers, the former makes more sense. If you’re a runner and the wrong song pops up on your playlist, the latter is more useful. I’ve run into this in various scenarios, but this happens to be one of only two instances where you can choose what double tap does. (For me, I’ve set double tap to skip to the next track.)\nThat lack of choice is also apparent in third-party apps. My email app lets me double-tap to start a quick reply using Siri, but even in 2023, I am not dictating my emails. Apps like Spotify and Pocket Casts don’t work with double tap, either. Most third-party apps that do work with double tap just let you dismiss notifications. That’s helpful but still limiting.\nWith watchOS 10, apps like Fitness and Weather have been redesigned to be more glanceable. Instead of one long screen that you scroll endlessly through, information is divided into more digestible chunks. You still scroll, but there’s less of it. This is great, except I often want to use double tap to navigate through menus instead of the digital crown. And I can’t.\nYou can scroll through the new widget Smart Stack, but if I want to select a widget and open it, I still have to use my other hand. If I want to select a widget, I can customize it to do that, but it only ever selects the top widget. You have to just trust that Apple’s algorithms will surface the right widget.\nCustomizability is currently limited to music playback and the smart stack. Photo by Amelia Holowaty Krales \/ The Verge The double tap glyph lets you know when you can and can’t use the gesture to control an action. Photo by Amelia Holowaty Krales \/ The Verge\nMultitasking is another area where double tap can fall short. If I want to pause a timer but have navigated away from that app, I have to either use my other hand or use Siri. Otherwise, I can wait for the timer to go off and use double tap to end the timer.\nMore customization would be the obvious answer, but it’s one that Apple was wary of for this first iteration of double tap.\n“While customization can be a really powerful tool, oftentimes customization is where a lot more complexity can come into the process,” says Clark. I get what Clark means. Not everyone, after all, has the patience to set up dozens of Focus modes or tinker with Shortcuts. If you want to keep things simple, you inevitably have to narrow the focus.\nA future of smartwatch gestures\nDespite the limitations, the combination of glanceable apps, widgets, Siri, and double tap has started to change how I use my Apple Watch. I never used to use the more analog, aesthetically pleasing watchfaces because it meant sacrificing my complications. With double tap, I can use those watchfaces now because all I have to do is flick my wrist and double tap to view my widgets. If I want to launch the app, I can just ask Siri to open it.\nYou can already use multiple fingers for the double tap gesture. It’s not hard to imagine other iterations down the line. GIF by Amelia Holowaty Krales \/ The Verge\nIt doesn’t always work that seamlessly. There are times when the primary action isn’t what I want to do, or eventually, I get to the point where I have to use my other hand. (In the above example, once I ask Siri to open the app, I may have to scroll with the digital crown to reach the information I need.) But it’s not hard to imagine future iterations of double tap can both scroll and select. Something that’s not quite as comprehensive as Assistive Touch but strikes a finer balance between simplicity and customizability — without relying too much on Apple trying to figure out what it is you want to do.\nEven now, with double tap’s existing limitations, I can do more while on the go and without my phone. I find myself reaching for it much less — or when I do, it’s for much more intentional purposes like reading, shopping, or watching a video. The past few weeks with double tap have felt like a glimpse into a smartwatch future that’s independent of phones — devices that, instead of triaging notifications and calls, handle them entirely.\n\nThis article, authored by Victoria Song, was published by The Verge on 2023-10-25 under the category 'technology'.\n\n","id":491}
{"title":"‘Right people in right roles’: QRU breaks silence on RA’s reform hopes, backs review into Wallabies’ RWC flop","context":"## ‘Right people in right roles’: QRU breaks silence on RA’s reform hopes, backs review into Wallabies’ RWC flop\n\nIn the wake of the Wallabies’ World Cup flop, the Queensland Rugby Union have reaffirmed their position that they are committed to moving to a centralised high-performance model but won’t follow the NSW Waratahs by handing over the keys to Rugby Australia.\nThey also expressed their strong support for Rugby Australia to conduct a “fully independent and transparent top-to-bottom review of the Wallabies program and how it can be improved” in light of the historic first World Cup pool exit.\nThey added: “It should also provide a clear view of what is needed in a leadership and governance framework to ensure we put the right people, in the right roles, in the right system.”\nFacebook Twitter Whatsapp Reddit Email Share\nThe QRU has also expressed their desire for Rugby Australia to reinstate the annual $1.7 million in funding to each of the Super Rugby franchises that was withdrawn following the Covid pandemic to help keep the game afloat.\nIn the open letter to their members on Wednesday morning, QRU chief executive David Hanham and chairman Brett Clark moved to update constituents on the reform measures that RA is attempting to usher through the game.\nLast week, The Roar revealed that the New South Wales Rugby Union was in the latter stages of handing over their license to RA.\nBy doing so, the NSW Waratahs, who were on the brink of insolvency, handed over their commercial and high-performance property.\nAdvertisement\nThe decision will see all male and female Waratahs players, including coaches and high-performance staff, as well as all commercial and operations staff, run out of RA’s office.\nNSW Waratahs chief executive Paul Doorn informed stakeholders of the decision last week.\nRA is cognisant that not every Super Rugby franchise will follow suit immediately, but the governing body is hopeful that now one of the two biggest states has agreed to hand over the keys, others will follow suit swiftly. The Melbourne Rebels are expected to follow.\nRA chief executive Phil Waugh says building trust back between the governing body and states is essential to their plans.\nUnder fire Wallabies coach Eddie Jones also advocated for Australian rugby to move to a centralised model, believing the nation had fallen behind the rest of the world.\n“We’re a state-based union that’s run by the states, the national union wants to assume more responsibility and when things were going well, no one questioned that,” Jones said.\nAdvertisement\n“But over the last period of time, they haven’t been going so well and this tournament’s probably been the icing on the cake where it’s got to a stage where I think people, most people probably think there’s time for change. But it’s not going to go easy.\n“[It’s] one of the key issues. We need to maximize the development of the players. At the end of the day, that’s the key to success and alignment of your resources, for a small country.\n“Because Australia, if you look at the history of rugby, when we were amateur, we were probably ahead of the game because we had the influence of rugby league. We had the influence of AFL and our players were more professional than the rest of the world.”\nHe added: “I know what’s going on and we need to get a better system of developing players. We need to develop better players and we need to develop a larger batch of better players and that only comes through changing the whole system.”\nWhile all five Australian Super Rugby sides fundamentally are on board with regards to moving to a centralised high-performance program, The Roar added that some states, including the ACT Brumbies as well as the QRU, don’t want to give up their commercial assets.\nThe QRU confirmed that on Wednesday morning.\nAdvertisement\n“The QRU is committed to working with Rugby Australia to lead reform of our game at a high-performance level, and help Rugby Australia develop an improved game through high-performance centralisation,” the statement read.\n“Centralisation” would include a national player-contracting model, and alignment of key high-performance staff, such as coaching, strength and conditioning, and medical to operate as one national system.”\nThe letter pointed to RA’s involvement in Les Kiss’ appointment as Reds coach, with the former State of Origin winger turned coach, who has spent the best part of two decades coaching in Ireland and England, replacing Brad Thorn.\nAs The Roar has previously reported, the QRU stopped short of wanting to hand over its commercial property.\n“While the QRU is very supportive of high-performance alignment, it will not agree to any proposal on centralising commercial or corporate functions,” the letter read.\n“The very strength of our State unions is the expertise they bring in their own markets.\nAdvertisement\n“We are open to work on commercial initiatives together but will always retain our independence for the benefit of Queensland Rugby, its members and stakeholders.\n“Queensland Rugby has built a sustainable business model through the elimination of legacy operating debt, delivered four-straight operating profits and worked in partnership with Governments to successfully deliver $31 million of improvements to Ballymore through the construction of the National Rugby Training Centre, the home of the Wallaroos and Queensland Reds.”\nThe letter also pointed to the 71,000 players across the state, including more than 16,000 of those female participants, 257 schools featuring rugby as part of its program, as well as its Hospital Cup competition and regional club competitions, as evidence that the game was in good health in Queensland.\nThe QRU also expressed its satisfaction that RA was willing to discuss the annual $1.7m being reinstated, which had been withheld because of the Covid pandemic to keep the game afloat.\nMeanwhile, The Roar understands the ACT Brumbies have sent RA confirmation of solvency for the next 12 months.\nRA was forced to take out a $40m loan from Ares to keep the game afloat.\nAdvertisement\nWhile RA has around another $15m left to spend from the loan, the governing body is looking to borrow up to another $60m so they’re in the strongest possible position to capitalise on the two major money-making events – the 2025 British and Irish Lions series and home men’s World Cup in 2017 – and succeed.\nRA is also in the early stages of looking to renew its next broadcast deal, with the governing body hoping to at least double its current deal with Nine Entertainment\/Stan Sport, which is seeing them paid $29m per year until the end of 2025.\n\nThis article, authored by Christy Doran, was published by The Roar | Sports Writers Blog on 2023-10-10 under the category 'sports'.\n\n","id":492}
{"title":"RA set to announce local as high-performance director – and how it could help land Schmidt as Wallabies coach","context":"## RA set to announce local as high-performance director – and how it could help land Schmidt as Wallabies coach\n\nRugby Australia is moving closer to naming their new director of high-performance, with World Rugby’s director of high-performance Peter Horne set to take on the role – and the move could help land highly-regarded coach Joe Schmidt for the vacant Wallabies job.\nAs The Roar reported last week, Horne had emerged as the leading candidate in recent weeks.\nIt’s believed he has edged out former Sydney University, Australian Sevens and Harlequins’ director of rugby Billy Millard for the role.\nFacebook Twitter Whatsapp Reddit Email Share\nThe finer points of the negotiations are being out, but it’s likely Horne will be announced over the next week once the sports administrator wraps up a crucial series of meetings this week with World Rugby.\nHorne is leading World Rugby meetings with tier-two nations this week in Sydney, with former Fiji coach Simon Raiwalui in attendance before he officially wraps up and joins World Rugby.\nHis appointment reflects RA’s desire to go down an administrative path rather than former coach of any standing like Millard would have offered.\nHorne, who joined World Rugby in 2015 as a general manager of high-performance before moving into his current role, will sit at the top of the high-performance tree, with the next Wallabies coach to report into him.\nAdvertisement\nDuring his tenure with World Rugby, the Sydneysider has played an important role in setting up competitions, high-performance structures and pathways across developing countries.\nHe also played a role in helping Super Rugby integrate Fiji Drua and Moana Pasifika into the competition.\nThose successes played out in the recent Rugby World Cup, with Chili, Fiji, Georgia and Portugal delivering encouraging performances that positively reflected World Rugby’s desire to spread and build the game. Horne briefly worked at Saracens as a general manger.\nRA always said they wanted to have the role filled by Christmas, with chief-executive Phil Waugh saying the successful candidate had one of the biggest jobs to change the game’s standing in Australia.\n“It’s a big job,” Waugh said. “It’s the biggest job on my leadership team in terms of the impact it has on the general sentiment around the game.”\nHorne will oversee all of Australia’s men’s and women’s high-performance programs.\nAdvertisement\nHe will also be tasked with “integrating” the programs, with RA trying to centralise all of the Super Rugby’s high-performance programs.\nPerhaps most pressing will be building a list of coaching candidates to take over from Eddie Jones, with RA wanting to have the new Wallabies coach set in stone by the start of Super Rugby.\nHorne’s close relationship with former Ireland coach and All Blacks assistant Joe Schmidt could be one of the keys to landing the 2018 World Rugby coach of the year.\nAfter leaving his Irish post after six years following the 2019 World Cup, Schmidt worked alongside Horne at World Rugby.\nIt’s believed the duo have a strong working relationship.\nWhile Schmidt’s Irish side bombed out in successive quarter-finals under his leadership, the New Zealander took the Emerald Isle to the top of World Rugby’s rankings.\nAlong the way, Schmidt played an instrumental role in not just seeing them become one of the world’s best teams but helped usher through transformational change off the field, as Ireland moved to a centralised system.\nAdvertisement\nSchmidt briefly exited the international coaching scene following the 2019 World Cup, citing a desire to move home to New Zealand to be closer to his family.\nBut after initially moving back into the coaching fray with the Blues in Super Rugby, he joined the All Blacks ahead of last year’s Rugby Championship as New Zealand Rugby shook the All Blacks coaching team up following their historic series loss to Andy Farrell’s Irish.\nSchmidt’s expertise proved telling, with he and Jason Ryan transforming the All Blacks and helping Ian Foster’s side reach the final of this year’s World Cup after stunning wins over Ireland and Argentina in the knockout stages.\nImportantly, the 58-year-old, The Roar understands, is interested in the Wallabies coaching job.\nDan McKellar, Stephen Larkham, Andy Friend and Ian Foster remain interested in the role.\nShould RA move on him, Schmidt’s backing would be largely supported by the Super Rugby franchises, with several sources telling The Roar that the experienced coach is exactly the type of person the Wallabies need.\nAdvertisement\nAfter a year in where the Wallabies’ detail and nous was clearly absent on the field, the highly detailed Schmidt would help bring rugby smarts to the Australian program.\nIndeed, the manipulation and ability to play both sides of the ruck was clearly visible by Ireland during his Irish tenure.\nWhat’s more, should RA go down a path of bringing Schmidt into the fold, his own relationship with Ireland’s long-time director of high-performance David Nucifora could see the Australian reconsider his position with the governing body.\nLast year Nucifora told The Roar he would unlikely consider returning to RA when he leaves his post with Ireland following next year’s Olympics.\n“I don’t think it’d be wise to revisit,” Nucifora said.\n“I think that you have a go at something once, you do your best and then if it’s not good enough or it didn’t work you move on, do something else.\nAdvertisement\n“What’s changed back there that I could think that, what I can offer, can change what they’re doing still?\n“I’ll always love rugby. I’ll always love Australian rugby. Could I see myself working in Australia again? I doubt it.”\nBut RA have been making moves to try and twist Nucifora’s arm.\nWhile Nucifora was never in the running for the director of high-performance, it’s understood they are trying to get him on board as a consultant when he wraps up with Ireland.\n\nThis article, authored by Christy Doran, was published by The Roar | Sports Writers Blog on 2023-12-11 under the category 'sports'.\n\n","id":493}
{"title":"Fantasy Football RB Rankings Week 12: Who to start, best sleepers at running back","context":"## Fantasy Football RB Rankings Week 12: Who to start, best sleepers at running back\n\nAs we trot into Turkey Day week, only three more regular-season weeks remain until the fantasy football playoffs. Every decision — from the tough starts to the difficult sits; the savvy waiver adds to the costly drops — can ultimately decide whether your team is a contender or a pretender. Our Week 12 fantasy RB rankings for standard leagues will help guide you to the right moves and hopefully land you a big \"W\" for which to be thankful.\nTrade deadlines have passed in most leagues, so the majority of fantasy owners must soldier on toward the home stretch with the main core they have built to this point. On a positive note, we have no byes to worry about this — just plenty of short turnarounds, some potential weather concerns, and of course, the dreaded injury bug. Fortunately for us, we have been ahead of the curve with sleepers and breakouts all season, so we're more prepared to weather any storm than the average fantasy Joe.\nLet's get right to our Week 12 RB rankings so you can fully prepare for Thanksgiving week and put out a lineup with backs who will feast like the rest of us.\nMORE: Watch NFL RedZone live with Sling (50% off first month)\nWhich RBs are on bye in Week 12?\nNone! It's a Thanksgiving miracle! Not only do we not have any byes to worry about this week, but we also have NFL action on four different days (Thursday, Friday, Sunday, Monday).\nWEEK 12 STANDARD RANKINGS:\nQBs | WRs | TEs | D\/STs | Kickers\nIn some ways, however, a bye-free week at this stage of the season presents more challenges than ever. Whereas byes make some start 'em, sit 'em decisions no-brainers, 16-game weeks make it a lot easier to get lineup decisions wrong. Don't worry — we'll steer you in the right direction and keep you apprised of all the information you'll need throughout the week.\nWEEK 12 PPR RANKINGS:\nQBs | RBs | WRs | TEs | D\/STs | Kickers\nWho are the best fantasy RBs in Week 12?\nAs always, Christian McCaffrey (@ Seahawks in Week 12) heads the list as the most matchup-proof running back in the NFL. Right behind him, Austin Ekeler (vs. Ravens) will look to bounce back after an uncharacteristically rough showing in Green Bay last week.\nAgainst the Commanders last week, Saquon Barkley (vs. Patriots) looked as good as we've seen him this season (140 total yards, two TDs). The Pats have surrendered 116 scrimmage yards per game and nine total TDs to RBs this season, so we like Barkley to pick up where he left off this Sunday (drive up that free-agency value, 'Quon!).\nYou don't see running mates cracking the top five very often, but we had to make the exception for David Montgomery and Jahmyr Gibbs (vs. Packers). Entering Week 11, Green Bay had surrendered nearly 140 all-purpose yards per game to RBs. Between Detroit's o-line, the Lions' high-flying offensive attack, and the ruthless 1-2 punch DMont and Gibbs have been this season, the feast could be on very early for Dan Campbell's guys.\nTake a collective sigh of relief, Tony Pollard (vs. Commanders) owners! TP looked solid against Carolina last week, averaging 5.1 yards per carry and finally getting into the end zone for the first time since Week 1. We have the Cowboys back just outside our top five with a juicy matchup against a Washington D that just got lit up by Saquon and the G-men.\nRaheem Mostert (@ Jets) should continue to eat for Miami, with rookie De'Von Achane (knee) unfortunately getting hurt almost immediately after returning from IR (more on that later). Gang Green hasn't been nearly as good against the run as it has been against the pass, as Jets opponents have averaged 139 rushing yards per game over the past two weeks. 'Fins backup Salvon Ahmed also landed on the IR with a foot injury, so consider stashing Jeff Wilson Jr. as a handcuff.\nRounding out the top 10, the trio of Travis Etienne (@ Texans), Josh Jacobs (vs. Chiefs), and Breece Hall (vs. Dolphins) will be looking to bounce back from disappointing Week 11 outings on the ground. All three of these backs have been mostly solid, and none have much to worry about in terms of backfield competition.\nWEEK 12 FANTASY ADVICE:\nSleepers | Busts | Projections | Start-sit\nWho are the best fantasy RB sleepers, waiver pickups in Week 12?\nSleep on Rhamondre Stevenson (@ Giants) at your own peril. 'Mondre has accumulated 231 yards from scrimmage and a TD over New England's past two games, and the Pats are coming off bye. Washington just carved the G-men up like a turkey on the ground last week, surrendering a whopping 174 yards and a TD. Gobble gobble.\nGet Kyren Williams (@ Cardinals) right back into your lineup the moment Los Angeles activates him from IR. Arizona just made Devin Singletary look like Barry Sanders, so Williams (ankle) should enjoy a triumphant return to the field. Keep rolling with Alexander Mattison (vs. Bears), too, against another below-average run defense.\nWelcome to the top 25, Zach Charbonnet (vs. 49ers)! With Kenneth Walker III's oblique injury comes opportunity for the rookie, who already looked strong in the month leading up to Seattle's narrow Week 11 loss to the Rams. Sure, Charbs' 69-yard effort in Los Angeles last week was a bit underwhelming, but we love his upside with a full game as the Seahawks' bell-cow.\nSpeaking of bell-cow backs, things are looking very promising for the short-term workload of Green Bay's AJ Dillon (@ Lions). Veteran Aaron Jones (knee) and rookie Emanuel Wilson (shoulder) both got hurt in Week 11, so Dillon should be the main man in Motown for the Pack. Power backs have enjoyed the most success against the Lions, as evidenced last week by Chicago's Roschon Johnson averaging 5.0 yards per carry and D'Onta Foreman finding paydirt.\nWEEK 12 DFS:\nDK lineup | FD lineup | Best values | Best stacks\nWho are the biggest potential RB busts in Week 12?\nWe don't quite have the intestinal fortitude to bench Derrick Henry (vs. Panthers), but we must absolutely temper our expectations with the dude at this point. Over the past two weeks, he has tallied just 64 total yards on 23 touches (2.8 yards per touch). Carolina served as Tony Pollard's get-right game last week, so fire King Henry up if you have him. If he falters against the Panthers, you better have a backup plan moving forward (picking up Tyjae Spears as insurance is a good place to start).\nBoth Darrell Henderson and Royce Freeman (@ Cardinals) would be decent dart throws in a week filled with byes, but their floors in a zero-bye week seem too low to trust them if Kyren Williams is back and at 100 percent. The matchup is juicy, but we have no idea what to expect from a touch-share perspective, so these guys are no better than desperation, TD-dependent flexes.\nSpeaking of guys coming back from injury, we saw Khalil Herbert (@ Vikings) return to the field for Chicago against the Lions last week. However, his performance left a lot to be desired. He finished with just 35 yards on 16 carries and wound up vastly overshadowed by Justin Field's 100-yard rushing effort. Even worse, D'Onta Foreman scored the Chi's lone rushing TD on the afternoon.\nI don't care what your team looks like — you shouldn't be starting Chuba Hubbard or Miles Sanders (@ Titans). They weren't awful against Dallas last week on a per-touch basis, but neither finished with more than 12 touches. Even worse, no Carolina back has enjoyed a 60-yard rushing game since Oct. 15. Bad offensive line, negative game scripts, awful coaching — it's all bad, man!\nWhat are the biggest RB injuries in Week 12?\nSecond-year Seahawks back Kenneth Walker III suffered an oblique injury in Week 11 that the ever-hip Pete Carroll referred to as \"legit.\" KW3 has a better chance of missing multiple weeks than he does at suiting up for Seattle's Thanksgiving Day game against Fred Warner and the 49ers. If Zach Charbonnet somehow finds himself on your waiver wire, an early Merry Christmas to you if you have the FAAB or a high waiver priority.\nThe hits just keep on coming for the Packers' Aaron Jones, who suffered a knee injury but seems to have at least caught a break in the sense that he didn't tear his ACL. However, even a moderate MCL sprain could mean a multi-week absence for the injury-prone veteran back, especially in a lost season for the 4-6 Pack. Rookie Emanuel Wilson also hurt his shoulder in Week 11, so AJ Dillon could be getting the keys to Green Bay's backfield castle (although it's more of an oversized shack, at this point).\nDolphins rookie De'Von Achane, who looked like the runaway Offensive Rookie of the Year earlier this season, looked to have aggravated his MCL injury upon his Week 11 return against the Raiders. Achane has a chance to return for Miami's Week 12 tilt with the Jets on Friday, but we wouldn't be surprised if the 7-3 'Fins play it safe and keep him out until he's back to 100 percent. Meanwhile, Miami placed backup Salvon Ahmed on IR with a foot injury, so Jeff Wilson Jr. could be back in play as a handcuff stash.\nBears veteran D'Onta Foreman injured his ankle in Week 11. He could miss some time now that Khalil Herbert and Roschon Johnson are both back in action for Chicago. The best runner on the Bears, however, is QB Justin Fields when he's active.\nTexans back Dameon Pierce returned to practice late last week, but he remained out with his ankle injury against the Cardinals. We could see him return to the field this weekend, but for now, we're keeping him off our rankings until we hear more positive news. Either way, it seems Devin Singletary is the new RB1 in this breakout offense.\nWe'll be updating these standard RB rankings all week, so check back for the latest player movement.\nFantasy RB Rankings Week 12: Who to start, sit at running back\nRankings based on standard, non-PPR scoring\nRank Player\n1 Christian McCaffrey, 49ers @ Seahawks\n2 Austin Ekeler, Chargers vs. Ravens\n3 Saquon Barkley, Giants vs. Patriots\n4 David Montgomery, Lions vs. Packers\n5 Jahmyr Gibbs, Lions vs. Packers\n6 Tony Pollard, Cowboys vs. Commanders\n7 Raheem Mostert, Dolphins @ Jets\n8 Travis Etienne, Jaguars @ Texans\n9 Josh Jacobs, Raiders vs. Chiefs\n10 Breece Hall, Jets vs. Dolphins\n11 Rhamondre Stevenson, Patriots @ Giants\n12 Alvin Kamara, Saints @ Falcons\n13 Isiah Pacheco, Chiefs @ Raiders\n14 Brian Robinson Jr., Commanders @ Cowboys\n15 Bijan Robinson, Falcons vs. Saints\n16 Jonathan Taylor, Colts vs. Buccaneers\n17 James Conner, Cardinals vs. Rams\n18 D'Andre Swift, Eagles vs. Bills\n19 Joe Mixon, Bengals vs. Steelers\n20 Derrick Henry, Titans vs. Panthers\n21 Rachaad White, Buccaneers @ Colts\n22 Kyren Williams, Rams @ Cardinals\n23 Alexander Mattison, Vikings vs. Bears\n24 Gus Edwards, Ravens @ Chargers\n25 Zach Charbonnet, Seahawks vs. 49ers\n26 Javonte Williams, Broncos vs. Browns\n27 AJ Dillon, Packers @ Lions\n28 Jerome Ford, Browns @ Broncos\n29 Devin Singletary, Texans vs. Jaguars\n30 Kareem Hunt, Browns @ Broncos\n31 James Cook, Bills @ Eagles\n32 Jaylen Warren, Steelers @ Bengals\n33 Najee Harris, Steelers @ Bengals\n34 Khalil Herbert, Bears @ Vikings\n35 Tyler Allgeier, Falcons vs. Saints\n36 Chuba Hubbard, Panthers @ Titans\n37 Ezekiel Elliott, Patriots @ Giants\n38 Latavius Murray, Bills @ Eagles\n39 Roschon Johnson, Bears @ Vikings\n40 Joshua Kelley, Chargers vs. Ravens\n41 Keaton Mitchell, Ravens @ Chargers\n42 Ty Chandler, Vikings vs. Bears\n43 Dameon Pierce, Texans vs. Jaguars\n44 Royce Freeman, Rams @ Cardinals\n45 Jeff Wilson Jr., Dolphins @ Jets\n46 Rico Dowdle, Cowboys vs. Commanders\n47 Antonio Gibson, Commanders @ Cowboys\n48 Miles Sanders, Panthers @ Titans\n49 Tyjae Spears, Titans vs. Panthers\n50 Clyde Edwards-Helaire, Chiefs @ Raiders\n51 Dalvin Cook, Jets vs. Dolphins\n52 Zack Moss, Colts vs. Buccaneers\n53 Kenneth Gainwell, Eagles vs. Bills\n54 Tony Jones Jr., Cardinals vs. Rams\n55 Elijah Mitchell, 49ers @ Seahawks\n56 Jaleel McLaughlin, Broncos vs. Browns\n57 Justice Hill, Ravens @ Chargers\n58 Chase Edmonds, Buccaneers @ Colts\n59 Boston Scott, Eagles vs. Bills\n60 Tank Bigsby, Jaguars @ Texans\n61 Jamaal Williams, Saints @ Falcons\n62 Samaje Perine, Broncos vs. Browns\n63 Matt Breida, Giants vs. Patriots\nWeek 12 RB fantasy projections, rankings from Draft Sharks\nDraft Sharks projections for the new week will update every Tuesday and be constantly adjusted throughout the week\nWe're proud to offer SN Fantasy readers an exclusive look at Draft Sharks’ award-winning projections and rankings every week. To see Draft Sharks' Week 12 3D floor-to-ceiling projections for running backs -- plus get access to all of Draft Sharks' industry-leading tools -- become a Draft Sharks' member today at the link below!\nTRY DRAFT SHARKS FREE: Dominate with exclusive tools, including Free-Agent Finder & Trade Navigator!\n\nThis article, authored by Sloan Piva, was published by Sporting News on 2023-11-21 under the category 'sports'.\n\n","id":494}
{"title":"World Series 2023 live score: Rangers vs. Diamondbacks updates, highlights, results from Game 3","context":"## World Series 2023 live score: Rangers vs. Diamondbacks updates, highlights, results from Game 3\n\nThe Rangers continue to be unstoppable road warriors.\nTexas picked up its ninth consecutive road victory in these playoffs after defeating the Diamondbacks in Game 3 of the World Series, 3-1.\nThe Rangers were powered by some two-out magic in the third inning, as Marcus Semien finally found his bat with an RBI single before Corey Seager demolished a two-run home run 421 feet to right field.\nJon Gray got credited with the win after Max Scherzer was pulled from the contest with a lower back injury through three scoreless innings. Gray was fantastic in a surprise relief appearance, throwing three scoreless innings with three strikeouts and just one hit allowed.\nThe Diamondbacks' offense struggled to string together hits and couldn't cash in when they had runners in scoring position. Even though they out-hit the Rangers, Arizona's bats hardly put any pressure on Texas' pitching.\nMORE: Watch 2023 World Series games live with Fubo (free trial)\nIf you missed any of the action from Game 3 where the Rangers took a 2-1 series lead over the Diamondbacks, The Sporting News had you covered with live updates and highlights below.\nRangers vs. Diamondbacks final score\n1 2 3 4 5 6 7 8 9 F Rangers 0 0 3 0 0 0 0 0 0 3 Diamondbacks 0 0 0 0 0 0 0 1 0 1\nWorld Series result, highlights from Game 3\n(All times are Eastern.)\nNinth inning: Rangers 3, Diamondbacks 1\n10:56 p.m.: Bottom of 9th — And José Leclerc strikes out both Christian Walker and Tommy Pham swinging to end the game! Rangers win! That's nine straight road victories for Texas.\nJosé Leclerc seals the W in Game 3 of the #WorldSeries for the @Rangers! 👏\n\n📺: FOX pic.twitter.com\/mvGRsBnLh3 — FOX Sports: MLB (@MLBONFOX) October 31, 2023\n10:51 p.m.: Bottom of 9th — Gabriel Moreno thought he had a lead-off walk but the home plate umpire saw it as a strike even though it was off the plate. Moreno grounded out to third on the next pitch. A tough break for the Diamondbacks.\n10:49 p.m.: Bottom of 9th — Rangers closer José Leclerc is in to try and secure the save.\n10:46 p.m.: Top of 9th — Nathaniel Lowe hit a comebacker at Andrew Saalfrank but the ball ricocheted right to Ketel Marte who pitched it to Christian Walker to end the inning.\n10:44 p.m.: Top of 9th — Jonah Heim struck out swinging and with two outs, that'll do it for Luis Frias. LHP Andrew Saalfrank will come in to face LHH Nathaniel Lowe to try and close out the inning.\n10:39 p.m.: Top of 9th — Mitch Garver flew out to center and the Diamondbacks almost caught Evan Carter slipping, nearly doubling up the rookie at first. Arizona challenged to see if Carter touched second base on his way back but the challenge was unsuccessful.\n10:35 p.m.: Top of 9th — The Diamondbacks are sticking with Luis Frias, but he walked Evan Carter to start the inning.\nEighth inning: Rangers 3, Diamondbacks 1\n10:31 p.m.: Bottom of 8th — And Aroldis Chapman escapes trouble! Corey Seager makes a great backhand play on a grounder from Ketel Marte, setting up a 6-4-3 double play to end the inning. The Rangers remain in the lead 3-1.\nWOW. 🤯\n\nWhat a double play to get out of the inning!!\n\n📺: FOX pic.twitter.com\/zslK4k9L6X — FOX Sports: MLB (@MLBONFOX) October 31, 2023\n10:30 p.m.: Bottom of 8th — Aroldis Chapman gets Corbin Carroll to strike out looking, freezing the star rookie on a filthy slider.\n10:26 p.m.: Bottom of 8th — Geraldo Perdomo drives in Emmanuel Rivera! The No. 8 and 9 spots in Arizona's lineup deliver as Perdomo rips an RBI single into left. Here comes the top of the order with no outs. Rangers lead 3-1.\n10:25 p.m.: Bottom of 8th — The pinch-hit decision pays off as Emmanuel Rivera drives a double down the line in right. Let's see if the Diamondbacks can finally cash in.\n10:20 p.m.: Bottom of 8th — LHP Aroldis Chapman is coming in for Josh Sborz. The Diamondbacks were going to pinch-hit LHH Pavin Smith for Evan Longoria but once the Rangers elected to bring in Chapman, Arizona pivoted to RHH Emmanuel Rivera.\n10:19 p.m.: Bottom of 8th — Adolis Garcia is leaving the game with an oblique injury. Travis Janowski will take his place in right field.\n10:15 p.m.: Top of 8th — Luis Frias does his job, sending down the Rangers' top of the order with ease. Marcus Semien grounded out to second, Corey Seager struck out swinging and Adolis Garcia flew out to center. Something to monitor: Garcia came up holding his left side after the swing that ended the inning.\nAdolis Garcia is coming out of the game following an apparent injury. pic.twitter.com\/m5LV1b4QEX — The Sporting News (@sportingnews) October 31, 2023\n10:10 p.m.: Top of 8th — RHP Luis Frias is in for Kyle Nelson after one inning of work.\nSeventh inning: Rangers 3, Diamondbacks 0\n10:07 p.m.: Bottom of 7th — Josh Sborz battles through to get out of a jam! He got both Lourdes Gurriel Jr. and Alek Thomas to strike out swinging, leaving Tommy Pham stranded on second.\n10:03 p.m.: Bottom of 7th — Christian Walker grounded out to second to start the inning but Tommy Pham injected some life in the Diamondbacks' crowd with a double to deep center. Lourdes Gurriel Jr. is coming to the plate with Alek Thomas on deck.\n10:00 p.m.: Bottom of 7th — Jon Gray was rolling, but Bruce Bochy will elect to turn to RHP Josh Sborz for the bottom of the 7th. Gray was fantastic in a surprise relief appearance, delivering three scoreless innings with three K's and just one hit allowed.\n9:58 p.m.: Top of 7th — Kyle Nelson sends the Rangers down in order. Nathaniel Lowe took him deep to the warning track but Lourdes Gurriel Jr. was there to track it down. Josh Jung grounded out to short and Leody Tavares grounded out to third.\n9:53 p.m.: Top of 7th — LHP Kyle Nelson will enter the game for Miguel Castro with a couple of lefties, Nathaniel Lowe and Josh Jung, coming to the plate to start the inning.\nSixth inning: Rangers 3, Diamondbacks 0\n9:49 p.m.: Bottom of 6th — The Diamondbacks picked up just their third hit of the game on a two-out Ketel Marte single on a line drive off of Marcus Semien's glove, but they failed to make any noise. Geraldo Perdomo and Corbin Carroll both struck out, and Gabriel Moreno flew out to right to end the inning.\n9:42 p.m.: Top of 6th — Evan Carter punched a single to left but Miguel Castro worked his way out of a jam. Mitch Garver flew out to center and Jonah Heim grounded out to third, where Evan Longoria made a nice play and throw to get the runner in time.\n9:35 p.m.: Top of 6th — Corey Seager flew out to center to start the inning but Brandon Pfaadt's night will be over after he issued a free pass to Adolis Garcia. Torey Lovullo will go to RHP Miguel Castro with Evan Carter coming to the plate.\nPfaadt finished with four strikeouts and three earned runs on four hits and two walks over 5.1 innings.\nFifth inning: Rangers 3, Diamondbacks 0\n9:28 p.m.: Bottom of 5th — Jon Gray is cruising. Despite an impromptu appearance, the Rangers pitcher has sent down the first six batters he has faced. Lourdes Gurriel Jr. and Alek Thomas both grounded out and Evan Longoria popped out to first in foul play.\n9:19 p.m.: Top of 5th — Brandon Pfaadt survives a lead-off walk to Nathaniel Lowe unscathed. He struck out Josh Jung, then Leody Tavares lined out to third and Marcus Semien grounded out to third to end the inning.\nFourth inning: Rangers 3, Diamondbacks 0\n9:07 p.m.: Bottom of 4th — Jon Gray didn't need much time to settle in. He struck out Gabriel Moreno, Christian Walker grounded out to third and Tommy Pham flew out to center for an easy 1-2-3 inning.\n9:03 p.m.: Bottom of 4th — An interesting development: Max Scherzer is being pulled from the game after just 36 pitches and three scoreless innings. Scherzer tried to take the mound for the bottom of the fourth but it appears he is being bothered by a lower back injury. It is unknown if the injury is correlated to the comebacker he took off of his lower back in the second inning. RHP Jon Gray will get the ball.\nMax Scherzer left tonight's game with back tightness pic.twitter.com\/JQOP6WvlkC — FOX Sports: MLB (@MLBONFOX) October 31, 2023\n8:58 p.m.: Top of 4th — Brandon Pfaadt bounces back the way Arizona needed him to. He sends Evan Carter, Mitch Garver and Jonah Heim down in order, striking out Garver for Pfaadt's third K of the day.\nThird inning: Rangers 3, Diamondbacks 0\n8:51 p.m.: Bottom of 3rd — Max Scherzer assures the Diamondbacks don't answer right away, getting through the bottom of the 3rd with little resistance. He struck out Evan Longoria and got Geraldo Perdomo to fly out to right before issuing a two-out walk to Corbin Carroll. Carroll advanced to second on a wild pitch, but Scherzer got Ketel Marte to fly out to left to end the frame.\n8:45 p.m.: Top of 3rd — Brandon Pfaadt got Adolis Garcia to strike out swinging to end the inning. The damage was limited to three runs.\n8:43 p.m.: Top of 3rd — Corey Seager rips a two-run home run! The Rangers produce some two-out magic as Seager smokes an inside changeup 421 feet over the right field wall to give Texas a 3-0 lead.\n8:41 p.m.: Top of 3rd — Marcus Semien comes up clutch with a single to left center! The star 2B has been struggling this postseason but he delivered here, driving in Nathaniel Lowe to give the Rangers a 1-0 lead.\n8:39 p.m.: Top of 3rd — Brandon Pfaadt struck out Josh Jung swinging and got Leody Tavares to ground out to second but Nathaniel Lowe advanced to third. He is 90 feet away with two outs and Marcus Semien is coming to the plate.\n8:36 p.m.: Top of 3rd — Nathaniel Lowe gets the Rangers going right away with a double to right center field.\nSecond inning: Rangers 0, Diamondbacks 0\n8:30 p.m.: Bottom of 2nd — Lourdes Gurriel Jr. popped out to second, bringing Alek Thomas to the plate with two outs. Thomas ripped a line drive back at Max Scherzer, which ricocheted perfectly to 3B Josh Jung who made a laser throw to first to get Thomas out in time. What a bizarre inning.\n8:27 p.m.: Bottom of 2nd — Adolis Garcia on the defensive end! Tommy Pham singled to right field and Christian Walker tried to score from second, but Garcia — who has one of the best outfield arms in baseball — hosed him at home plate to save a run. Pham advanced to second on the throw.\nChristian Walker is thrown out by Adolis Garcia after blowing through the stop sign! 😮🛑\n\n📺: FOX pic.twitter.com\/wXM9RbieFp — FOX Sports: MLB (@MLBONFOX) October 31, 2023\n8:25 p.m.: Bottom of 2nd — Christian Walker smoked a first-pitch fastball off the wall to right center for a double to lead off the bottom of the second.\n8:22 p.m.: Top of 2nd — Rangers star rookie Evan Carter led off the top of the second with a hard-hit single to right center, but Mitch Garver topped a grounder to Brandon Pfaadt for a 1-4-3 double play. Jonah Heim flew out to center to end the inning. Pfaadt has only needed 18 pitches to get through his first six batters.\nFirst inning: Rangers 0, Diamondbacks 0\n8:15 p.m.: Bottom of 1st — Max Scherzer got Corbin Carroll to ground out to short, but he walked Ketel Marte to give the Diamondbacks the first baserunner of the game. Scherzer almost immediately avoided any trouble, forcing Gabriel Moreno to ground into a 5-4-3 double play two pitches later to end the inning.\n8:08 p.m.: Top of 1st — Brandon Pfaadt breezes through the top of the Rangers' order with ease. Marcus Semien popped out to right, Corey Seager grounded out to first base on a first-pitch sinker and Adolis Garcia flew out to center. Pfaadt only needed 10 pitches to get through the top of the first.\nPregame\n3:29 p.m.: After only scoring one run in Game 2, the Rangers will make a slight tweak to the lineup. Adolis Garcia will slide up to the No. 3 spot, with Evan Carter hitting clean-up. As Texas PR mentioned, Carter is the fifth-youngest player in World Series history to bat fourth, joining Juan Soto, Ty Cobb, Miguel Cabrera and Claudell Washington.\nRHP Max Scherzer will get the start.\n3:10 p.m.: The Diamondbacks will have Corbin Carroll return to the top of the lineup after leading off with Ketel Marte in Game 2. RHP Brandon Pfaadt will get the ball to start.\nBrandon Pfaadt and Game 3. Name a more iconic duo, we'll wait. #EmbraceTheChaos pic.twitter.com\/d82p8u74RL — Arizona Diamondbacks (@Dbacks) October 30, 2023\n1:23 p.m.: A quick stadium update for Chase Field: the roof will be OPEN tonight for Game 3!\nThe roof will be OPEN for tonight’s #WorldSeries game!\n\nGates open at 2pm, so we will see you soon! pic.twitter.com\/SmZDZNk870 — Chase Field (@ChaseField) October 30, 2023\nRangers vs. Diamondbacks Game 3 start time\nDate: Monday, Oct. 30\nMonday, Oct. 30 First pitch: 8:03 p.m. ET (5:03 p.m. MST)\n8:03 p.m. ET (5:03 p.m. MST) Location: Chase Field, Phoenix, AZ\nFirst pitch for Game 3 of the 2023 World Series between the Rangers and Diamondbacks is set for 8:03 p.m. ET.\nHow to watch the 2023 World Series\nChannel: Fox (U.S.) | Sportsnet (Canada)\nFox (U.S.) | Sportsnet (Canada) Live stream: Fox Sports app, Fubo (U.S.) | Sportsnet NOW (Canada)\nFox will carry the full World Series between the Rangers and Diamondbacks. Joe Davis will be handling play-by-play, while John Smoltz will provide commentary. Ken Rosenthal and Tom Verducci will be reporting from the dugouts.\nFor those who have cut the cord on cable, fans can find the game on the Fox Sports app or with Fubo, which offers a free trial. Canadian viewers can find the game on Sportsnet or on Sportsnet NOW.\nMLB playoff schedule, results\n(All times Eastern)\nAmerican League\nWild Card\nDate Result Oct. 3 Rangers 4, Rays 0 Oct. 3 Twins 3, Blue Jays 1 Oct. 4 Rangers 7, Rays 1 Oct. 4 Twins 2, Blue Jays 0\nDivision Series\nDate Result Oct. 7 TEX 3, BAL 2 (TEX, 1-0) Oct. 7 HOU 6, MIN 4 (HOU, 1-0) Oct. 8 TEX 11, BAL 8 (TEX, 2-0) Oct. 8 MIN 6, HOU 2 (Tied, 1-1) Oct. 10 HOU 9, MIN 1 (HOU, 2-1) Oct. 10 TEX 7, BAL 1 (TEX wins 3-0) Oct. 11 HOU 3, MIN 2 (HOU wins, 3-1)\nChampionship Series\nDate Matchup Start time (ET) TV channel Result Oct. 15 Rangers at Astros 8:15 p.m. Fox TEX 2, HOU 0 (TEX, 1-0) Oct. 16 Rangers at Astros 4:37 p.m. Fox or F TEX 5, HOU 4 (TEX, 2-0) Oct. 18 Astros at Rangers 8:03 p.m. FS1 HOU 8, TEX 5 (TEX, 2-1) Oct. 19 Astros at Rangers 8:03 p.m. FS1 HOU 10, TEX 3 (TIE, 2-2) Oct. 20 Astros at Rangers* 7:07 p.m. FS1 HOU 5, TEX 4 (HOU, 3-2) Oct. 22 Rangers at Astros* 8:03 p.m. FS1 TEX 9, HOU 2 (TIED, 3-3) Oct. 23 Rangers at Astros* 8:03 p.m. Fox or FS1 TEX 11, HOU 4 (TEX wins, 4-3)\n*If necessary\nNational League\nWild card series\nDate Result Oct. 3 Diamondbacks 6, Brewers 3 Oct. 3 Phillies 3, Marlins 1 Oct. 4 Diamondbacks 5, Brewers 2 Oct. 4 Phillies 7, Marlins 1\nDivision Series\nDate Result Oct. 7 PHI 3, ATL 0 (PHI, 1-0) Oct. 7 ARI 11, LAD 2 (ARI, 1-0) Oct. 9 ATL 5, PHI 4 (Tied 1-1) Oct. 9 ARI 4, LAD 2 (ARI, 2-0) Oct. 11 PHI 10, ATL 2 (PHI, 2-1) Oct. 11 ARI 4, LAD 2 (ARI wins, 3-0) Oct. 12 PHI 3, ATL 1 (PHI wins, 3-1)\nChampionship Series\nDate Matchup Start time (ET) TV channel Result Oct. 16 Diamondbacks at Phillies 8:07 p.m. TBS PHI 5, ARI 3 (PHI, 1-0) Oct. 17 Diamondbacks at Phillies 8:07 p.m. TBS PHI 10, ARI 0 (PHI, 2-0) Oct. 19 Phillies at Diamondbacks 5:07 p.m. TBS ARI 2, PHI 1 (PHI, 2-1) Oct. 20 Phillies at Diamondbacks 8:07 p.m. TBS ARI 6, PHI 5 (Tied 2-2) Oct. 21 Phillies at Diamondbacks 8:07 p.m. TBS PHI 6, ARI 1 (PHI, 3-2) Oct. 23 Diamondbacks at Phillies 5:07 p.m. TBS ARI 5, PHI 1 (Tied, 3-3) Oct. 24 Diamondbacks at Phillies* 8:07 p.m. TBS ARI 4, PHI 2 (ARI wins, 4-3)\n*If necessary\nWorld Series schedule\nDate Matchup Start time (ET) TV channel Result Oct. 27 Diamondbacks at Rangers 8:03 p.m. Fox TEX 6, ARI 5 (TEX 1-0) Oct. 28 Diamondbacks at Rangers 8:03 p.m. Fox ARI 9, TEX 1 (Tied 1-1) Oct. 30 Rangers at Diamondbacks 8:03 p.m. Fox -- Oct. 31 Rangers at Diamondbacks 8:03 p.m. Fox -- Nov. 1 Rangers at Diamondbacks* 8:03 p.m. Fox -- Nov. 3 Diamondbacks at Rangers* 8:03 p.m. Fox -- Nov. 4 Diamondbacks at Rangers* 8:03 p.m. Fox --\n*If necessary\n\nThis article, authored by Kyle Irving, was published by Sporting News on 2023-10-30 under the category 'sports'.\n\n","id":495}
{"title":"A provocative role for technologists in product innovation","context":"## A provocative role for technologists in product innovation\n\nProduct design is in a moment of profound change and redefinition as technologies like artificial intelligence (AI) and spatial computing dramatically affect computing experiences. AI, especially, may have only minor impacts on interface design but will significantly impact the holistic product or ecosystem experience. Spatial computing, on the other hand, will change human-computer interactions and unmoor our understanding of what a computer is.\nIn this innovation cycle, product design requires a wider perspective of platforms and interconnections between technologies, creating a strong need for technologists and designers to be in the process together.\nFor successful products and businesses, innovation is perpetual. There is a never-ending search to find the next new thing that enhances the user experience, extends product reach, expands revenue, or all three simultaneously. Product design makes innovation less daunting and increases chances for success because it is a multidisciplinary process with structures and frameworks to catalyze innovation. Technologists have a role in the process that expands beyond simply validating the technology or concept, which is their customary responsibility. Before discussing the nontraditional ways technologists participate in product innovation, let’s conceptually examine innovation and product design.\nThe word innovation has a simple meaning — to introduce something new or a novel method of doing something — yet we frequently inflate it to mean something magical, grandiose, and world-changing. Innovation can just as easily be mundane and straightforward. The key to innovation is being “new.” The “new” can be localized to a team, product, process, or business unit. The “novel” can be well-known and established practices not incorporated into your workflow or product. Sometimes, innovation comes from closing small gaps and isn’t always a grand eureka moment.\nInstead of forcing a technology onto a product, the design process flows to the technologies. In this way, the technology becomes a natural solution.\nProduct design is a process and not a discipline or deliverable. It is (understandably) easy to limit the scope of product design to color choices, content layout, and aesthetics. Too often, design is minimized to only the act of making user interfaces pretty. Product design is much deeper and broader in scope than visual design assets. For example, product design can give direction and focus to a business strategy, user experience strategy, or technology explorations.\nThe process establishes a guide rail throughout any innovation initiative. The core of product design is decision-making with an astute instinct for making the best decisions at the most opportune time. Product design helps reduce risk and leads to more effective innovation through quality decision-making.\nA progressive role for technologists\nTechnologists play a strategic role in product innovation and should bring a metaphysical perspective in addition to being punctilious. Our job is to communicate the essence of a technology and think strategically about the application of technologies to problem spaces. We are most constructive when we translate the technicals of “how to make X do Y” to “these are the types of products and services realizable with technology X.”\nFor most technical leads and software developers, this is a mode inversion from our traditional tactical and direct interaction with technology. The context switch from daily build-and-operate is challenging but is paramount to developing successful and innovative products. We are uniquely positioned to generate strategic insights translated from dense technical minutiae that drive innovative business cases and product experiences.\nA technology innovation must solve a business problem, such as improving operational efficiency, growing existing revenue streams, or generating new ones. The problem space may be customer-facing (e.g., how can we deliver a new feature?) or internal-facing (e.g., how can we make a process more efficient?). The problem is the paramount concern. The specific technologies or innovations used to solve the problem are often less critical. We cannot lose perspective of the business needs; otherwise, the activities become too academic or a paid hobby.\nAn ordinary domestic analogy is hanging a picture. The hole size, bracket, or tools used to hang the picture are immaterial as long as the picture is on the wall and straight. The specifics of the process and technologies are only important as they pertain to how well they solve the problem, the costs to do so, and the overall end user experience.\nProduct innovation is experimental and should not always be expected to yield productive results. It requires a learning curve and patience, as the outcomes are often ambiguous and unknown. Business leadership can struggle with this perspective because it is indefinite (in terms of results and timelines), and it is challenging to translate pure technology innovation into value creation. A gap opens between technology and product teams wherein technology teams strain to articulate the capabilities and value of a technology innovation, leading to unfilled promises and the perception of “technology for the sake of technology” or quips like “a solution looking for a problem.”\nThe current hype cycle in AI serves as a great concrete example. For technology or product executives, the challenge is how to do more than check the AI box — it’s about how to meaningfully incorporate AI into a product. Instead of forcing a technology onto a product, the design process flows to the technologies. In this way, the technology becomes a natural solution.\nAs experts on a technology or technology stack, we can communicate abstract insights or contribute in more conceptual contexts. Technologists add value to the product design process by sharing their expertise on a technology’s characteristics. Designers use this information to shape and exploit technologies in the visual and interaction design process. In this way, technologists inform new interaction models, interface metaphors, and product channels. This involvement gives confidence and conviction to the promises of design.\nThink of digital technologies as a material like paint, stone, or wood. For artisans to create with materials, they must understand the material’s ontology and phenomenology. An artist must know the differences between oil, acrylic, or watercolor paints because each material has different properties that affect how and what can be created. Technologists must “find the grain” of a technology. In this way, they become an intermediary between the abstract nature of design and the pedantic nature of technology. This philosophical perspective is especially important when a product is in a growth stage or when using emerging technologies.\nRegardless of whether your product is growing or in a stable stage or employs established or emerging technologies, integrating technologists into the product strategy and design process enriches the final outcome. There is a technology perspective extending beyond the operations and mechanics of the code “factory floor,” which provokes innovation. Sometimes this leads to small, impactful moments of innovation — and sometimes it is a brilliant revolution.\n\nThis article, authored by Carrie Andrews, was published by TechCrunch on 2023-12-21 under the category 'technology'.\n\n","id":496}
{"title":"NBA Prop Bets - Best Team and Player Props 2023\/24 Season","context":"## NBA Prop Bets - Best Team and Player Props 2023\/24 Season\n\nThe NBA is one of the most popular sports to bet on in the US. NBA prop bets are an easy way to jump into basketball betting.\nProposition bets, or props, are easy to understand, numerous, and cover both player props and team props to give you plenty of variety.\nBelow, we look at betting NBA props at the best NBA betting sites and share some key information to make informed bets.\nWhat are NBA props?\nA prop bet is a side wager on an aspect of a game that usually doesn’t tie directly to the result. In the NBA, prop bets deal with both players and teams.\nSome examples of NBA player props are:\nHow many points a player will score\nNumber of rebounds a player will have\nHow many assists a player will get\nRebounds and assists combined\nPoints, rebounds, and assists combined\nHow many steals a player will get\nNumber of three-pointers made\nSome examples of NBA team props include:\nWhich team will reach 10 points first\nWhich team will have the highest-scoring period\nWhich team will score first\nWhich team will win the first half\nWhich team will win the second half\nWill there be a fourth-quarter comeback victory\nAll of the best sports betting sites have their selection of prop bets for each NBA game, so shop around to find the sportsbooks that best suit your needs.\nHow to bet on NBA props\nThe first step to betting on NBA props is opening an account at an online sportsbook. The process is simple, free, and doesn’t take very long. Below are the steps to opening a new account at an online sportsbook.\nChoose your sportsbook: Any state with legal online sports betting has a variety of sportsbooks. If you aren’t sure which sportsbooks best fit your needs, research and read our reviews on each. And don’t forget that you can have an account with more than one. Once you decide which sportsbook you’re interested in, follow the link from our site to qualify for the best new customer welcome bonus.\nRegister for an account: At the top of the homepage of the sportsbook website, you will find a button that says “register” or “sign up.” Click that, and you’ll be taken to a form you must fill out. It will ask for personal information such as your name, phone number, email address, last four digits of your Social Security number, and more.\nAccept the terms and conditions: Before finalizing your account information, you must accept the sportsbook’s terms and conditions. We recommend you read through these to understand the rules your sportsbook will enforce regarding bets, especially for the sports you intend to wager on. The terms and conditions are also available on the sportsbook website for you to read at any point.\nGet your bonus: At this point, you can accept your welcome bonus. Be sure to read through the bonus requirements before accepting anything. If a bonus code is needed, which you can find on our website, this is where you will input it during the registration process.\nMake a deposit: Now that you’ve signed up for an account, you can start funding your bankroll by making a deposit. Most legal sportsbooks have a variety of ways you can add funds to your account, such as through your bank or an e-wallet.\nStart betting: Go to the basketball section of your sportsbook and select the NBA. From there, you can choose individual games and make bets like money lines, point spreads, totals, props, futures, and more.\nHow to read NBA props odds\nAt first glance, all the positive and negative numbers at US sportsbooks can be daunting. The good news is they are easy to read once you understand what you see.\nNegative numbers, such as -110, represent how much money you need to wager to win $100. In many cases, such as a moneyline bet, the negative number also indicates which side of the bet is the favorite to win.\nFor example, if you were to bet on LeBron James scoring over 15.5 points in a contest at -125 odds, you’d need to wager $125 to win $100. If you did and your bet was correct, then you’d take home $225, which is your original $125 stake returned to you plus your $100 in profit.\nPositive numbers, like +145, show how much you stand to win for every $100 you wager. If you were to bet $50 on Giannis Antetokounmpo to have over 7.5 rebounds and the odds were +130 at the time you finalized your bet slip, you would win $65 in profit if your bet wins.\nPositive numbers also indicate which side of the bet is the underdog in the eyes of the oddsmakers.\nRemember that you can bet as little or as much as you want, and your payout will be calculated based on your wager amount and the odds at the time you make your bet.\nTypes of NBA props\nYou can make two main prop bets on the National Basketball Association:\nTeam props\nPlayer props\nTeam props are typically focused on statistical accomplishments by a particular team and rarely on the game’s result. You’ll often come across NBA team prop bets that are based on a team’s points, such as the first team to reach 20 points, the first team to score in a game, or whether the total points by both teams in a contest will end up being odd or even.\nTeam props, also known as “game props,” don’t rely on individual players but rather on the team as a whole. Player props, on the other hand, are driven by individual performance.\nThese individual props are focused on statistical milestones during a game. The most popular bets typically focus on points, rebounds, assists, and three-point field goals. You can also bet on combination wagers, such as points and rebounds together.\nIn most cases, you can bet on traditional statistics for the five starters on each team.\nSee more:\nTips for betting on NBA props\nEvery bettor should develop their strategies, but we do have three tips you can use for NBA props.\nPay attention to player and team news: Oddsmakers use various information to develop their lines for games and players, and you should, too. Keep tabs on player news and injuries, when top players are being rested, how they performed in recent games, and more. You can find value in player and team props by gathering information from multiple sources and tracking how players and their teammates perform. For example, if one of the starting guards is questionable for a game, you might want to consider the other guard for increased points or assists since they’ll likely handle a heavier load.\nKeep an eye on usage and minutes: Even slight increases to a player’s average minutes can make a difference when betting player props, especially later in the season when aging veteran players tend to rest more. Keep yourself informed on usage and minutes trends for the players you’re considering betting on, and use them to your advantage. Remember that some of the best players in the NBA were once on the bench for most games until small increases in their playing time gave them a chance to shine.\nShop for the best lines: This tip applies to every bet you make. Using multiple sportsbook accounts lets you find the best odds for every NBA prop bet. Even the smallest differences, like one sportsbook having odds at +125 and another at +135, can make a difference in your profit. By shopping for the best lines, you can make smarter bets and find the best value.\nRelated Pages:\n\nThis article, authored by Sam Eggleston, was published by Sporting News on 2023-10-02 under the category 'sports'.\n\n","id":497}
{"title":"The UK just laid out new rules for the internet — it only gets harder from here","context":"## The UK just laid out new rules for the internet — it only gets harder from here\n\nAfter the Online Safety Act’s arduous multiyear passage through the UK’s lawmaking process, regulator Ofcom has published its first guidelines for how tech firms can comply with the mammoth legislation. Its proposal — part of a multiphase publication process — outlines how social media platforms, search engines, online and mobile games, and pornography sites should deal with illegal content like child sexual abuse material (CSAM), terrorism content, and fraud.\nToday’s guidelines are being released as proposals so Ofcom can gather feedback before the UK Parliament approves them toward the end of next year. Even then, the specifics will be voluntary. Tech firms can guarantee they’re obeying the law by following the guidelines to the letter, but they can take their own approach so long as they demonstrate compliance with the act’s overarching rules (and, presumably, are prepared to fight their case with Ofcom).\n“What this does for the first time is to put a duty of care on tech firms”\n“What this does for the first time is to put a duty of care on tech firms to have a responsibility for the safety of their users,” Ofcom’s online safety lead, Gill Whitehead, tells The Verge in an interview. “When they become aware that there is illegal content on their platform, they have got to get it down, and they also need to conduct risk assessments to understand the specific risks that those services might carry.”\nThe aim is to require that sites be proactive to stop the spread of illegal content and not just play whack-a-mole after the fact. It’s meant to encourage a switch from a reactive to a more proactive approach, says lawyer Claire Wiseman, who specializes in tech, media, telecoms, and data.\nOfcom estimates that around 100,000 services may fall under the wide-ranging rules, though only the largest and highest-risk platforms will have to abide by the strictest requirements. Ofcom recommends these platforms implement policies like not allowing strangers to send direct messages to children, using hash matching to detect and remove CSAM, maintaining content and search moderation teams, and offering ways for users to report harmful content.\nLarge tech platforms already follow many of these practices, but Ofcom hopes to see them implemented more consistently. “We think they represent best practice of what’s out there, but it’s not necessarily applied across the board,” Whitehead says. “Some firms are applying it sporadically but not necessarily systematically, and so we think there is a great benefit for a more wholesale, widespread adoption.”\nThere’s also one big outlier: the platform known as X (formerly Twitter). The UK’s efforts with the legislation long predate Elon Musk’s acquisition of Twitter, but it was passed as he fired large swaths of its trust and safety teams and presided over a loosening of moderation standards, which could put X at odds with regulators. Ofcom’s guidelines, for example, specify that users should be able to easily block users — but Musk has publicly stated his intentions to remove X’s block feature. He’s clashed with the EU over similar rules and reportedly even considered pulling out of the European market to avoid them. Whitehead declined to comment when I asked whether X had been cooperative in talks with Ofcom but said the regulator had been “broadly encouraged” by the response from tech firms generally.\n“We think they represent best practice of what’s out there, but it’s not necessarily applied across the board.”\nOfcom’s regulations also cover how sites should deal with other illegal harms like content that encourages or assists suicide or serious self-harm, harassment, revenge porn and other sexual exploitation, and the supply of drugs and firearms. Search services should provide “crisis prevention information” when users enter suicide-related queries, for example, and when companies update their recommendation algorithms, they should conduct risk assessments to check that they’re not going to amplify illegal content. If users suspect that a site isn’t complying with the rules, Whitehead says there’ll be a route to complain directly to Ofcom. If a firm is found to be in breach, Ofcom can levy fines of up to £18 million (around $22 million) or 10 percent of worldwide turnover — whichever is higher. Offending sites can even be blocked in the UK.\nToday’s consultation covers some of the Online Safety Act’s least contentious territory, like reducing the spread of content that was already illegal in the UK. As Ofcom releases future updates, it will have to take on touchier subjects, like content that’s legal but harmful for children, underage access to pornography, and protections for women and girls. Perhaps most controversially, it will need to interpret a section that critics have claimed could fundamentally undermine end-to-end encryption in messaging apps.\nThe section in question allows Ofcom to require online platforms to use so-called “accredited technology” to detect CSAM. But WhatsApp, other encrypted messaging services, and digital rights groups say this scanning would require breaking apps’ encryption systems and invading user privacy. Whitehead says that Ofcom plans to consult on this next year, leaving its full impact on encrypted messaging uncertain.\n“We’re not regulating the technology, we’re regulating the context.”\nThere’s another technology not emphasized in today’s consultation: artificial intelligence. But that doesn’t mean AI-generated content won’t fall under the rules. The Online Safety Act attempts to address online harms in a “technology neutral” way, Whitehead says, regardless of how they’ve been created. So AI-generated CSAM would be in scope by virtue of it being CSAM, and a deepfake used to conduct fraud would be in scope by virtue of the fraud. “We’re not regulating the technology, we’re regulating the context,” Whitehead says.\nWhile Ofcom says it’s trying to take a collaborative, proportionate approach to the Online Safety Act, its rules could still prove onerous for sites that aren’t tech juggernauts. BBC News notes that Ofcom’s initial set of guidance is over 1,500 pages long. The Wikimedia Foundation, the nonprofit behind Wikipedia, tells The Verge that it’s proving increasingly challenging to comply with different regulatory regimes across the world, even if it supports the idea of regulation in general. “We are already struggling with our capacity to comply with the [EU’s] Digital Services Act,” the Wikimedia Foundation’s VP for global advocacy, Rebecca MacKinnon, says, pointing out that the nonprofit has just a handful of lawyers dedicated to the EU regulations compared to the legions that companies like Meta and Google can dedicate.\n“We agree as a platform that we have responsibilities,” MacKinnon says, but “when you’re a nonprofit and every hour of work is zero sum, that’s problematic.”\nOfcom’s Whitehead admits that the Online Safety Act and Digital Services Act are more “regulatory cousins” than “identical twins,” which means complying with both takes extra work. She says Ofcom is trying to make operating across different countries easier, pointing toward the regulator’s work setting up a global online safety regulator network.\nPassing the Online Safety Act during a turbulent era in British politics was already difficult. But as Ofcom begins filling in its details, the real challenges may be only beginning.\n\nThis article, authored by Jon Porter, was published by The Verge on 2023-11-09 under the category 'technology'.\n\n","id":498}
{"title":"How to get Pumpkin Tickets, Jack-o’-Head armor in Monster Hunter Now’s Halloween event","context":"## How to get Pumpkin Tickets, Jack-o’-Head armor in Monster Hunter Now’s Halloween event\n\nHalloween in Monster Hunter Now is the first themed event to come to Capcom and Niantic’s monster-hunting AR game.\nThe main draw is acquiring the Jack-o’-Head Halloween armor, which can be sourced from collecting Pumpkin Tickets, a currency specific to the event.\nAs well as this, the weekend introduces a pumpkin rock Kulu-Ya-Ku and the chance to add a Halloween medal for your collection.\nHere’s everything we know about Monster Hunter Now’s Halloween event — from how to get Pumpkin Tickets to dates, times, and other event bonuses.\nMonster Hunter Now Halloween event dates, times, and bonuses\nMonster Hunter Now’s Halloween event takes place between Wednesday, Oct. 25, at 9 a.m. to Tuesday, Oct. 31, at 11.59 p.m. local time, and has two phases:\nStart of event onwards: Pumpkin Tickets, Halloween Pumpkin Hunt Quests available (active until end of event)\nPumpkin Tickets, Halloween Pumpkin Hunt Quests available (active until end of event) Saturday, Oct. 28, at 9 a.m. local time onwards: Pumpkin rock Kulu-Ya-Ku in the wild, Halloween Medal Acquisition Quests available (active until end of event)\nIn summary — you can begin earning Pumpkin Tickets at any time through the questline, but it isn’t until Saturday morning where you can encounter pumpkin rock Kulu-Ya-Ku and earn the Halloween medal.\nPumpkin rock Kulu-Ya-Ku and Halloween Medal quest now live in #MHNow pic.twitter.com\/czLNPbQy3u — Matthew Reynolds (@Crazyreyn) October 28, 2023\nAs well as the above quests, monsters, and currencies, the game’s various arenas also see a Halloween makeover — with the world map, encounter screen, and battle arena becoming adorned with pumpkins.\nHow to get Pumpkin Tickets in Monster Hunter Now\nCollecting Pumpkin Tickets is how you source the event-exclusive Jack-o’-Head armor piece. You can get Pumpkin Tickets in Monster Hunter Now by:\nCompleting Pumpkin Hunt Quests in the Special tab during the Halloween event (18 total: one per quest in the first step, five per quest in the second)\nin the Special tab during the Halloween event (18 total: one per quest in the first step, five per quest in the second) Defeating pumpkin rock Kulu-Ya-Ku (Saturday, Oct. 28, at 9 a.m. local time until the end of the event)\nThis means, until Saturday morning, you’ll be capped with how many Pumpkin Tickets you can earn until pumpkin rock Kulu-Ya-Ku makes its debut.\nBoth of the above sources are available to players who have reached Hunter Rank 11 and above.\nMonster Hunter Now Halloween Pumpkin Hunt quest steps\nYou can find the following steps in Events part of the Special quests screen. All steps will expire at the end of the Halloween event at the end of Oct. 31.\nStep 1 of 3\nObtain Lollipop Candy from gathering points (10) — 1 Pumpkin Ticket, 100 HR Points\nSlay large monsters (15) — 1 Pumpkin Ticket, 100 HR Points\nSlay monsters (30) — 1 Pumpkin Ticket, 100 HR Points\nStep 2 of 3\nObtain Lollipop Candy from gathering points (20) — 5 Pumpkin Tickets, 150 HR Points\nSlay large monsters (30) — 5 Pumpkin Tickets, 150 HR Points\nSlay monsters (50) — 5 Pumpkin Tickets, 150 HR Points\nStep 3 of 3\nObtain Lollipop Candy from gathering points (50) — 1,000 Zenny, 200 HR Points\nSlay large monsters (60) — 1,000 Zenny, 200 HR Points\nSlay monsters (80) — 1,000 Zenny, 200 HR Points\nThanks to FranklyNinja on Reddit for helping fill in the gaps with the above. As with the story items you need to acquire from the wild, you can obtain Lollipop Candy from interacting with any gathering point.\nHow to get Jack-o’-Head armor, upgrade requirements\nTo get the Jack-o’-Head armor in Monster Hunter Now’s Halloween event, you must first earn 10 Pumpkin Tickets.\nHere’s how it looks in-game courtesy of minimi_249 on Twitter \/ X:\nUpgrading the armor then requires further Pumpkin Tickets, which can only be sourced from the Halloween event. Developer Niantic has said once you have spent 70 Pumpkin Tickets on Jack-o’-Head armor upgrades, further improvements will then only regular crafting materials. As such, this is a good number to aim for if you prefer to continue upgrading after the event ends.\nJack-o’-Head armor skill explained\nOnce equipped, the Jack-o’-Head armor has the skill Solidarity (Pumpkin Hunt). This is a party-based skill where having multiple players with the skill active increases attack power. During the Halloween event, this effect is increased by five.\nAs such, this is a rather situational skill, as not only do you need to be hunting with other players, but doing so during the Halloween event (which ends after Oct. 31) will see the most benefit.\nIt’s entirely possible this skill will appear in future armor pieces to increase its potency (such as during next year’s Halloween event), so crafting one now could be a sound investment for those looking to play with other hunters. Otherwise, for solo players, it might be simply a piece to add to your collection, especially if the ability to transmog (change the appearance of your armor) comes to the game one day.\nWhere to find pumpkin rock Kulu-Ya-Ku in Monster Hunter Now\nA Halloween-themed Kulu-Ya-Ku holding a pumpkin rock will “appear in larger numbers than usual” from Saturday, Oct. 28 at 9 a.m. local time until the end of Oct. 31.\nBy its very nature, Kulu-Ya-Ku appears in all three habitats (Forest, Desert, and Swamp) meaning they can appear anywhere on the map.\nBeyond the novelty of battling a Halloween-themed monster, taking down these special pumpkin rock Kulu-Ya-Ku will reward you with Pumpkin Tickets.\nNiantic has confirmed any pumpkin rock Kulu-Ya-Ku tagged with paintballs during the event will continue to drop Pumpkin Tickets after the event ends — giving you extra time if needed.\nLooking for more guides? Our Monster Hunter Now tips and tricks page can give you some extra pointers, while our monster list delves into all other available encounters.\n\nThis article, authored by Matthew Reynolds, was published by Polygon on 2023-10-25 under the category 'entertainment'.\n\n","id":499}