{"title":"49ers cap space 2024: Why Chase Young trade may not be a pure rental for San Francisco","context":"## 49ers cap space 2024: Why Chase Young trade may not be a pure rental for San Francisco\n\nThe 49ers made the biggest move ahead of the 2022 NFL trade deadline when they acquired running back Christian McCaffrey from the Panthers. They once again made a splash ahead of the 2023 trade deadline when they traded for Commanders pass rusher Chase Young.\nYoung was among the most notable players dealt ahead of the 2023 trade deadline. The No. 2 pick in the 2020 NFL Draft is in the midst of a breakout season, totaling five sacks in eight games and generating a solid 18 pressures while getting into the backfield often for the Commanders.\nBut as Washington jettisoned its top two defensive ends, Young and Montez Sweat, the 49ers found themselves positioned to pounce. They traded a 2024 third-round pick to get the talented defender and reunite him with his college teammate and fellow No. 2 pick, Nick Bosa.\nYoung should provide a boost to a 49ers defense that ranks just 22nd this season in sacks per game at 2.3. But many are wondering whether Young will end up being a rental for the 49ers or more of a long-term investment.\nThat will all depend on how San Francisco manages its salary cap in 2024.\nMORE DEADLINE: Live tracker | Grading every trade\nOn the surface, it may look hard for the 49ers to re-sign Young long-term; in reality, the team has more flexibility to do so than it would initially appear. Here's why.\n49ers cap space 2024\nAs it stands, the 49ers don't project to have much cap space in 2024. In fact, OverTheCap lists San Francisco as having just $1,479,772 in available space. That is good for the seventh-least in the NFL.\nThat said, the 49ers are equipped to increase their cap space with relative ease. How? Well, they have at least one player on their roster, Randy Gregory, who has an eight-digit salary but doesn't have any guaranteed money left on his deal. That means that the 49ers could release him without taking a dead-cap hit, which is a financial term for when a player no longer on the roster is still owed guaranteed money; that would open up $14 million more in cap space.\nElsewhere, the team has 10 other players on the active roster set to have cap hits of at least $14.1 million who could restructure or extend their contracts.\nWhen NFL teams restructure contracts, they typically take a player's base salary — which is accounted for in a one-year duration — and turn it into some sort of signing bonus. That bonus is allowed to be prorated over the duration of the contract, so it spreads what would be a high, one-year cost out into a moderate cost over several years.\nTypically, players who have their contracts restructured have high cap hits and high base salaries. So, in looking at the 49ers' highest-paid players for 2024, there are a few options for restructures, as you can see below.\nPlayer 2024 cap hit Base salary Dead cap hit Trent Williams $31.7 million $20.1 million $29.9 million Arik Armstead $28.6 million $17.4 million $25.9 million Deebo Samuel $28.6 million $21 million $26.5 million Fred Warner $24.5 million $15.3 million $25.6 million George Kittle $22 million $13.4 million $18.9 million Charvarius Ward $17.9 million $12.6 million $17.2 million Javon Hargrave $15.5 million $8.9 million $33.4 million Nick Bosa $14.6 million $1.1 million $76.5 million Brandon Aiyuk $14.1 million $14.1 million $14.1 million Christian McCaffrey $14.1 million $11.8 million $8.6 million\nSo, if any of Williams, Armstead, Samuel, Kittle or Warner were to restructure their contracts or if a player like Aiyuk got an extension, that would push some of the 49ers' cap hits into future years. That could prove a worthwhile move if it allows for the team to keep Young and keep its Super Bowl window open with the ultra-cheap Brock Purdy at quarterback.\nOf course, the team could also release some of its players, like Gregory, to open up space. It doesn't seem likely that any of the players listed above would be cut or traded as all are owed hefty guarantees and come with big dead-cap hits; but the 49ers could trim from the margins of the roster if they need just a bit more cap space to keep Young around.\nBut a restructuring of contracts will almost certainly happen in San Francisco during the offseason; it's just a matter of which and how many players will get that treatment and whether those funds will be allocated to Young or other portions of the roster.\nIYER: Grading the Chase Young to the 49ers trade\nChase Young contract projection\nAssessing how San Francisco can try to keep Young also includes looking at what Young's value might be on the open market. It's likely that the 24-year-old will get a large payday as a free agent, but it's just a matter of how big it will be.\nSpotrac.com projects that Young should make about $17.8 million annually on a four-year deal. However, that seems a bit light considering that it includes a couple of interior defensive linemen — Dre'Mont Jones and Zach Allen — among his closest comparisons.\nIt seems more likely that Young will be paid to his potential as well, considering that he missed a lot of time in Years 2 and 3 with injuries. Thus, he may end up being highly paid in terms of average annual value (AAV) but he may see lower-end guarantees.\nAt the end of the day, however, the deal that seems most likely to suit him is one similar to the extension that the Packers gave Rashan Gary.\nGary is set to have an AAV of $24 million over the duration of that contract while making $96 million over four years. However, only $34.6 million of that deal is guaranteed, as Gary was inconsistent to start his career and dealt with a torn ACL in 2022.\nRashan Gary contract value\nLength 4 years Total value $96 million AAV $24 million Guarantees $34.6 million\nYoung could hypothetically crack $100 million if he's allowed to hit the open market, but the Gary deal projection seems like a sensible ballpark for now.\nOf course, the 49ers could also try to slap him with the franchise tag if they're worried about paying him and Bosa big bucks long-term. That was worth just under $20 million last season, so that may look like San Francisco's best avenue toward keeping its Super Bowl window ajar.\nHowever, one-year deals are often complicated to fit into smaller amounts of salary cap space, so the 49ers would likely prefer to get a long-term agreement in place with Young to keep him. At the end of the day, franchising him may not be worth the hassle — even if he is easily the team's best free agent in 2024.\nMORE: Why the 49ers traded for Chase Young, explained\n49ers free agents 2024\nYoung's quest to earn a deal with the 49ers could be aided by the fact that they don't have many key players set to be free agents in 2024.\nAs it stands, only 15 other 49ers are set to be free agents in 2024. Just two of them, Tashaun Gipson and Clelin Ferrell, are full-time starters; and Young eventually figures to take over as starter for Ferrell.\nBelow is the full list of 49ers free agents for the 2024 offseason.\nBrandon Allen, QB\nOren Burks, LB\nSam Darnold, QB\nRoss Dwelley, TE\nJon Feliciano, C\nClelin Ferrell, EDGE\nDemetrius Flanagan-Fowles, LB\nTashaun Gipson, S\nKevin Givens, DT\nJauan Jennings, WR\nJavon Kinlaw, DT\nRay-Ray McCloud, WR\nTerrance Mitchell, CB\nMatt Pryor, OT\nCharlie Woerner, TE\nChase Young, EDGE\nSo, while the 49ers will have some key role players like Sam Darnold, Jauan Jennings and Oren Burks set to get new deals, the team's free-agent class is short on high-end talent. That will make it easier for them to focus on keeping Young if they so desire.\nAs such, fans should view his acquisition as more of an audition to remain with the 49ers than a pure rental.\n\nThis article, authored by Jacob Camenker, was published by Sporting News on 2023-10-31 under the category 'sports'.\n\n","id":500}
{"title":"'In God We Trust' essential to America's future as national faith appears to wane, says Washington pastor","context":"## 'In God We Trust' essential to America's future as national faith appears to wane, says Washington pastor\n\nTrust in God has been a foundational principle of the United States since the days of colonial settlement.\nThe phrase \"In God We Trust\" has been an official statement of national faith since the Civil War and the official motto of the United States since 1956.\nIt remains just as essential today as the United States faces cultural upheaval with numerous signs that faith is waning, Pastor Jesse Bradley of Grace Community Church in Auburn, Washington, near Seattle, told Fox News Digital this week.\nWASHINGTON PASTOR ACKNOWLEDGES THE PAIN OF PUTDOWNS AGAINST THE CHRISTIAN FAITH: ‘ASK GOD FOR COURAGE’\n\"Abiding with God goes beyond and is more valuable than money, technology and entertainment,\" said Pastor Bradley, in a series of thoughtful comments when asked to tackle the state of America’s relationship with God.\n\"The soul of a nation is the core, the essence and the deepest part of a country,\" he said. \"Closeness with God is reflected and expressed in our relationships, the laws of the land, and morality. Real trust is essential in a vibrant relationship with the living God, not merely lip service.\"\nSurvey after survey, however, along with countless anecdotal examples, paint an unmistakable picture of an America growing less religious and more secular.\nThe United States, it appears, no longer trusts God.\nMany Americans and faith leaders believe the corresponding social decay, breakdowns of family, education, national heritage and basic science are the inevitable outfall of a society that’s lost its guiding light.\n\"Closeness with God is reflected and expressed in our relationships, the laws of the land, and morality.\" - Pastor Bradley\nTrust in God in recent decades appears to have been replaced by false idols of celebrity, technology and government.\n\"We have forsaken living water and created idols that can’t even hold water,\" said Pastor Bradley.\n\"America needs to come to her senses and realize the goodness of God.\"\nThere are numerous signs that individual welfare and social cohesion suffer as God becomes a part-time or non-existent guide in our lives and our nation.\n\"We can't compartmentalize God into one day, hour or place,\" said Pastor Bradley. \"This relationship with our Maker is 24-7, as God is the source of our strength, love, security and hope.\"\nMICHIGAN SIBLINGS REUNITE WITH THEIR 3-YEAR-OLD BROTHER AFTER HIS 6-MONTH HOSPITAL STAY FOR CANCER TREATMENT\n\"In God We Trust\" is not a uniquely Judeo-Christian American concept. Some form of it has been expressed by other cultures, nations and faiths throughout history.\nThe motto traces its roots to the Old Testament, the foundational text of Western Civilization.\n\"In God have I put my trust; I will not be afraid what man can do unto me,\" states Psalm 56:11. A substantially similar phrase appears in the Quran.\nHowever, trust in God became encoded in both America's foundational spirit and foundational documents.\n\"We are all equal before God. Religion does not make someone better than another person.\" — Pastor Bradley\n\"We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness,\" reads the first principal listed in the Declaration of Independence.\nFAITH DILEMMA IN FOCUS: ‘IT’S SUNDAY AND I HAVEN'T GONE TO CHURCH — WHAT DO I DO?'\nFaith in God in the United States was not just a statement of religious faith, but a declaration of national identity and human equality.\nGod, the Creator in this case, was non-denominational — which itself became essential the principal of religious freedom in the United States.\n\"The motto doesn't nullify the freedom to choose faith. Nothing is forced,\" said the pastor.\nNEW YORK VETERAN, 105, SHARES HER SECRET TO A FULFILLGN LIFE: FAITH, FAMILY AND ‘NO REGRETS’\n\"We are all equal before God. Religion does not make someone better than another person.\"\nThe Founding Fathers paved the way for a society that enjoyed both faith in a Creator and religious freedom.\nTrust in God, as the source of individual liberty and a defense against abuses of man, were bedrock beliefs among the Founding Fathers, regardless of individual philosophies.\nSome reports indicate that the phrase \"In God We Trust\" was used by Pennsylvania troops in the American Revolution and again by the state’s soldiers in the Civil War.\n\"Then conquer we must\/when our cause is just\/and this be our motto\/in God is our trust,\" Francis Scott Key wrote in the now largely unknown final stanza of the poem that became the National Anthem.\n\"I believe we are at a crossroads spiritually.\" — Pastor Bradley of Washington\nThe phrase first appeared on coins from the U.S. Mint in 1865 at the end of the Civil War.\n\"In God We Trust\" was added to paper currency in 1957, after it was made the official national motto.\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\n\"In God We Trust\" on currency has been deemed constitutional in numerous rulings by the Supreme Court and lower courts.\nThe U.S. Congress voted to reaffirm \"In God We Trust\" as the national motto by a bote of 396-6 in 2011.\nBut faith in God today clearly faces challenges — with society at large likely suffering.\n\"I believe we are at a crossroads spiritually,\" said Pastor Bradley.\n\"God knows us completely and loves us perfectly. It’s good to have trust written on our currency, but what really matters is that it is written on our hearts.\"\nCLICK HERE TO GET THE FOX NEWS APP\n\"We have wandered away from God in countless ways, including idolatry, materialism, pride and hatred.\"\nHe added, \"May God have mercy on us in spite of our rebellion.\"\n\nThis article was published by FOX News - Lifestyle on 2023-09-26 under the category 'entertainment'.\n\n","id":501}
{"title":"Emily Ratajkowski’s latest photo shoot sparks fury","context":"## Emily Ratajkowski’s latest photo shoot sparks fury\n\nStay ahead of the trend in fashion and beyond with our free weekly Lifestyle Edit newsletter Stay ahead of the trend in fashion and beyond with our free weekly Lifestyle Edit newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nLifestyle Edit email {{ #verifyErrors }} {{ message }} {{ \/verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ \/verifyErrors }}\nEmily Ratajkowski’s latest photo shoot has sparked backlash among plus-size models and activists, who claim it promotes unhealthy narratives about body image.\nThe supermodel, 32, recently shared several images from her photo shoot with M Le Monde magazine. For the fashion editorial photographed by Oliver Hadlee Pearch, Ratajkowski posed in a variety of looks featuring denim jeans and flowing tops. However, it was the second image that caught the attention of her Instagram followers.\nIn the photo, Ratajkowski is seen wearing a pair of low-rise, wide-leg denim jeans double her size. She showed off her toned figure as the oversized pair of jeans fell at her feet. As she held up the waistband of the jeans with one arm, Ratajkowski stood in one leg of the pair of jeans to highlight the noticeable size gap.\nThe photo shoot - which was styled by Charlotte Collet and creative directed by Jean-Baptiste Talbourdet-Napoleone - instantly sparked backlash after Ratajkowski shared the images to Instagram. In her comments section, thousands of users criticised both Ratajkowski and the team behind the photo shoot for the “out of touch” image and claimed the photo shoot was “fatphobic”.\nFamous plus-size models and inclusivity advocates - such as Tess Holliday, Kelly Augustine, Stephanie Yeboah, Letticia Munniz, and Sarah Chiwaya - have called out the photo for emphasising Ratajkowski’s thinness in a pair of pants that would typically be reserved for someone who is plus-size.\n“I’ve been looking for those jeans in the second photo if you could just please return them that would cool. Tysm,” Holliday commented under Ratajkowski’s post.\n“That second photo is such godforsaken trash,” wrote Chiwaya. “In the year of our lord 2023?? STILL??? Yikes.”\n“What in the fatphobic hell is that second picture?” a third user commented, while someone else said: “That second pic is so out of touch and ignorant but the comments are chef’s kiss.”\nPlus-size models have long advocated for more inclusive sizing - both in stores and on the runway. However, luxury brands and labels often avoid creating plus-size fashion over claims that it’s too expensive to make. “Designers won’t make plus sizes unless it’s for a photo opp where a thin person can be quirky,” another person pointed out.\nMany people were especially surprised by the “distasteful” photo shoot considering Ratajkowski has published a book of essays about feminist empowerment and the objectification of women’s bodies, titled My Body. “Not sure how you think wearing oversized jeans made for a much larger person and accentuating your smallness promotes healthy body image like you preach in your books\/social media,” an Instagram user said.\nSince she shared snaps from the photo shoot over the weekend, Ratajkowski has not yet commented on the backlash. Despite the controversial editorial, the model has previously spoken out against body-shaming. In her book of essays, Ratajkowski discusses bodily autonomy and exploitation in the modelling industry. “Every woman I know - doesn’t matter what they look like, or if they’ve commodified their image or not - knows what it feels like to be looked at, to be rejected, to get attention for how they look,” she told The Independent in 2021.\nBack in 2019, Ratajkowski defended her friend against body-shaming trolls after their bodies were compared on Instagram. The model shared a bikini-clad post to promote her swimwear line, Inamorata, but several users accused Ratajkowski of sharing the photograph to make her body look “better”.\nIn response, Ratajkowski commented: “I love my friend’s body and both her and I think she looks great here! And I’m proud she’s rocking my suits. All these haters are crazy. Just because you’re used to seeing one body type on the internet doesn’t mean that that’s the only kind that should be considered ‘beautiful’.”\nWhile the body positivity movement has made waves over the past 10 years, this year in fashion was especially devoid of inclusivity or plus size models. According to Vogue’s Business Size Inclusivity Report, only 0.6 per cent of looks shown throughout the autumn\/winter 2023 fashion season were modelled by plus-size people.\nDespite the fact that the plus-size clothing market is expected to reach $288bn this year, according to Future Market Insights, advocates have maintained that they’re unable to purchase clothing that’s both sustainable and inclusive. “I have to wear fast fashion and high street to major red carpet moments, and that’s great, but I want the option to wear high end items of my choosing and it’s not available,” Holliday told Elle UK in 2019. “But it’s either that or I run around naked. Plus-size fashion is not there yet.”\nThe Independent has contacted representatives for Ratajkowski and M Le Monde for comment.\n\nThis article, authored by Meredith Clark, was published by The Independent - Life and Style on 2023-11-30 under the category 'entertainment'.\n\n","id":502}
{"title":"Economists, central bankers are rethinking the quantitative easing strategy that saved the world but created bubbles and distortions","context":"## Economists, central bankers are rethinking the quantitative easing strategy that saved the world but created bubbles and distortions\n\nAfter the most aggressive monetary-tightening campaign in four decades, academics and economic practitioners are running autopsies on what could have prevented the cost-of-living crisis and how to ensure the same mistakes won’t be repeated.\nMarkets have scrambled to price in high-for-longer interest rates, with a new war in the Middle East adding yet more risk to an already uncertain outlook confronting central bankers as they gather for their penultimate meetings of a tumultuous year.\nThe policy navel-gazing is centering around three debates. How much flexibility central banks can allow in reaching their inflation targets, the effectiveness of asset purchases in the policy mix, and the merits of monetary and fiscal coordination.\nBloomberg surveyed economists from around the world to gather views on those three debates. Their verdict: Central banks won’t break their economies in a rush to hit inflation targets, QE will be used more sparingly in the future, and fiscal policy risks countering the work of monetary authorities.\nWhat Bloomberg Economics Says… “A long period of galloping price gains, and fears that the last yards back to target could be most painful for workers, have reignited the debate about whether central banks should aim for a higher rate of inflation. That’s a conversation worth having. But for monetary policymakers, the imperative of retaining credibility means the right time for it is after inflation is back at target, not before.” — Tom Orlik, chief economist\nRethinking Targets\nSo long as people believe prices will get back toward 2%, central bankers have some leeway in deciding how aggressive they need to be in pursuing that goal.\nEconomists covering 16 of the world’s most important central banks say policymakers will allow more time to bring inflation back to target if it means less damage to their economies. The Bloomberg special survey also shows that a sizable minority sees them going even further, accepting price pressures that are either slightly too strong or too weak — as long as expectations remain anchored.\nOlivier Blanchard, a former IMF chief economist, has long argued in favor of raising the inflation target, and former European Central Bank Vice President Vitor Constancio has also embraced the idea. But it’s a controversial view and only possible from a position of credibility, which means central banks would likely have to get inflation back to 2% first.\n“It would be a mistake of the first order to think you can change a goal you have set if you can’t achieve it,” according to Bundesbank President Joachim Nagel.\nGlobal trends suggest inflation will be stronger than in the past, with former Bank of England Governor Mark Carney among those saying rates won’t return to pre-pandemic lows.\nOne lesson Gita Gopinath, the IMF’s No. 2 official, draws from the latest inflation episode is that policymakers mustn’t assume that looking through supply shocks — as text books suggest — is the optimal response. She recommends they be ready to react preemptively, even when inflation hasn’t yet spun out of control.\nThey may be called into action soon on that front, should an escalation in the conflict in the Middle East hit oil deliveries.\nWhen the next big global slowdown comes, though, flexibility may be needed the other way. Europe’s eight-year experiment with negative rates ended with mixed reviews last summer as to whether it was all worth it.\nThe Bank for International Settlements argues that there’s room for greater tolerance for moderate shortfalls even if they’re persistent, because “low-inflation regimes, in contrast to high-inflation ones, have self-stabilizing properties.”\nRethinking Quantitative Easing\nWith a more flexible approach to those 2% targets, monetary policy after the 2008 financial crisis would have looked very different in many parts of the world. Trillions of dollars, euros, yen and pounds of asset purchases did little to raise prices in the face of global disinflationary forces until governments used the money they raised to stuff cash into consumers’ pockets during Covid lockdowns.\nBut that’s also been blamed for distorting financial markets. Episodes such as the Silicon Valley Bank blow-up are seen by some as a direct result of central bank reserves creation under QE, along with regulatory and supervision failures.\nOnly 40% of economists surveyed predict central banks will use QE the same way as they did before. A quarter expect them to deploy it more sparingly, about 30% see its only role going forward as a tool to address financial-stability concerns and a small minority doesn’t see it being used again at all.\nThere are other problems with bond-buying that may affect how it’s used in the future. QE effectively swaps long-term borrowing costs for short-term ones. What’s been a lucrative deal for taxpayers when official interest rates were low has now turned into a disastrous trade.\nThe clearest depiction of the problem is in the UK, where the BOE secured taxpayer indemnity for any losses on QE. Over the next decade, it estimates, its purchases will cost the government over £200 billion ($243 billion).\nAnd policymakers have little experience in unwinding their balance sheets, where small mistakes can trigger big market turbulence.\nThe Fed experienced some of that when it tried to shrink bond holdings between 2017 and 2019. More recent efforts to reduce portfolios have progressed rather smoothly, partially because central banks have amassed so much debt over the years that they’re far away from any thresholds that would trigger a squeeze.\nBut the fact that they’re treating quantitative tightening as a technical adjustment rather than a part of their efforts to conquer inflation raises questions about the future use of a tool that’s only trusted to work one way.\nThe ECB faces an extra legal burden on bond holdings that comes with operating in a currency union of 20 countries. Concerns around illegally financing governments and debt mutualization have already landed the central bank in court several times.\nMixing Policies\nLow interest rates and large-scale QE programs allowed treasuries to borrow on the cheap to finance stimulus campaigns, protecting labor markets, businesses and consumers from collapse. But the spending blowout throughout and since the pandemic — part critical emergency funding, part political need to show an all-hands-on-deck approach in crisis — contributed to the latest outbreak in inflation.\nWhile the same kind of pulling in the same direction is needed to restrain demand, many governments are concerned that if they tighten policy too hard, voters will kick them out and replace them with populists or extremists. That’s reviving questions about whether central banks can deliver price stability all on their own.\n“If we were designing optimal policy arrangements from scratch, monetary and fiscal policy would both have a role in managing the economic cycle and inflation, and that there would be close coordination,” Philip Lowe said in his last speech as Australian central bank governor in September.\nEconomists surveyed by Bloomberg predict fiscal policy will somewhat counteract the Fed’s efforts to rein in inflation in the US.\n“It’s true that there are circumstances where working hand in hand and supporting each other has proved helpful,” ECB President Christine Lagarde told a panel discussion in June at the institution’s annual economic forum.\nFed Chair Jerome Powell, who sat to her right, signaled he wasn’t ready to rely on that kind of cooperation. “Our assignment is to deliver price stability kind of regardless of the stance of fiscal policy.”\nCentral bankers warn that any failure to scale back fiscal spending risks coming at the cost of yet higher interest rates. They also want elected officials to put in place policies that help deliver sustainable growth.\n“A change in mindset needs to happen,” said Agustin Carstens, the former governor of the Bank of Mexico who’s now the general manager of the BIS. “Growth needs to depend less on fiscal and monetary policy, it should depend more on structural policies.”\n\nThis article, authored by Jana Randow, Bloomberg, was published by Fortune on 2023-10-22 under the category 'business'.\n\n","id":503}
{"title":"Michigan’s Rivals Fume About Sign-Stealing: ‘This Was Damn Near Espionage’","context":"## Michigan’s Rivals Fume About Sign-Stealing: ‘This Was Damn Near Espionage’\n\nFor the past two weeks, coaches across college football have been riveted by the alleged Michigan sign-stealing scheme, but inside the Big Ten, the topic has been more than just a curiosity. On Wednesday’s Big Ten coaches video call with commissioner Tony Petitti, and after Jim Harbaugh left the call, that frustration was voiced loud and clear, according to conference coaches, who said they don’t feel like the new Big Ten commissioner is “motivated” to do anything about the Wolverines.\nAdvertisement\n“There is just a ton of frustration,” a Big Ten coach told The Athletic on Thursday morning. “Look at Jim Harbaugh’s record before this started. The guy was on the hot seat before 2021, and now he’s like the king of college football. … No doubt this all has had a profound effect.\n“This guy’s being investigated for three different things now between the (alleged) illegal signal stealing, the (alleged) illegal recruiting during COVID and that investigation into the offensive coordinator and alleged computer hacking. There are guys (on that call) who could lose jobs, and then there’s this guy over here (Harbaugh) who is gonna get a new, bigger contract now, and they won’t do anything about him.”\nAsked to describe the tone of the coaches’ sentiment expressed to Petitti, another Big Ten coach called it “angry” — particularly at the Big Ten’s lack of action, or even apparent interest in taking any.\n“Everybody’s upset,” that coach told The Athletic. “Why is nothing being done? We want to know, what else do you need to know to take action? We (the Big Ten head coaches) want something done now. I don’t think people understand the advantage that what they’re (allegedly) doing gives you. People think, ‘OK, now that everybody knows, we all can just move on.’ Like, ‘now, it’s fair.’ Well, no, it isn’t. Not at all. This changes the way you operate. A lot of teams have been doing things a certain way for years. Now, it’s forcing you to teach your players a whole new way to communicate just for them. People think that this is just advanced scouting. This was damn near espionage.”\nA third Big Ten head coach told The Athletic that this is “one of the most egregious breaches in the spirit of the game” he’s ever heard of.\n“They (Michigan) have been manipulating the game and cheating the game for two-and-a-half years. To know exactly what the other team is doing, Michigan might as well have been playing with 15 guys on the field,” he said. “What’s the message the Big Ten is sending now by doing nothing? Win now, pay later? We might as well just send people to (scout) their practices and their games. It doesn’t encourage anybody to follow the rules. It’s just telling them to do the opposite and say, f— it.”\nGO DEEPER Michigan should be punished, say 94% of CFB coaches in our poll. What else did it reveal?\nThe NCAA is investigating Michigan’s football program amid allegations that the Wolverines used illegal in-person scouting and the recording of signals to steal signs this season. Ahead of the Michigan-Michigan State game on Oct. 21, the Big Ten approached MSU and said it was made aware of “credible evidence” regarding the sign-stealing allegations. The Big Ten said it would monitor the NCAA’s investigation into Michigan.\nAdvertisement\n“The Big Ten is so much more powerful than the NCAA,” that third Big Ten coach said. “Why are you just sitting back and doing nothing about this? The Big Ten can’t pound its chest for the last 30 years about how it does the right thing ethically (when other conferences like the SEC won’t) and then have this go on. If this were a team in the bottom half of the Big Ten, would this be handled in the same way?\n“When a running back gets hurt against Michigan because they knew exactly what play was coming, will that kid and his family have the ability to sue the Big Ten?”\nThe NCAA investigation is ongoing, a process that typically moves slowly, which makes it difficult to imagine it will reach a resolution by the time the postseason begins. The Big Ten does have the ability to act under its sportsmanship policy, but that doesn’t mean that it would want to act quickly or decisively before the NCAA completes its entire investigation and allows Michigan a chance to respond to its findings.\nThis is an unprecedented situation; whatever Petitti decides to do (or not do) will set a precedent. The Big Ten itself doesn’t have investigators, so it needs to rely upon the NCAA to do that part — and to determine who else was involved in the alleged scouting scheme. It’s not clear exactly what the coaches would want the league to do to punish Michigan; banning the team from competing in the Big Ten championship, for example, would harm players who had nothing to do with the sign-stealing apparatus.\nA source briefed on the coaches’ call said Big Ten coaches are concerned about whether Michigan “should represent the Big Ten.”\n“No matter what happens, if Michigan continues to move forward, the clouds will follow,” the source said. “They’re reading the tea leaves and wondering why the Big Ten hasn’t done anything yet. Every week and every day that goes by, people are like, ‘Something’s gotta give.’ It’s getting a little bit out of hand when you see him (allegedly) on the Central Michigan sideline. The playing field is not level right now. How can you have a team that you know has a competitive advantage over you still being allowed to play? That’s what the coaches are grappling with.”\nAdvertisement\n“It feels like (former commissioner) Kevin (Warren) taking over and then COVID,” the source continued. “Tony’s walking into this situation, and people are calling for the league to make a statement before they have all the facts.”\nDespite frustration from all corners of the conference, sources at four different Big Ten schools said they do not expect the conference to levy any sort of punishment against Michigan before the season ends.\nEarlier this week, Central Michigan said it is investigating whether suspended Michigan staffer Connor Stalions was on the CMU sideline during the Chippewas’ Sept. 1 game at Michigan State. Screenshots of a person who looks similar to Stalions began circulating online Monday night, and The Athletic obtained more photos of the person on the sideline Tuesday.\nCentral Michigan is investigating if the person on the right here is Connor Stalions on the CMU sideline at Michigan State earlier this season. AD Amy Folan: “We became aware of these photos late yesterday and we are in the process of determining the facts surrounding them.\" pic.twitter.com\/ncazAghBbS — Chris Vannini (@ChrisVannini) October 31, 2023\nStalions, who was suspended with pay by Michigan on Oct. 20, is at the center of the NCAA’s investigation into the alleged scouting and sign-stealing scheme. Stalions bought tickets to games in at least seven Big Ten stadiums before those teams played the Wolverines over the past three seasons, including the 2023 season, sources told The Athletic last month. Purchasing the tickets is not a violation of NCAA rules, but using them to scout and record other teams would violate the rules, prohibiting in-person, on-campus scouting and the audio or video recording of signals.\n“They aren’t allegations. It happened,” Purdue coach Ryan Walters said Thursday night on his radio show ahead of Saturday’s game against the Wolverines. “There’s video evidence. There’s ticket purchases and sales you can track back. We know for a fact they were at a number of our games. We’ve had to teach our guys a new language.”\nOn Monday, coach Jim Harbaugh met with reporters and said “the people that know us the most think the most of us” as Michigan faces the NCAA investigation. He has denied knowledge of the alleged scouting.\nGO DEEPER Ten thoughts on the Big Ten's 2024 schedule\nRequired reading\n(Photo: David Berding \/ Getty Images)\n\nThis article, authored by The New York Times, was published by The New York Times on 2023-11-03 under the category 'sports'.\n\n","id":504}
{"title":"Discord’s latest teen safety blitz starts with content filters and automated warnings","context":"## Discord’s latest teen safety blitz starts with content filters and automated warnings\n\nDiscord is introducing new safeguards to protect young users. On Thursday, the company announced Teen Safety Assist. The rollout will happen in the coming weeks and consists of two features: Automated alerts and content filters.\nMoving forward, when a user a teen hasn’t chatted with before sends a direct message, Discord will display a safety alert if the platform’s automated systems suspect the teen’s safety could be at risk. The prompt will nudge the young person to reconsider if they want to respond to the message, and point them to the app’s block feature and related safety tips.\nBy default, Discord will now also automatically blur potentially sensitive images from a teen’s friends. Young people can disable the feature through an option in Discord’s settings menu. Adults, meanwhile, can enable the filters for themselves, if they want the additional protections.\nThe introduction of Teen Safety Assist comes amid increased scrutiny of Discord’s efforts to limit the spread of child sexual abuse material (CSAM) and protect young users from predatory adults. In June, NBC News identified 35 cases over a period of six years where adults had allegedly used the platform to kidnap, groom or sexually assault minors. The outlet also found 165 cases where authorities were prosecuting adults for sharing CSAM over Discord or allegedly using the platform to extort young users into sending sexual images of themselves.\nIn the aftermath of the report, Discord banned teen dating servers and changed its safety policies to ban the sharing of AI-generated CSAM. It also announced new rules explicitly prohibiting any other kind of text or media content that sexualizes children. At the same time, the company introduced Family Center, a dashboard for parents and guardians to keep track of what their teens are doing on Discord.\nDiscord\n“Teens are still in the process of learning about themselves and what it means to be online, and our new safety features are rooted in providing them with agency on the platform, to give them ways to learn and grow in safe and age-appropriate online spaces,” said Savannah Badalich, senior director of policy at Discord. “These newest features are part of an ongoing, multi-year effort to continually evolve and advance safety on Discord.”\nAt the same time, Discord is introducing a new warning system for people who violate its policies. Outside of incidents involving the most “extreme” violations, the company is moving away from permanent bans. It’s doing so under the belief that most users will choose to be better online citizens given the chance and proper guidance.\nIn practice, the system will notify a person when they’ve violated one or more of Discord’s policies and detail the restrictions on their account. It will also link out to the company’s Terms of Service, Community Guidelines and appeal mechanism. A new “Account Standing” tab within the settings menu will allow users to see all their current and past policy violations.\n“We think we’ve built the most nuanced and proportionate reporting system,” Badalich told Engadget, adding the company hopes other platforms will look to what Discord has created for inspiration related to their own enforcement efforts. “We believe people, especially teens, have the capacity to grow.”\nSeparately, Discord announced a slew of new features and enhancements slated to arrive either in the near future or down the line. To start, the platform’s in-app shop, which Discord began testing last month with Nitro subscribers, will soon be available to all users. The marketplace features digital items people can use to decorate their avatars and profiles. Discord will offer store discounts to Nitro members, as part of a new perk for signing up.\nDiscord\nThis week, the company will also start a broad roll-out of a feature called Remix. It allows users to edit an image directly within Discord’s mobile app and share it with their friends and servers. The company spent much of the last year improving its Android and iOS clients. One recent update saw it improve app launch times on both platforms. In the near future, Discord says people can expect a new “Midnight” dark mode the company claims reduces battery consumption on devices with OLED screens, more functional notification tabs and a new search feature for the settings menu to make it easier to find the exact option you’re looking to tweak.\nLast but not least, the company says it will begin rolling out Premium App Subscriptions to eligible developers in the UK and Europe, following a launch that began in the US a few weeks ago. On the subject of third-party apps, bots and plugins, the company said it’s in the process of exploring how to make those accessible across nearly every part of Discord. It provided few details on the effort, but said the goal is to allow people to access their favorite apps and bots without those experiences being restricted to select servers.\n“We're experimenting with a few different things, but the goal is for developers to reach more people with the awesome experience they're building. For users, we don’t want them to be gated from having these custom experiences at their fingertips,” Cherry Park, director of product marketing at Discord, told Engadget. “In terms of the way we architecture and build it, there are a couple of solutions. Some are easier, some are more difficult, and you're going to see us experiment with a few of them over the next few quarters.”\nDiscord promised to share more about its efforts around app portability in the near future. In the meantime, Nitro subscribers will get a chance to test new features before they become available to the public.\nUpdate, October 20, 2023, 11:20 AM ET: This story has been updated to note that these feature are rolling out in the coming weeks, not this week as the post originally said. We also removed a mention that Discord would automatically delete potentially sensitive content from strangers. This was originally part of a briefing we received on the new features, but it was not included in the final release.\n\nThis article, authored by Igor Bonifacic, was published by Engadget on 2023-10-19 under the category 'technology'.\n\n","id":505}
{"title":"The airline parts scandal sparking panic and introspection in aerospace","context":"## The airline parts scandal sparking panic and introspection in aerospace\n\nHis company is accused of falsifying the records that come with aviation components to show they are the real deal. CFM, a joint venture between GE and Safran that manufactures engines, is now pursuing a legal case against AOG in Britain’s High Court. Zamora is defending the case. Verification documents are important because of the exacting specifications of airline parts. Engine modules must tolerate temperatures that would melt many materials and even basic parts must be certified. Because of these demands, even a bolt can cost thousands of dollars if it is holding an engine in place. As a result, the market for airline parts is a very lucrative one. Since 2015, Zamora has charmed his way deep into the complex network of companies and decision makers who move billions of dollars worth of airline parts around the world.\nBusiness associates who worked with him outside AOG and who were willing to speak to The Telegraph describe a savvy operator who was fun to be around. Loading Zamora, who is Venezuelan, got his start in aviation in 2010 as an account manager at AJW, an engine maintenance business, according to Bloomberg. A keen techno DJ, he was also gigging as recently as 2018 according to the Daily Mail. Zamora founded AOG in 2015 from a rented terraced house in Hove, about 70 kilometres south of London on the UK’s South Coast.\nIt appeared to be small scale in its early years: the company’s registered address moved between four homes in the following three years, shifting from Hove to London in 2017. Then, the company was registered at serviced offices in central London. Friends say they haven’t been in contact with Zamora in a number of months as he begins his defence in London’s High Court. AOG’s website appears offline, but a cached version says the company offered “a diverse portfolio of quality products and services”. “With our head office in the UK and warehouse operations in London, Frankfurt, Miami and Singapore, we are uniquely positioned to support our customers around the world – 24 hours a day, 365 days a year,” the website read. “We keep our clients flying.” The company’s phone line is still connected but offers only endless hold music.\nAOG is understood to have sold mainly smaller parts for jet engines, such as bolts, nuts, washers, dampers and seals. The parts don’t carry a serial number and are therefore harder to trace. Worryingly, some bigger parts appear to be linked to the scandal. Some turbine blades have also been identified by CFM as suspect. CFM is understood to believe that AOG had been passing off old parts for new ones. Steve Borrowdale, managing director at Multiflight, a Leeds-based engineer and parts supplier, says sneaking parts into a jet engine is difficult. After vetting a seller for experience and approval certification, a buyer would also carefully inspect a part from a new supplier.\n“You get the box, you’d have a look, just for simple things. If there’s a brand-new part coming in a non-identified box, you might start to question it.” Choosing parts without serial numbers could make falsifying documents easier, he said, but it would still take great skill. The supply of parts in aviation is through a dazzling patchwork of thousands of often small manufacturers, brokers and distributors. Credit: Bloomberg “You couldn’t just take a novice off the street and start selling these things, you would have to have gotten some training somewhere along the way.” According to filings at Companies House, AOG grew slowly from 2015 until 2019, when the company had net assets of £22,000 ($42,000).\nBy early 2020, it was worth £2.2 million. A breakthrough came when it won a deal with logistics firm B&H Worldwide to distribute parts from its hub in Frankfurt. “The two companies have previously worked together for exports to Europe and the US from the UK, but this is the first time they have partnered in mainland Europe,” the pair said in a press release in 2020. AOG’s cash bonanza came before the COVID-19 lockdowns of that year, according to the filings. The pandemic grounded flights and was a disaster for the aviation industry. However, the end of lockdowns triggered a resurgence in international travel and a rush to secure jets and parts amid backlogs in factories. The parts scramble that followed would be a perfect breeding ground for an unscrupulous seller, said Borrowdale.\n“Since COVID, raw materials are increasingly difficult to get hold of,” he said. The supply of parts in aviation is through a dazzling patchwork of thousands of often small manufacturers, brokers and distributors. Manufacturers and operators are heavily regulated and largely responsible for orchestrating the paper trail that follows every aviation part, from computers and fuselage panels to screw housings and washers. CFM has had to audit more than 500 suppliers to try and find out what items could be caught up in the crisis. The parts so far identified in the forgery scandal are not thought to include the most sensitive components, known as life-limited parts, which operate under the most stress in a jet engine and are carefully monitored by manufacturers while operating on the plane. However, even dodgy fastenings have claimed lives.\nPartnair Flight 394 crashed off the coast of Denmark in September 1989, killing all 55 passengers and crew, after its tail fin came off. Three of the four bolts holding the fin in place were counterfeit and weaker than those designed for the plane. The weak bolts and other maintenance problems allowed vibrations that caused the rudder to fail and break off, investigators later found. Loading Following that incident and other bogus parts scandals, Mary Schiavo, who was inspector general at the US Department of Transportation in the early 1990s, ran a campaign against the sale of unapproved aircraft parts and helped secure more than a hundred criminal convictions. She uncovered bogus components that had been made by manufacturers that had lost their certification to make the parts, old equipment passed off as new, re-labelled defective parts and outright fakes that were never designed for aviation use. These are largely the categories into which bad parts still fall, she says. Unapproved parts were even found in part of a fire control system on Air Force One in 1995, she said.\n“Literally, if it’s on an aeroplane, it could be fake.” Following her investigation, various reforms came in, including a warning system to flag suspicious components. “I’ve had cases where counterfeit parts have caused deaths. What’s at stake is the safety of the lives of the flying public.” While plane and engine manufacturers, pilots and aviation companies are heavily regulated, distributors are not, she warns. She pushed for tighter rules in the 1990s but was ignored. The High Court case against AOG began on September 21 and is ongoing.\nThe UK’s Civil Aviation Authority has said it is supporting the US Federal Aviation Administration and European Aviation Safety Agency in investigating the matter. A spokesman for CFM said: “We are working collaboratively with operators, so they can promptly remove the unauthorised parts from their engines in accordance with the recommendations issued by the regulatory agencies. “We remain united with the aviation community in working to keep unapproved parts out of the global supply chain.” B&H was approached for comment. Zamora was approached for comment through friends and his barrister. The Telegraph, UK\n\nThis article, authored by Howard Mustoe, was published by The Sydney Morning Herald on 2023-10-16 under the category 'business'.\n\n","id":506}
{"title":"Flipboard becomes a federated app with support for ActivityPub","context":"## Flipboard becomes a federated app with support for ActivityPub\n\nInstagram Threads isn’t the only app joining the decentralized social web, which includes Twitter\/X rival Mastodon and other apps, with its newly added support for the networking protocol ActivityPub. Today, the social magazine app Flipboard is announcing it has also now integrated with ActityPub. In its initial phase, select Flipboard accounts will be discoverable and can be followed by the millions of users of decentralized social apps, including Mastodon. Over time, all profiles on Flipboard will be available in the fediverse, as this network of decentralized social apps is known.\nThe company announced its intention earlier this year to participate in the fediverse. It began by integrating its app with Mastodon via an API and setting up its own Mastodon server, flipboard.social, ahead of full ActivityPub integration. This allowed Flipboard to get a feel for the world of decentralized social media, and learn how its users would respond. It also gave Flipboard a way to stay connected to social media after Twitter\/X increased its API fees for third-party developers, making it unsustainable for many developers to continue to work with the company.\nThe Flipboard app’s primary purpose has been to curate into social “magazines” news and information found on the web, including links to articles, photos and other social posts. As a result, it had relied on Twitter as one of its sources of information. That changed this year, when Flipboard shifted its Twitter integration over to Mastodon and another alternative social app, Bluesky. It also set up its own Mastodon server and began curating news across the fediverse via editorial “desks” focused on improving the discovery of news on Mastodon.\nAll this was in the lead-up to making Flipboard itself a federated social app, a process that’s kicking off today.\nInitially, Flipboard is testing the integration with select accounts, including publishers like Semafor, Pitchfork, Fast Company, Medium, LGBTQ Nation, Refinery 29, Digiday, Polygon, SPIN, Kotaku, Frommer’s, The Verge, Smithsonian Magazine, Refinery 29, The Root, ScienceAlert, AFAR Media and others. While many are focused on news, there are also some nonprofits like The News Literacy Project and education-focused news site The 74, in this debut list.\n“As we said in the earlier part of this year, we will be embracing ActivityPub into Flipboard and effectively reworking our whole backend to that,” explained Flipboard CEO Mike McCue, in a conversation with TechCrunch about the coming changes. He says the company had first integrated with Mastodon at the API level, so users could log into their Mastodon accounts, see those posts and interact with others in the fediverse from Flipboard. “But you had to have an account on all those platforms,” McCue noted.\n“What we’re announcing on Monday is basically our roadmap for how we will be rolling out ActivityPub, and effectively tearing down the walls around our own walled garden,” he added.\nWith the changes, when Flipboard users curate an article or post into one of their social magazines on Flipboard’s app, with an optional comment, that “flip,” as it’s called, will also appear as a post on their new flipboard.com Mastodon account. This is not the same server as Flipboard had set up before (flipboard.social), which was a place to experiment with decentralized social media. Instead, it’s the Flipboard app itself that’s now connected to the fediverse. Users’ posts on Mastodon will include a link both to the article being flipped and to the user’s Flipboard magazine, while the user profile will point to their Flipboard profile page.\nAs this rolls out, all Flipboard users will have one Flipboard.com account connected to the fediverse, even if they host numerous Flipboard magazines. That’s not ideal as their magazines may focus on different topics. But McCue believes that Mastodon could one day support a notion of sub-feeds that would allow more differentiation.\nUsers will be able to opt out of having their “flips” posted on Mastodon, but being opted-in will be the default experience. The company expects to have all its user accounts connected to the fediverse by the end of January. (This won’t impact any magazines set to “private” on Flipboard. Those will remain private, McCue notes.)\nToday, Flipboard has over 10,000 publishers of social magazines on its app and over a quarter million individuals who are curating content using Flipboard’s app. Given that Mastodon today has around 1.5 million monthly active users, this could be a notable bump for the fediverse when Flipboard’s integration fully rolls out, assuming Flipboard’s users don’t opt out.\nFlipboard is only one of now several companies that has embraced decentralized social media. In addition to X rival Instagram Threads, which began testing ActivityPub last week, other tech companies are moving in this direction, as well. Automattic made it possible for all WordPress.org and WordPress.com blogs to become federated, and said it’s working on doing the same with Tumblr next year. Medium and Mozilla have also set up their own servers, and the latter backed a Mastodon client called Mammoth, too.\nFor Flipboard, after integrating its back end with the fediverse, the company may reconsider what its front end should look like, too, for this new age of social media.\n“The front end was built at a time pre-federation,” noted McCue. “What are the implications of federation in the front end? How do we think about curation and all the things, all the capabilities and tools that we’ve created over the years? How does that work in a world that’s federated, and from a user experience point of view? That is a great question,” he said.\nDespite all the changes, Flipboard is not in need of raising funds to support its new developments. It’s running off the profits of its own business as it moves in this direction.\nThe company is also betting on the fact that federated social media may only be the beginning of what’s to come for the web overall.\n“I saw what was happening with ActivityPub and it became very clear to me that this is the future of the web, period,” McCue said. “The social web is people linking to pages and people linking to people. So it’s a much more intricate web.”\nHe sees Flipboard as a part of that opportunity. “There needs to be a way to do discovery and search and have it be beautiful and simple and easy to use. That is what we’re focused on,” McCue added.\n\nThis article, authored by Sarah Perez, was published by TechCrunch on 2023-12-18 under the category 'technology'.\n\n","id":507}
{"title":"2023 in social media: the case for the fediverse","context":"## 2023 in social media: the case for the fediverse\n\nThere’s this picture from more than a decade ago that still goes viral on the web every once in a while. You’ve probably seen it: it was created by the venture capitalist Andrew Parker, and it compares a few dozen startups with subsections of Craigslist. Back then, Craigslist was all things to all people online, and a generation of startups figured they could do part of the job a lot better.\nSome of those companies failed — sometimes because of Craigslist! — but some also became gigantically successful. Airbnb worked because it was more searchable, reliable, and trustworthy than a random Craigslist listing; StubHub sold you secondhand tickets without the 50 percent chance those tickets were fake; Etsy offered a much more fun shopping and discovery experience than a bunch of text listings and crappy photos.\nFor a decade, startups tried to unbundle Craigslist. Now they can do the same for social networks. Image: Andrew Parker\nThis is the same opportunity in front of the social media landscape right now: a rare chance to unbundle the internet, to pull apart an existing system and rebuild it, piece by piece, in vastly better ways. If we do this correctly — if the next phase of how we congregate and communicate online is built for humans and not advertisers — there won’t be a new titanic company to rival Meta or a platform with eye-poppingly huge numbers like Facebook. What we’ll get instead is something much bigger: an entirely new infrastructure for our online lives that no company or platform controls.\nThe reason this suddenly feels possible is the emergence of the fediverse. In a sentence, the fediverse is an interconnected set of apps that can all read and write the same content. Decentralized social media is often compared to email, in that you don’t have to compose, organize, and read your messages all in the same app, and you and I don’t have to use the same tools to communicate. Email apps can have different interfaces, different privacy policies, even wildly different ideas about what email is for. Every app knows what an email address is, and every email address can talk to every other.\nThe point is that email is just data, and lots of apps can understand and manipulate it. When Meta’s Adam Mosseri posts on Threads and you see it on Mastodon, that’s the fediverse at work. If you post on Mastodon and I see it in my Pixelfed feed, that’s fediverse too. When I comment on your Flipboard post and it shows up as a reply in the Mastodon feed you check through the Mammoth app? Pure fediverse, baby.\nI’m convinced we’ll be better off with a hundred different apps for Snapchat or Instagram or X instead of just one\nI’m convinced we’ll be better off with a hundred different apps for Snapchat or Instagram or X instead of just one, a dozen companies competing to build the best moderation tools, and an app store filled with different ways for me to follow and be followed by other people on the internet. It doesn’t make sense that we have a dozen usernames, a dozen profiles, a dozen sets of fans and friends. All that stuff should belong to me, and I should be able to access it and interact with it anywhere and everywhere.\nThe infrastructure underlying all of this is typically ActivityPub, a decade-old protocol overseen by the World Wide Web Consortium (also known as the group more or less in charge of how the internet works). There are other similar protocols as well, like Bluesky’s AT Protocol and Nostr and Farcaster. I’d bet heavily that ActivityPub becomes the default choice over time, but ultimately, it doesn’t matter so much which protocol wins as long as one of them does. We don’t need two internets, and we don’t need two social protocols. We need one thing that is both simple enough and big enough to handle all the ways we connect with each other online. No centralized platform has ever been big enough. The fediverse can be.\nMastodon is the biggest thing in the fediverse so far, but it may not be for long. Image: Mastodon\nDecentralizing social media can sound like a sort of kumbaya anti-capitalist manifesto: “It’s about openness and sharing, not capitalism, man!” In practice it’s the opposite: it’s a truly free market approach to social networking. Mastodon may not be interested in becoming a trillion-dollar company, but there’s no reason there can’t be plenty of those built on the fediverse. It’s just that in a fediverse-dominated world, the way to win is not to achieve excellent lock-in and network effects. The only way to win is to build the best product.\nThis is really not a particularly hot take, by the way. Even the most successful centralized platforms have long understood that a protocol-driven social web is a good idea. Jack Dorsey used to say that Twitter was better as a protocol than a platform, and started the project that became Bluesky before also helping get Nostr going. (We really don’t need to get into the whole story of what happened to Twitter since then, except to say that the speed with which that platform changed made a lot of people acutely aware that we need a social ecosystem that can resist the whims of a single company or CEO.)\nMeanwhile, Meta CEO Mark Zuckerberg seems to earnestly believe that bringing Threads to the fediverse is a good idea, both for its product and for its business. “Not everyone wants to use one product,” he said to my colleague Alex Heath earlier this fall, “and I think making it so that they can use an alternative but can still interact with people on the network will make it so that that product also is more valuable.” Mark Zuckerberg! Said that! He understands that people want to feel like their social connections and content belong to them, not to a company that can disappear or pivot or change its ways. And let’s be real: if Meta can’t build and maintain the One True Social Network For Everybody, nobody can. It’s well past time to try something else.\nThe only way to see your Facebook posts is to sign up for Facebook’s rules, Facebook’s aesthetic, Facebook’s features, Facebook’s moderation, Facebook’s algorithm, and Facebook’s business model.\nRight now, every social platform is a universe unto itself. The only way to see your Facebook posts is to sign up for Facebook’s rules, Facebook’s aesthetic, Facebook’s features, Facebook’s moderation, Facebook’s algorithm, and Facebook’s business model. That’s not just a bad user experience, it’s a ridiculous way to run a company. Facebook has to invent and maintain all these things, just as every one of its competitors does. It’s an impossible task but just as impossible to compete with; you can’t build social products without building an entire social graph from scratch, and good luck with that.\nIn a fediverse world, rather than try to build another all-encompassing Facebook from scratch, an enterprising developer can pick one or a few of its features and try to do better. Users can pick their favorite app — or two, or two hundred — through which to get their posts. Because everything is based on one set of posts and an open network of friends and followers, new social products can be useful even if you’re the very first user.\nImage: W3C\nIn the world of ActivityPub, every post everywhere is made up of a sender, a message, and a URL. Every user has an inbox and an outbox for those messages. That’s the whole protocol in a nutshell. The simplicity is the point: since ActivityPub is not a product but a data format like PDF or JPG, what you do with those messages, those URLs, those inboxes and outboxes, is entirely up to you.\nYou could have a Twitter-like app that emphasizes text, or an Instagram-like one with a UI that shows photos first. Your federated YouTube could be full of everybody’s videos, or you could make TikTok by filtering only for short and vertical ones. You could use a WhatsApp-style messaging app that only cares about messages sent directly to someone’s inbox.\nYou could try to do all those things, or you could try to do something nobody’s ever been able to do before. You could build a news reader that only includes posts with links to news sites and automatically loads those links in a nice reading interface. You could build a content moderation tool that any fediverse app could use to filter and manage content on their platform. You could build the perfect algorithm that only up-ranks shitposts and good jokes, and license that algorithm to any app that wants a “Epic Posts Only” mode. You could build an app that’s just an endless feed of great stuff for NBA fans. You could build one that’s just for crypto true believers. You could build one that lets you swipe from one to the other depending on your mood.\nThere are already a few platforms built on ActivityPub and embracing the ideas of the fediverse. Apps like Mammoth and Ivory are showing the potential for different user experiences on top of the same data and infrastructure. But so far we’re mostly in the “popular app, but federated” phase of this transition. (Which is definitely better than “popular app, but blockchain” from a couple of years ago… but not by much.)\nSo far we’re mostly in the “popular app, but federated” phase of this transition\nMastodon deliberately looks and feels like Twitter. (So do Firefish and Pleroma and GoToSocial and others. The fediverse is super into replacing Twitter.) Pixelfed is Instagram through and through. Lemmy’s features are virtually all ripped straight from Reddit. Almost everything in the fediverse is a one-to-one competitor to an existing platform: PeerTube to YouTube; Friendica to Facebook; BookWyrm to Goodreads; on and on it goes. Some of these apps are very good! But nearly all of them are differentiated only in that they’re federated.\nLet’s be super clear about this: the point of the fediverse is not that it’s federated. The most consistent argument against the long-term viability of platforms like Mastodon is that most people don’t give a hoot about the underlying protocols and infrastructure of their apps and just want things to be easy, reliable, and useful. That is absolutely, unequivocally true. Making the “It’s federated!” argument is like making the “It’s better for privacy!” argument: it makes you feel good, and at best it’s a useful tiebreaker, but it doesn’t actually matter. All that matters is the product.\nThe best thing about the fediverse is that it will actually enable an explosion of better social products, for lots of reasons but one in particular: it allows for so many more of them. Forget the hand-wavy protocol stuff for a second — one of the best things about embracing ActivityPub is that it sticks a crowbar into a single Voltron-ic product like Facebook or Twitter or Snapchat and pries it apart into its component pieces, each one ripe for innovation and new ideas.\nWe’re still in the very early days of the fediverse, and it’s going to be messy for a while. It might feel like you’re seeing the same posts too many times, and like you see some posts that obviously weren’t meant to be seen in the app or feed you’re using. Some particularly thirsty influencers are going to go hard on cross-posting tools that threaten to clutter up all your feeds everywhere and become totally unavoidable. This is not a problem with the protocols; it’s an opportunity for better products. There’s plenty of money to be made in the fediverse, and plenty of space for new products to take off.\n\nThis article, authored by David Pierce, was published by The Verge on 2023-12-19 under the category 'technology'.\n\n","id":508}
{"title":"The new American Dream is to get MrBeast to pay off your debt","context":"## The new American Dream is to get MrBeast to pay off your debt\n\nA woman in a blue tracksuit is on the floor of a bright asylum-like room, stretching in a pigeon yoga pose when she turns to the stranger she plans to live with for 100 days.\n“What are you going to do with this money?” she asks. The two contestants in MrBeast’s newest video, Suzie Taylor and Bailey Stanfield, have been cohabitating for nearly three weeks at this point, isolated from the rest of the world. They only eat canned food, and all they have to entertain themselves is a deck of cards that they made themselves.\n“I was probably going to pay a lot on the house,” Bailey replies. He’s sitting in his bed, where he’s made a canopy with a sheet to keep the light out, since the bright lights never turn off. Stacks of dollar bills lie atop his canopy, and he’s surrounded by 15 more briefcases filled with money, which he will only get if he can stick this out for another few months.\n“I want to pay off my parents’ debt,” Suzie says. “That would be like, my ideal world.”\nTaylor and Stanfield successfully completed the challenge, winning $185,000 each. But what’s intriguing about their reality TV-like experience is that this trade-off has become a new normal on social media. If you agree to suffer for content, you might just be able to pay off your parents’ debt.\nThe most successful YouTuber in the world, MrBeast, is known for his expensive stunts. Four years ago, this meant paying people $10,000 to eat a ghost pepper, giving someone $100,000 to spend in one hour, or offering a stranger $100,000 to quit their job. With each video, MrBeast’s challenges have become a bit more diabolical, pushing contestants’ physical and mental fortitude to their limits. Now, starring in one of his videos means surviving in a locked room with a stranger for over three months, or living in a grocery store.\nA 25-year-old named Jimmy Donaldson, aka MrBeast, must constantly up the ante in every video to keep his massive audience entertained. Oftentimes, MrBeast is the one putting himself in these nightmarish situations, like when he buried himself alive for seven days (and while he was 10 feet underground in a coffin, he celebrated hitting the milestone of 200 million YouTube subscribers). But his contestants’ goals have remained the same since the beginning. Americans are so saddled with debt — medical bills, student loans, mortgages, credit card interest — that it seems like the only way out is to sign up for a massively unpleasant YouTube stunt.\nOne of the 100 contestants in a video called “Last To Leave Circle Wins $500,000” cried when she earned a consolation prize of a few thousand dollars.\n“This is going to change my life,” she said tearfully. “I’m going to take a lot of this to pay my bills.”\nAnd Alex, the man who lived in a grocery store for 45 days, said he would set aside $60,000 of his winnings to pay off debt, $130,000 for his house and $60,000 for his two kids’ college fund.\n“Money is the thing we’d trade our life for,” said contestant Shawn Hendrix in one MrBeast video, in which he lived in a giant circle in the middle of nowhere for 100 days, away from his wife and four children. “I’ve given up a third of a year of my life for half a million. Make sure you’re trading your life for things that are worth it.”\nThe situation is oddly reminiscent of “Squid Game,” the Netflix series about 456 contestants who are so deeply in debt that they agree to fight to the death for the chance to win millions of dollars, all while the wealthy elite watch for sport. And, to be extremely on the nose, MrBeast created his very own Squid Game challenge, where 456 people competed for $456,000. Then, Netflix also created a reality competition show based on the dystopian thriller.\nOf course, the contestants on Netflix or in MrBeast videos are participating voluntarily and are not in mortal danger. Still, we’re living in a country where the total amount of student debt has almost tripled in the last 15 years to over $1.77 trillion dollars. And according to a study from Kaiser Health News and NPR, 41% of American adults have some form of medical debt.\nIf getting sick can render you bankrupt, why not live inside a grocery store for 45 days if it could eliminate your financial burdens? The American Dream is no longer the promise that anyone can get rich if they just work hard enough. Now, it’s the hope that maybe one day MrBeast will film you living in terrible conditions for a few months, and then you’ll be able to pay off the debt you accumulated by simply just going to school or getting sick.\nOne of the two contestants who just won $185,000 for living in a barren room with a stranger for 100 days, Suzie Taylor is using this exposure to jumpstart her career as a content creator. Now that 78 million YouTube viewers (and counting) have watched her get pushed to her psychological limits for cash, she’s reinvesting her winnings into becoming a content creator herself.\nIn tandem with the release of MrBeast’s video about her, Taylor posted a video called “I Spent $185,000 From MrBeast.” Her video pays homage to MrBeast’s old-school guerilla philanthropy videos, as she drives around Los Angeles doing good deeds for strangers. She buys a child a hoverboard at Target, she gives money to homeless people, and she pays for everyone’s ice cream at a very crowded dessert shop. She’s quite literally using the money she won from MrBeast to jumpstart her online career, wherein she’s emulating the same playbook that made MrBeast who he is.\nTaylor’s strategy is low-key genius. According to the Wayback Machine, she had 300 subscribers in April. On Sunday, December 17, the day after she and MrBeast posted their videos, Taylor had around 12,000 subscribers, and on Wednesday, December 20, she’s broken 100,000. So, if Taylor can keep her subscribers engaged beyond her 15 minutes of fame, she won’t just have won $185,000 from MrBeast. She’ll have made a down payment on a whole new career.\n\nThis article, authored by Amanda Silberling, was published by TechCrunch on 2023-12-21 under the category 'technology'.\n\n","id":509}
{"title":"SoftBank Corp takes 51% of Cubic Telecom for $513M to drive into the connected car world","context":"## SoftBank Corp takes 51% of Cubic Telecom for $513M to drive into the connected car world\n\nAutomakers and technology companies are building ever-more sophisticated digital platforms into the future generations of cars and other vehicles. Today, a startup that’s built a system to make it easy to connect that software and hardware to wireless networks has picked up a major round of funding.\nCubic Telecom, which provides a software-based networking solution for vehicles (and other devices) to link up with mobile networks in whichever country they happen to be, has picked up €473 million ($513 million at today’s rates) from SoftBank Corp. SoftBank is taking a 51% stake in the Dublin-based startup, valuing it at just over $1 billion (€927 million).\nThis effectively makes Cubic Telecom a consolidated subsidiary of SoftBank. Barry Napier will stay on as CEO and will have a seat on the board of the company. Daichi Nozaki, SoftBank’s SVP of global business, plus two other SoftBank-appointed people (still unnamed) will join the board, with the remaining three board seats occupied by existing Cubic Telecom investors, which include CARIAD (the Volkswagen Group) and Qualcomm.\nThe funding will be used to continue building out Cubic Telecom’s technology and business. Today, it has partnerships with 90 national and multinational mobile network operators and provides connectivity to 17 million+ vehicles in 190 countries and regions.\nThat’s only between 7% and 10% of the current market, Cubic Telecom COO Shane Sorohan said in an interview. (It might be actually slightly lower: Juniper Research estimates that the number of connected vehicles in the market today is around 192 million.)\nBut the size of this particular round is due to how fast the company is growing right now. Cubic Telecom is currently linking up 450,000 new vehicles — consumer cars, trucks and more — using its platform each month, and orders in the books are going to raise that rate “exponentially” over the next five years, the company said. Cubic Telecom cites forecasts from McKinsey noting that some 95% of new vehicles will be sold with wireless connectivity built into them by 2030. Juniper puts the number of new cars on the road by then that will be “connected” at just under 400 million.\nGrowth in the industry is due to a few factors: networks continue to improve, in particular with 5G especially suited to IoT deployments; cloud-based data services and vehicles themselves are getting more advanced; and thanks to the evolution of other connected devices like smartphones, watches, televisions and so much more, consumers and business are expecting more functionality in their vehicles.\nTo be clear, Cubic Telecom’s investment is coming from SoftBank Corp., not SoftBank Group, nor the company’s storied Vision Fund, known — and occasionally notorious — for its outsized venture deals.\nIn this case, the Japanese telecoms and IT division in Tokyo is putting in the money as a strategic investment.\nThe pair have been working together in Japan, where Cubic Telecom has been integrating SoftBank’s wireless network to provide connectivity to connected cars. And now, SBC sees an opportunity to expand internationally not through costly builds of more network, or by acquiring other carriers, but by taking a stake in a partner that it sees is getting strong traction as an IT partner globally precisely in that area where telecoms meets technology — a holy grail-type goal for carriers, especially these days as their networks become further commoditized.\nCubic plans to continue building more connectivity for vehicles, Sorohan said, but he added that the company’s infrastructure and partnerships can work in a number of other verticals, such as the agricultural industry, where national and multinational companies are now using a multitude of connected tooling and autonomous equipment in remote areas.\nCubic Telecom’s business goes back to before connected cars were a significant business — it actually appeared at TechCrunch’s first-ever Battlefield in 2007, when it was focused more on helping consumers connect mobile phones to international networks when roaming. But it was its current focus on vehicles that turbo-charged the business, attracting investment from the likes of Audi and Qualcomm.\nThe bigger gap in the market that the company has been targeting and building to plug for the last several years has been that, while tech companies and automakers have been working on ways to build more functionality into vehicles — whether that be more clever ways to manage and respond to diagnostics on the vehicle, or give you an easier way to listen to Spotify, or to help drive a car altogether — the piece that has remained more tricky is the internet connectivity to make all of that work.\nTypically, car makers will have to cut deals with individual carriers region-by-region, which is time-consuming, costly and does nothing for creating a seamless experience at the front end for users, either. Cubic’s platform acts as a wholesale aggregator, and it essentially helps to manage all of that automatically and at a lower cost, so that cars come delivered into a market ready to use, and if those cars are then driven into another region, they will continue to work there, too.\nAs vehicles continue to get more sophisticated, it’s a fair bet that technology companies and automakers themselves will come up with more seamless ways themselves to manage that connectivity. Looking at what Apple and others are building with eSIMs is a sign of how there will be easier ways to provision services as easy as it is today for most people and businesses to install, or uninstall, software. But for now, the Cubic approach is one that is helping to bring down the cost of building and managing it, and that gives it a key role for some years to come.\n“In line with our ‘Beyond Japan’ strategic growth initiative, we are extremely pleased to be teaming up with Cubic Telecom to make a full-fledged entry into the fast-growing market for high-value IoT asset connectivity,” said Junichi Miyakawa, president & CEO of SoftBank Corp., in a statement.\n\nThis article, authored by Ingrid Lunden, was published by TechCrunch on 2023-12-05 under the category 'technology'.\n\n","id":510}
{"title":"A tale of two research institutes","context":"## A tale of two research institutes\n\nIf you’re lucky, once a year you get to put together a panel built on pure kismet. Pairing Gill Pratt with Marc Raibert was exactly that for me. The two go back several decades, to the salad days of MIT’s Leg Lab.\n[A version of this story originally appeared in TechCrunch’s robotics newsletter, Actuator. Subscribe for free here.]\nRaibert founded the lab at Carnegie Mellon University (CMU) in 1980, before moving operations to MIT. The team was focused on robot locomotion research that would pave the way for Boston Dynamics’ work.\n“When we first got started, all robots that had legs were very slow moving, crab-like things that would hug the ground and then tentatively take a step and hope that things didn’t topple over and then move like a slow-moving spider,” says Raibert. “I was interested in how animals work, and I looked at that and said, ‘Wow, this is about as far from right as you can get.’ I went the other way to see if we can do something where the dynamics and the energy in the machine [were] part of the story, and springs and bouncing were part of the story. My lab worked on that. We built pogo stick robots.”\nRaibert ran the lab for 15 years. A number of future robotics luminaries would make their way through the program over the course of its existence, including AI ethics professor Joanna Bryson, research scientist Jerry Pratt, Wobbleworks co-founder Peter Dilworth, artist Daniel Paluska, CSAIL professor\/Toyota Research Institute (TRI) VP Russ Tedrake, UC Berkeley professor Ken Goldberg, Boston Dynamics CEO Rob Playter and Agility Robotics co-founder Jonathan Hurst, who was a visiting student from CMU one summer.\nRaibert and Pratt first crossed paths when the latter was a student at MIT. Raibert would found Boston Dynamics in 1992, handing the Leg Lab keys over to Pratt three years later.\n“Marc was an incredibly generous professor,” Pratt says of their early days. “One of the wonderful things about MIT at the time and Marc in particular is that I was this young kid, and both as a graduate student and then a young professor, he welcomed me. For a while, both of us were working in the Leg Lab at the same time, and Marc had done this extraordinary work on robots that run. I decided that maybe I would work on robots that walk. That’s how we intersected then, and then when he went off to form Boston Dynamics, he was very kind and basically gave me the lab and all the stuff that was there.”\nPratt remained in academia for the next two decades, transferring from MIT to Olin in 2001. Nine years later, he became a program manager at DARPA. It was there the two crossed paths yet again. Boston Dynamics designed Atlas for DARPA. The humanoid robot made its debut in 2013 and has since become a mainstay in robotics challenges.\nThree years later, Pratt was named TRI’s CEO. Raibert continued as Boston Dynamics’ CEO until 2019, handing the reins over to longtime employee Rob Playter, who managed the company’s shift to more commercial pursuits. Last year, Raibert (who still serves as BD’s chairman) founded the Boston Dynamics AI Institute. The organization has a lot in common with TRI. Both are dedicated to pure research, with the backing of two major automakers (Toyota and Hyundai).\nI recognize that “pure research” is a bit of a loaded term. The concept is certainly a hopeful one: finding a method that can sustain research outside of the pressures of academia and corporate R&D.\nAsked whether there is pressure from Toyota to productize, Pratt says, “There actually is not, and I’m not saying that just to be nice. I think one of the great things about companies that have existed for long times is that this isn’t the first time that they’ve done R&D. Certainly most of the R&D budget inside of Toyota is spent figuring out how to make the next car or maybe the car five years from now. But there’s this notion — and I’m sure Hyundai shares this — that we’re at the once-in-a-century time for transformation in the car industry. Battery electric vehicles are much simpler to make than cars have been in the past — no engine, no transmission, etc. So, we’re going to have to compete in a much fiercer way in cars. But also, can we use the skills, the dreams and the hopes of the company to go beyond cars? TRI’s job is to actually think about [what’s] next. What’s next after cars, as well as some fancy stuff on cars.”\nFor TRI, much of the “what’s next” focuses on supporting aging populations. The organization invests a good portion of its resources to building out technology designed to help older people live more independently. That’s at the root of the research we shared from the institute last week. Noted senior research scientist Benjamin Burchfiel:\nWe’ve seen some big progress with the advent of [large language models], using them to impart this high level of cognitive intelligence into robots. If you have a robot that picks up a thing, now instead of having to specify an object, you can tell it to pick up the can of Coke. Or you can tell it to pick up the shiny object, or you can do the same thing and do it in French. That’s really great, but if you want a robot to plug in a USB device or pick up a tissue, those models just don’t work. They’re really useful, but they don’t solve that part of the problem. We’re focused on filling in that missing piece, and the thing we’re really excited about now is that we actually have a system and that the fundamentals are correct.\nThe Boston Dynamics AI Institute is still in its infancy, and therefore doesn’t have much in the way of public facing research to show just yet. It is, however, doing a lot of hiring. This week it announced that MIT’s Kate Darling will lead research around “ethics and societal impact of robotics and AI.” From the institute:\nDarling’s team will explore immediate as well as long term questions on the implementation and use of robotics, impact on the workplace, infrastructure and other topics. The team will perform studies and experiments designed to generate data needed for others to make informed ethics and policy decisions, and will also develop a series of talks and workshops at the intersection of ethics, law, economics and robotics that will offer a platform for broad discussion.\n“I’ve heard Gill say that making a car is taking small bits of metal and banging them up, welding them together and attaching them,” Raibert says. “That’s a little on the primitive side. Now we have software, robotics, AI and all that stuff, and the car companies need to embrace that. I think the leadership at Hyundai — the chairman visited me last week, and we’re in close touch with him and the people who work with him — think that getting into the 22nd century is an important thing to do and we’re getting started on it now.”\nPratt adds, “There’s actually this alignment that’s happening between cars and robotics, as well. Rod Brooks was the one who a few years ago said that modern cars are eldercare robots. I think that’s really true. You think about the amount of computers in them, the amount of software that’s in them. TRI has different divisions inside of it, one of which works on very advanced things in cars that is completely overlapping with some of the software and some of the concepts that we’re using in the robotics space.”\nFor its part, the Boston Dynamics AI Institute lists three key pillars of its research: intelligence, dexterity and mobility. That’s effectively making robots that are smarter, better at mobile manipulation and move more dynamically. Raibert admits that “Boston Dynamics AI Institute” might not be the most instructive name, both with regard to confusion between itself and Boston Dynamics the company, as well as a seeming focus on AI over robotics. A name change is apparently coming, but nothing has been decided just yet.\n\nThis article, authored by Brian Heater, was published by TechCrunch on 2023-10-01 under the category 'technology'.\n\n","id":511}
{"title":"World Series Game 2: Arizona Diamondbacks v Texas Rangers – live","context":"## World Series Game 2: Arizona Diamondbacks v Texas Rangers – live\n\n29 Oct 2023 03.21 GMT Final thoughts Okay, we officially have a series! Assuming one has no rooting interest in either of the remaining teams, there’s no greater start to a World Series than a split in the first two games. A 1-1 split is an ideal situation for the casual fan as it usually portends a longer series. It is, of course, a less than ideal situation for the Rangers. Today, their weaknesses were exposed and they know their two-game home stand could have gone worse: they needed plenty of late-inning drama just to pull off a come-from-behind win in Game 1. What happens next is anybody’s guess. The World Series heads to Arizona for Monday’s Game 3 where Rangers’ Max Scherzer and the Diamondbacks’ Brandon Pfaadt are currently penciled in as the probable starters. Stay tuned to the Guardian for further coverage of the 2023 World Series as it develops but this will wrap up today’s Game 2 liveblog. Thanks to everybody who followed along with us tonight. Ciao!\n\n29 Oct 2023 03.12 GMT Merrill Kelly Despite the final score, this was a much closer game until the Rangers bullpen imploded late. Arizona’s big hero was starting pitcher Merrill Kelly who put up a dazzling pitching performance: 7.0 IP, 3 H, 1 ER, 7 Ks. It even felt like he could have stayed in there longer if necessary. Easily the player of the game.\n\n29 Oct 2023 03.08 GMT The Arizona Diamondbacks win Game 2 The Arizona Diamondbacks, on the back of an impressive pitching performance by Merrill Kelly, have won Game 2 of the 2023 World Series! The series is now tied 1-1 heading to Arizona for Monday’s Game 3.\nUpdated at 03.10 GMT\n29 Oct 2023 03.07 GMT Diamondbacks 9-1 Rangers, FINAL Garver’s only goal here is to not make the final out of a World Series game. Luckily for him, Frías puts him in a decent position by throwing him two straight balls to start the plate appearance. However, after two strikes, he lines out to third and, in fact, makes the final out of a World Series game. The Arizona Diamondbacks hold on to win!\n\n29 Oct 2023 03.04 GMT Diamondbacks 9-1 Rangers, bottom 9th Frías can end the game right here, as long as he can get García out. He falls behind 2-1, which would be worrisome if he wasn’t working with an eight-run lead. Semien takes second on defensive indifference but he would have made it there anyways because García eventually takes ball four. There’s runners on first and second but the key stat remains the fact that there’s two outs in the ninth inning.\n\n29 Oct 2023 03.01 GMT Diamondbacks 9-1 Rangers, bottom 9th Grossman looks at a Frías ball to start his at-bat but three strikes later, he’s out of there. The Rangers are down to their final out.\n\n29 Oct 2023 02.58 GMT Diamondbacks 9-1 Rangers, bottom 9th Luis Frías is coming into the game to get the final two outs for Arizona, possibly against Rangers pinch-hitter Robbie Grossman. Stay tuned.\nUpdated at 03.00 GMT\n29 Oct 2023 02.57 GMT Diamondbacks 9-1 Rangers, bottom 9th Seager is up next. He hits a long flyball that’s caught in centerfield. The Rangers are down to their last two outs of Game 2.\n\n29 Oct 2023 02.56 GMT Diamondbacks 9-1 Rangers, bottom 9th Saalfrank starts the bottom of the ninth, hoping to end this one as quickly as possible. Semien will lead things off here, although one imagines the Rangers are already looking ahead to Game 3. Semien hits a booming flyball that lands foul. He takes a ball and then fouls off the next pitch. 1-2. He then hits a ground ball that sneaks through the defenders for a single, his first hit of the game.\n\n29 Oct 2023 02.52 GMT Two run single! (Rivera) Diamondbacks 9-1 Rangers Diamondbacks 9-1 Rangers, top 9th Rivera is up with runners on second and third but two outs. He drives in two runs with a single to absolutely ruin my pregame prediction. He gets thrown out on second to end the inning however. To the bottom of the ninth!\n\n29 Oct 2023 02.50 GMT Diamondbacks 7-1 Rangers, top 9th Thomas is up with two on and one out. He grounds out on two pitches, moving the runners into scoring position.\n\n29 Oct 2023 02.49 GMT Diamondbacks 7-1 Rangers, top 9th Gurriel hits a single to centerfield, Peterson advances on the play.\n\n29 Oct 2023 02.48 GMT Diamondbacks 7-1 Rangers, top 9th Jace Peterson is getting a pinch-hitting opportunity here for Arizona. It’s kind of like a basketball game now here where the coaches empty out the bench. Peterson works a full count before hitting into a fielder’s choice. Walker is erased on the play. So it’s one down with Peterson on first.\n\n29 Oct 2023 02.45 GMT Diamondbacks 7-1 Rangers, top 9th Pérez is back out there to pitch, essentially in mop-up duty now. He faces Walker, who hits a single to center. That’s Walker’s first hit of the World Series so good for him.\n\n29 Oct 2023 02.41 GMT Diamondbacks 7-1 Rangers, bottom 8th That’s two quick outs for the Diamondbacks, so Tavares is up to try to salvage anything here for Texas. He falls behind in the count 0-2, takes two pitches and grounds out to short. The Rangers challenge the play, but the call is confirmed. To the ninth inning!\n\n29 Oct 2023 02.38 GMT Diamondbacks 7-1 Rangers, bottom 8th Saalfrank gets Jung to ground out to third, sorry Jung lovers.\n\n29 Oct 2023 02.37 GMT Diamondbacks 7-1 Rangers, bottom 8th Andrew Saalfrank is pitching now for Arizona as Kelly gets a well-earned rest. Rivera stays in the game, playing third base. Lowe is at the plate for the Rangers and he promptly grounds out to second.\n\n29 Oct 2023 02.36 GMT Me earlier: “I’m going to guess this ends with a score like Diamondbacks 6-2 Rangers.” If this holds up, I want to claim partial credit.\n\n29 Oct 2023 02.34 GMT Diamondbacks 7-1 Rangers, top 8th Moreno strikes out on three pitches to finally end the inning, but the damage is done and this one feels all but out of reach for Texas. Still, the game must go on and we head to the bottom of the 8th inning.\n\n29 Oct 2023 02.33 GMT RBI single! (Carroll) Diamondbacks 7-1 Rangers Diamondbacks 7-1 Rangers, top 8th Carroll singles here and scores Perdomo! The Diamondbacks are just teeing off on these relievers.\n\n29 Oct 2023 02.31 GMT Two-run single! (Marte) Diamondbacks 6-1 Rangers Diamondbacks 6-1 Rangers, top 8th This is more like the Rangers bullpen I was expecting. Ketel Marte is up next with the bases loaded and a chance to make the rest of this game entirely irrelevant. Pérez’s first pitch is yet another ball, this one that barely misses the ground. 1-0. Marte takes a huge swing and the next pitch, he doesn’t make contact. However, on the next pitch, he knocks in a base hit that’s a two-run, two-out single and the Diamondbacks have a five-run lead!\n\n29 Oct 2023 02.28 GMT Diamondbacks 4-1 Rangers, top 8th Pérez faces Perdomo who looks at two straight strikes. He fouls off a 0-2 pitch to stay alive before taking a ball. 1-2. He doesn’t offer at another ball. 2-2. Pérez tries a sinker and doesn’t get the call. 3-2. The crowd boos, it does look like a borderline pitch but Pérez isn’t really showing great command. And, yeah, he throws another ball to walk the bases loaded.\n\n29 Oct 2023 02.25 GMT Diamondbacks 4-1 Rangers, top 8th What if you appeared in a World Series game and didn’t get a chance to hit? Well, it looks like Emmanuel Rivera is in to hit with Pérez in the game. Ah, managerial chess matches, how I loathe thee. Once again, that runner is still on second and there are still two outs. Pérez gets a strike on his first pitch to Rivera and then uncorks three straight pitches that aren’t in the zone before Rivera swings and misses to make it a full count. He waits for the next pitch and takes a walk. So that’s runners on first and second with two outs now.\n\n29 Oct 2023 02.21 GMT Diamondbacks 4-1 Rangers, top 8th Oh hey, a rare Diamondbacks pinch-hitter. Welcome to the World Series, Pavin Smith! Meanwhile, Stratton is out of the game now and pitcher Martín Pérez is coming in.\n\n29 Oct 2023 02.20 GMT Diamondbacks 4-1 Rangers, top 8th To be fair, that’s not a terrible bunt, again it’s a situation where one more run might put this one out of reach. It’s also weird because Stratton doesn’t seem sharp. He gets ahead of Thomas 0-2 and just can’t put him away. Thomas works a full count and then starts to foul off fastballs to stay alive. On pitch number nine, however, Stratton gets him to look at a curve that just hits the corner for strike three. That’s now two out with a runner on second. The announcers note that this was the first time an Arizona hitter struck out this game, which is maybe the number one reason why the Diamondbacks are in front.\n\n29 Oct 2023 02.16 GMT Diamondbacks 4-1 Rangers, top 8th Gurriel Jr. is up next. He bunts and I’m just getting sick of this. Pham is on second base with one out now.\n\n29 Oct 2023 02.15 GMT Diamondbacks 4-1 Rangers, top 8th Chris Stratton is the next Rangers reliever. He has absolutely no room for error given that there’s a huge difference between a three-run deficit and a four-run deficit. It’s the entire basis of the archaic “save” rule! He’s here to face Pham, who puts him to work by running up a full count on eight pitches before hitting a single to start of the top of the eighth. He’s 4-to-4 on the day.\n\n29 Oct 2023 02.10 GMT In a world full of bullpen games and pitching “openers,” it’s important that we recognize how rare it is for a starter to get this deep in a postseason game. Merrill Kelly is now the first pitcher to work seven innings in a World Series game in the 2020s. The last pitchers to do it were Stephen Strasburg (8.1 IP) and Gerrit Cole (7 innings twice) in 2019. — Tyler Kepner (@TylerKepner) October 29, 2023\n\n29 Oct 2023 02.09 GMT Diamondbacks 4-1 Rangers, bottom 7th Two out, nobody on in the bottom of the seventh. Heim is up to the plate for Texas and he gets ahead of the count 2-0 before looking at his first strike. 2-1. Kelly’s next pitch is a ball, 3-1. Could this be a rare walk? Nope, Heim watches two straight strikes to end the inning. The Rangers have just six outs to play with to score three runs. Can they pull of late-inning magic again?\n\n\nThis article, authored by Hunter Felt, was published by The Guardian on 2023-10-28 under the category 'sports'.\n\n","id":512}
{"title":"From winter fun to summer sun: your seasonal guide to diverse Dubai","context":"## From winter fun to summer sun: your seasonal guide to diverse Dubai\n\nSynonymous with all things luxury paired with a rich history and heritage, Dubai has plenty to offer the traveller looking to immerse themselves in culture while also enjoying the finer things in life. A year-round destination, this diverse country offers a wide range of activities and experiences that vary depending on the time of your visit.\nOver the winter months, Dubai enjoys balmy temperatures and pleasant weather throughout the season, making it the ideal time to get outdoors and explore it’s more active, adventurous side. While in early summer, as the temperatures climb, it’s the perfect spot for a blend of beach breaks and sightseeing. Finally, in the hotter months, June and July, its world-famous waterparks come into their own, while air-conditioned cultural activities and evening tourism (where you sight-see after sunset) are other season-perfect options.\nFor a stress-free start to your Arabian adventure, when you book with British Airways Holidays, you can enjoy great value breaks, with the quality and peace of mind you expect from British Airways. ATOL-protected, keeping you and your money safe, you can enjoy flexible payment options with deposits from just £75 per person* as well as 23 kg baggage allowance per person and 24-hour dedicated support helpline during your trip. Meaning, whatever time of the year you travel there, from the day you book, you can put all your focus on planning an unforgettable trip to this dynamic, luxurious corner of the world.\nA winter escape\nFrom desert safaris to quadbiking, head to the Dubai desert for a big adventure (Alamy Stock Photo)\nIf you’re the kind of person who’d rather spend their days exploring than soaking up the sun on the beach, then November and December is the best time to head for Dubai and get stuck into outdoor activities. The temperature, although still hot with clear blue skies, is a lot cooler than the sweltering summer months.\nDubai’s desert offers a wealth of heart-pumping Arabian activities to enjoy, from dune buggies to quad biking and desert safaris. Whizz through the desert on a heart-pumping dune drive, keeping your eyes peeled for local wildlife along the way – the desert is home to hopping gazelles, several species of reptile and the Arabian Oryx, a species that was saved from the brink of extinction. If you choose a desert safari, you’ll also experience traditional activities like henna tattooing and dance shows; many also culminate in an evening BBQ dinner.\nThe winter months are also a great time to explore Dubai’s fascinating history. At Dubai Creek in Deira, you’ll find traditional wooden boats, also known as abras, the oldest form of public transport in Dubai. These boats will take you from one side of the river to the other – a short trip, but it’s a nice way to get a feel for local life in Dubai.\nConsider a stop-off in the historic Al Fahidi Historical neighbourhood located along the creek, where you can learn what life in Old Dubai was like. The area is dotted with original buildings and preserved infrastructure like traditional wind towers and the Al Fahidi Fort, one of the oldest buildings in Dubai, built back in 1787.\nMore history and heritage can be found in nearby Hatta, where craggy mountains and lush valleys cradle citadels, towers and forts. For jaw-dropping views over the historical village, hike up the dramatic Hajar mountains, one of the highest ranges in the Arabian peninsula. Be sure to stop by Hatta Heritage Village, a reconstruction of a traditional mountain village, where you can see how life was lived centuries ago.\nIf you do happen to visit in November, Dubai Design Week takes place around the start of the month. The region’s largest creative festival shines a spotlight on pioneering designers and all things creative via exhibitions, installations, talks, workshops and markets.\nBeach clubs and festivals\nDubai’s blue skies, turquoise seas and golden shores are made for sunseekers (Alamy Stock Photo)\nMay is also a great time for a trip to Dubai, particularly for sunseekers, with average temperatures around 30 degrees. Make the most of dining al fresco; the city is filled with beachside eateries and outdoor terraces. At Akira Back, which serves Japanese dishes prepared with Korean and international flavours, you can enjoy incredible views across Dubai Marina from its huge terrace. Or try Fish Beach Taverna, for must-experience Aegean seafood in coastal setting.\nWhether you fancy soaking up the day’s rays in a luxury cabana or floating in an infinity pool overlooking the surrounding sea, there’s no shortage of beach clubs to get your sunshine fix in style. Melt into a cosy daybed at SĀN Beach or head to DRIFT Beach Dubai for infinity pool rest, relaxation, and chic French fare.\nFoodies should coincide their trip with The Dubai Food Festival, the ultimate celebration of the local culinary scene, held at the beginning of the month. While for those looking to add some culture to the mix, the Dubai Comedy Festival takes place later in May, bringing together some of the best names in comedy for some side-splitting entertainment.\nSplash parks and sunset cruises\nEvery month brings opportunities to explore something different in Dubai, and that’s no exception as temperatures begin to climb in June and July. These sun-packed months are perfect for those who really like the heat and are happy to spend their days cooling off by the water.\nFor literal thrills and spills, Dubai has made a name for itself when it comes to water parks. Wild Wadi, as the city’s first-ever waterpark, is a perennial favourite for adults and kids alike, with its exhilarating range of rides, surfing machines and wave pool. There’s also Laguna Waterpark, one of the newer parks on the map, located on the coast with an infinity pool and its own beach, as well as thrilling slides and a boat-themed kids pool.\nVisiting in hotter months means you can save sightseeing and cultural activities for night-time, giving you an entirely different way to experience the city. Take an evening dinner cruise along Dubai Creek to experience the twinkling city night lights, or head up the iconic Burj Khalifa at sunset for stunning views across the city.\nFurther architectural highlights include the night-time lights of the Burj Al Arab and the Dubai Frame, a 153-metre-high structure built to resemble a massive picture frame, which provides incredible views of Old and New Dubai. Alternatively, make the most of the air-con, with indoor concerts and theatre shows at the stunning Dubai Opera.\nDiscover dynamic Dubai with British Airways When you book with British Airways Holidays, you can enjoy great value breaks, with the quality and peace of mind you expect from British Airways. ATOL-protected, keeping you and your money safe, you can enjoy flexible payment options with deposits from just £75 per person, with no balance due until 4 weeks before travel for short haul, or 7 weeks for long haul*. Customers can also use Avios to pay for flights and part-pay holidays.\nA generous baggage allowance of 23kg per person is included – so you won’t encounter any add-on costs.\nBritish Airways Holidays provide 24\/7 support throughout your trip, with a dedicated holiday helpline for any issues whilst you’re away.\nWhether you’re looking for some winter sun, a springtime break or your next big getaway, to find your perfect holiday in Dubai, visit British Airways for destination inspiration and incredible deals on flights and hotels.\n*Terms and conditions apply. Travel restrictions may apply.\n\nThis article, authored by , was published by The Independent - Travel on 2023-11-17 under the category 'entertainment'.\n\n","id":513}
{"title":"Tesla ‘digs its own grave with the Cybertruck,’ Convoy collapses and Rivian scores a win at Rebelle","context":"## Tesla ‘digs its own grave with the Cybertruck,’ Convoy collapses and Rivian scores a win at Rebelle\n\nTesla ‘digs its own grave with the Cybertruck,’ Convoy collapses and Rivian scores a win at Rebelle\nWelcome back to The Station, your central hub for all past, present and future means of moving people and packages from Point A to Point B.\nYour usual host Kirsten was shredding off-road at the Rebelle Rally this week, so I’ll be taking over the newsletter. Let’s jump in with a few words about Tesla.\nAh, but before Rebecca goes . . . it’s me, Kirsten, popping in here to share a bit of what I saw and experienced at Rebelle Rally 2023, a 2,120-kilometer off-road and navigation competition. In its eighth year, the Rebelle has become a proving ground of sorts for the 65 all-women teams who participate as well as stock manufacturer vehicles. The catch? GPS and other electronic devices are strictly prohibited.\nSo what am I checking out at this seemingly non-tech event? EVs and tech, of course. Oh, and green hydrogen, believe it or not.\nThere were 10 vehicles out of the 65 that fell into the electrified category such as the Jeep Wrangler Rubicon 4xe. Four of those vehicles — all of them Rivian R1T pickups — were electric. And this year, one Rivian team took first place in the 4×4 class (there are two classes in the Rebelle) — the first time an all-electric vehicle was on the top podium. The first place finishers, driver Lillian Macaruso and navigator Alexandra Anderson, are both employees of Rivian.\nOK, Rebecca, back to you.\nTesla reported its third-quarter earnings this week, and once again, all eyes were on the automaker’s margins amid ongoing price cuts.\nTesla’s shares, which are priced more as a tech stock than as an automaker’s stock, were down after Q3 earnings. Investors were clearly feeling skittish after Tesla reported a gross margin of 17.9%, down from 25.1% in the same period last year. That’s also down from Q2’s margins of 18.2%. As a result, profits fell 44% to $1.85 billion in Q3 from the same year-ago period.\nInvestors see the falling margins and Tesla’s price cuts as proof that demand is lessening for the vehicles as other EVs take market share and rising interest rates make it difficult for many buyers to afford big ticket purchases. The company also reported that solar deployments slipped 48% in Q3 from the same period last year. But the company made up for it by pulling in a 90% spike in energy storage deployments.\nTesla also gave some updates about its long-delayed Cybertruck. Initial deliveries are set for an event at Giga Texas on November 30. Elon Musk noted that scaling the Cybertruck will be hard and it will take 18 months before the pickup is profitable.\n“I mean, we dug our own grave with Cybertruck,” said Musk.\nThe billionaire executive also said Giga Texas will be able to produce about 250,000 Cybertrucks a year starting in 2025. But let’s remember that Musk isn’t great at making predictions. After all, he initially said the Cybertruck would be on the market by 2021. Expect some of these numbers to be pushed out, too.\nWant to reach out with a tip, comment or complaint? Email Kirsten at kirsten.korosec@techcrunch.com or Rebecca at rebecca.techcrunch@gmail.com.\nReminder that you can drop us a note at tips@techcrunch.com. If you prefer to remain anonymous, click here to contact us, which includes SecureDrop (instructions here) and various encrypted messaging apps.\nMicromobbin’\nThis week was the trade show Micromobility America. Here are some of the best bits that came out of it:\nBird is now doing e-bikes again? But instead of the VanMoof knockoff of previous years, Bird has partnered with TradeHubb, an e-bike supplier, and Spring, a strategic retail growth company, to launch the bike. You might recall that Bird last year ditched its retail bike offering to focus on shared rides in an attempt to reach profitability. The struggling company was also recently delisted from the stock market. Who knows what’s going on behind the scenes? I tried reaching out to learn more, but no response. If you have a tip, hit me up!\nThe team at Ride Review launched the Rider’s Choice Awards again, for those who want to vote. Winners will be announced January 25.\nThe folks behind Micromobility America also launched the Electric Rider Alliance, a 501c6 membership organization that is set up to “create a level playing field in the transportation industry for the small electric vehicle ecosystem through standards, lobbying and governance.”\nIn other news . . .\nBolt Mobility is introducing distance-based pricing for some of its micromobility vehicles. The aim here is to incentivize riders to slow down and ride more safely, rather than racing the clock.\nAn e-scooter that looks like a Cybertruck? Check out Infinite Machine’s first product, the P1, which is on sale now.\nMeet Shane, a two-wheeled EV concept space-pod-looking thing from the creator of the original hoverboard, Shane Chen.\nDeal of the week\nKirsten here again! Convoy isn’t a traditional deal of the week, but its collapse sure got my attention.\nThe digital freight broker told employees this past week it was shutting down due to what executives described as a “massive freight recession.” It turns out that disrupting the freight business is hard.\nThe abrupt closure, which wiped out investors, comes about 18 months since the Seattle-based company raised $260 million in fresh funding that pushed its valuation to $3.8 billion.\nI went back and read an interview TechCrunch conducted with Convoy co-founder and CEO Dan Lewis. A few things he said stuck out, namely what led him to start the company in the first place. The former Amazon and Google executive, who has a background in strategy and management consulting, told TechCrunch that when he was struck by the urge to start a company, he researched the money-attracting industries of the world, and then, using AngelList, saw how many companies were trying to disrupt those industries.\nHere’s the nugget:\nHis search yielded thousands of companies that were working on industries ranging from telecommunications and fashion to video games and food. Billions of dollars were going into trucking each year but fewer than 30 startups showed an interest in the field.\n“I saw a massive opportunity and few people going after it,” Lewis told TechCrunch.\nAnd then later, when asked if his method of deciding on a direction for a startup is still a good method, Lewis said, in short, yes. Read the whole interview from May 2022 here.\nOther deals that got our attention . . .\nHayden AI, an AI and geospatial analytics company, raised $53 million in a Series B funding round led by the Drawdown Fund. The company’s tech is being used by government agencies to enforce traffic violations that obstruct transit buses and capture data to help increase ridership and improve traffic efficiency.\nCommercial fleet insurance startup Nirvana Insurance has raised a $57 million Series B to expand its big data platform, hire new staff and grow its business in the trucking industry. Lightspeed Venture Partners led the round, with General Catalyst and Valor Equity Partners also participating. The round doubles Nirvana’s valuation to more than $350 million post-money.\nSupply chain logistics company Transfix raised a $40 million Series F. The company is backed by New Enterprise Associates, G Squared and Canvas Ventures.\nEV charging company Wallbox has acquired the operations and assets of German-based EV charging solutions company ABL for €15 million. Together the plan is to deploy more than 1 million chargers globally.\nVolta Trucks filed for bankruptcy proceedings in Sweden as difficulties with suppliers proved a hindrance to raising funds. Volta said the bankruptcy in August of Proterra, an EV parts supplier, and the uncertainty over its own battery supplier means it needed to cut down the number of trucks it could produce. Volta, which is based in Sweden but has operations in the U.K., also said it would file for bankruptcy in Britain.\nNotable reads and other tidbits\nAutonomous vehicles\nCruise, General Motors and Honda are launching a robotaxi service in Japan under a new joint venture. The service will launch with Origin vehicles in Tokyo in 2026.\nSpeaking of Cruise, the National Highway Traffic Safety Administration (NHTSA) has opened an investigation into the GM subsidiary’s AV system following several incidents involving pedestrians in San Francisco. The most recent one left a woman stuck under a Cruise robotaxi after being hit by a human-driven vehicle.\nFoxconn and Nvidia are building “AI factories” to help accelerate AVs, robotics and other smart applications. The AI factories position the two against Tesla, which is building the Dojo supercomputer to do more or less the same thing — take in vast amounts of data, train it, tweak code and send it back out to self-driving cars.\nWaymo released a lightweight simulator called Waymax for the AV research community. The simulator is designed to train multiple agents to perform complex, realistic behaviors.\nElectric vehicles, charging & batteries\nBMW Group says it will adopt the NACS charging standard in the U.S. and Canada. Drivers of BMW, Mini and Rolls-Royce brands will gain access to Tesla Superchargers in early 2025, and in that same year, BMW says it will implement NACS in EVs sold in the U.S. and Canada across those same brands.\nSpeaking of NACS, global EV charging network ChargePoint has officially opened its AC and DC piles and is now deploying NACS connectors across its network.\nGeneral Motors is delaying its $4 billion plan to convert the Orion Assembly plant into an EV truck factory to late 2025 amid softening EV demand and, we’re guessing, the ongoing UAW strike.\nKia has started taking reservations for its EV9 full-sized SUV. Reservations are $750 and can be applied to the purchase of the company. This is one of the first vehicles Kia has allowed customers to reserve in advance.\nLucid missed Wall Street delivery estimates in the third quarter by about 500 vehicles. The automaker delivered 1,457 of its luxury Air sedans, reporting flat growth year-over-year. The results sent shares down as investors worried about softening demand for Lucid’s only EV.\nCalifornia-based EV startup Pebble unveiled a prototype of its flagship all-electric travel trailer. The $100,000 EV is designed to support a digital nomad looking to get lost in the wilderness — it can live off-grid for seven days.\nCommercial EV startup REE Automotive has reported an order book that now totals $25 million for its modular battery EV platforms, dedicated to B2B customers.\nAbout 10,000 of Rivian’s all-electric vans are delivering packages throughout the U.S. for Amazon.\nTesla has urged the Biden administration to adopt stricter fuel economy standards than the NHTSA has proposed. Most other automakers have already said the NHTSA’s proposal was unfeasible, so Tesla’s call on regulators to double down seems to be yet another way the EV maker can one-up its competitors.\nToyota has also joined the NACS bandwagon. The automaker will build certain Toyota and Lexus vehicles from 2025 onward with an NACS port.\nFuture of flight\nEVTOL company Archer Aviation plans to start air taxi operations in Abu Dhabi in 2026. From there, Archer says it will expand across the UAE as part of a memorandum of understanding with the Abu Dhabi Investment Office.\nMiscellaneous\nThe United Auto Workers strike is affecting CES. Stellantis canceled its planned presentations for the tech trade show in January, citing the cost of ongoing UAW strikes.\nZipcar is getting hit with a fine from the NHTSA for “renting vehicles with open, unrepaired recalls.” One recall concerns 2015–2017 Ford Transit Vans, which continued to appear on Zipcar’s platform despite safety issues with the vehicles.\nPeople\nAutobrains hired Uri Yacovy, a former SVP at Mobileye, as its chief operating officer.\nLogistics company Flexport is laying off 20% of workers, or about 600 people, topping off a spate of staff upheavals at the company.\n\nThis article, authored by Rebecca Bellan, was published by TechCrunch on 2023-10-22 under the category 'technology'.\n\n","id":514}
{"title":"MVPs for all 16 AFC teams at the midpoint","context":"## MVPs for all 16 AFC teams at the midpoint\n\nOf the 16 AFC team MVPs at the season's midpoint, five are quarterbacks. At least two of them should be in the running for league MVP after the season. Meanwhile, a wideout who might be on his way to the greatest individual season at the position is his team's MVP through nine games. Here are Yardbarker's team-by-team MVPs. (Find Yardbarker's NFC team MVPs here.)\nAFC East\nBUFFALO BILLS | QB Josh Allen: Allen probably won't finish in the top three of NFL MVP balloting as he did last season, but his value to the Bills is immeasurable. Through nine games, he is on pace to set a career-high in completion rate (71.3%) and tops all QBs in QBR (75.3). Allen has virtually carried the offense by himself, accounting for 24 of the team's 28 offensive touchdowns.\nMIAMI DOLPHINS | WR Tyreek Hill: Arguably the best wide receiver in the NFL, Hill has somehow reached a new level of dominance in his age-29 season. The seven-time Pro Bowler leads the NFL in receiving yards (1,076) and TD catches (eight). As long as the Dolphins maintain their success on offense down the stretch, Hill should earn Offensive Player of the Year honors. He's on pace to break Calvin Johnson's season record for receiving yards (1,964).\n\nNEW YORK JETS | LB Quincy Williams: While his brother, Quinnen, may be the better-known Jets defender in the family, Williams — the AFC Defensive Player of the Month for October — is also making a name for himself. Aside from being the fifth-highest-rated linebacker in the NFL by Pro Football Focus, Williams is tied for 17th in tackles (74) and tied for ninth in TFLs (nine) among all defenders.\nNEW ENGLAND PATRIOTS | S Jabrill Peppers: There hasn't been much to get excited about in New England, but the versatile defensive back is a bright spot and a respected voice in the locker room. Peppers has 54 tackles — three for loss — one interception, one forced fumble and a team-leading six passes defended. For a team facing as many uncertainties as the Patriots are, Peppers is a solid piece to build around in the short term. — Colum Dell\nAFC West\nDENVER BRONCOS | CB Patrick Surtain II: In eight games, the 23-year-old budding star has one interception and eight passes defended, tied for 11th in the NFL. Don’t be surprised if he earns a second straight Pro Bowl nod.\nKANSAS CITY CHIEFS | QB Patrick Mahomes: A shaky receiving corps hasn’t fazed Mahomes. He’s third in the NFL in passing yards (2,442), fourth in TD passes (17) and third in QBR (73). The 28-year-old might capture his third MVP, as oddschecker notes he’s favored to win the award again.\nLAS VEGAS RAIDERS | Defensive end Maxx Crosby: Despite a weak supporting cast, Crosby thrives. He has 9.5 of the Raiders’ 24 sacks and is tied for the league lead in tackles for loss (13). If the two-time Pro Bowler keeps dominating, he will generate more Defensive Player of the Year buzz.\nLOS ANGELES CHARGERS | WR Keenan Allen: The 31-year-old is the centerpiece of the offense and leads the team in yards receiving (720) and receptions (62). Through Week 9, Pro Football Focus gave him a receiving grade of 84.6, eighth among WRs. — Clark Dalton\nAFC North\nBALTIMORE RAVENS | QB Lamar Jackson: Jackson has inserted himself into the league MVP conversation during his team’s four-game win streak. The 2019 NFL MVP has thrown for 1,954 yards and nine touchdowns and posted 440 yards and five touchdowns rushing. He is the reason, once again, Baltimore is a Super Bowl contender.\nCLEVELAND BROWNS | Defensive end Myles Garrett: Garrett could be leading the race for the Defensive Player of the Year. The No. 1 overall pick in 2017 is tied for the second-most sacks (9.5) and most forced fumbles (four) in the league. He also blocked a field-goal attempt in a Week 7 win over the Colts. He's the ringleader of a defense that allows the fewest yards per game (234.8).\nCINCINNATI BENGALS | QB Joe Burrow: Battling a calf injury, Burrow had a rough start to the season. He appears fully recovered now, though, as the Bengals (5-3) have won four straight. During their win streak, Burrow has thrown for 1,133 yards, 10 touchdowns and just two interceptions.\nPITTSBURGH STEELERS | Linebacker T.J. Watt: The Steelers are the first team in NFL history to be outgained by their opponents in each of their first eight games and have a winning record (5-3). It hasn’t been pretty to watch, but Pittsburgh always makes plays when needed. The player who seems to make the most is Watt. The 2021 NFL Defensive Player of the Year is tied for second-most sacks (9.5) in the league. He also has two forced fumbles, three fumble recoveries and one interception. — Aaron Becker\nAFC South\nHOUSTON TEXANS | QB C.J. Stroud: Stroud is having one of the best statistical rookie seasons of all time. He ranks in the top 10 in passing yards (2,270), touchdown passes (14) and passer rating (102.9), and has only thrown one interception. The Texans (4-4) aren’t close to a .500 team without him.\nINDIANAPOLIS COLTS | RB Zack Moss: With Jonathan Taylor missing the first four weeks of the season, Moss stepped up in a big way. After not playing in Week 1, he rushed for 445 yards and scored four touchdowns over his next four games to help Indy win three of four and stay in the thick of the AFC South. Moss is second in the NFL in rushing, 37 yards behind San Francisco's Christian McCaffrey.\nJACKSONVILLE JAGUARS | RB Travis Etienne: QB Trevor Lawrence hasn’t quite taken the step forward everyone thought he would, but fortunately for the Jags, Etienne is emerging as one of the top RBs in the league. He has rushed for multiple touchdowns in three of his past four games and scored a touchdown in five of the team’s six wins. Etienne ranks third the NFL in rushing touchdowns (seven) and sixth in rushing yards (583).\nTENNESSEE TITANS | DT Jeffery Simmons: There haven’t been too many bright spots for the Titans, but Simmons continues to be a wrecking ball on the defensive line. He leads the team in tackles for loss (six) and ranks second in sacks (4.5). If not for Simmons, Tennessee’s defense would rank a heck of a lot lower than 20th in yards allowed per game (337.8). — Michael Gallagher\n\nThis article, authored by Yardbarker, was published by Yardbarker on 2023-11-09 under the category 'sports'.\n\n","id":515}
{"title":"Sam Altman ousted as OpenAI’s CEO","context":"## Sam Altman ousted as OpenAI’s CEO\n\nSam Altman has been fired from OpenAI, Inc., the 501(c)(3) nonprofit that acts as the governing body for OpenAI, the AI startup behind ChatGPT, DALL-E 3, GPT-4 and other highly capable generative AI systems. He’ll both leave the company’s board of directors and step down as CEO.\nIn a post on OpenAI’s official blog, the company writes that Altman’s departure follows a “deliberative review process by the board” that concluded that Altman “wasn’t consistently candid in his communications” with other board members, “hindering its ability to exercise its responsibilities.”\nTip TechCrunch\nDo you work at OpenAI and know more about Sam Altman’s departure?\nDo you work at OpenAI and know more about Sam Altman’s departure? Get in touch with TechCrunch\n“The board no longer has confidence in [Altman’s] ability to continue leading OpenAI,” the blog post reads.\nIn a post on X (formerly Twitter), Altman wrote that he “loved his time at OpenAI” and will have “more to say about what’s next later.”\ni loved my time at openai. it was transformative for me personally, and hopefully the world a little bit. most of all i loved working with such talented people. will have more to say about what’s next later. 🫡 — Sam Altman (@sama) November 17, 2023\nOpenAI’s dramatic leadership change will also see Greg Brockman — who was a member of the team that co-founded OpenAI, as was Altman — step down as chairman of the board but remain as OpenAI’s president, reporting to the company’s newly-appointed interim CEO, Mira Murati. Murati was previously OpenAI’s CTO.\nOpenAI says that it’ll begin conducting a formal search for a permanent CEO immediately.\n“OpenAI was deliberately structured to advance our mission: to ensure that artificial general intelligence benefits all humanity,” the board wrote in a joint statement. “The board remains fully committed to serving this mission. We are grateful for Sam’s many contributions to the founding and growth of OpenAI. At the same time, we believe new leadership is necessary as we move forward. As the leader of the company’s research, product, and safety functions, Mira is exceptionally qualified to step into the role of interim CEO. We have the utmost confidence in her ability to lead OpenAI during this transition period.”\nSam Altman is a hero of mine. He built a company from nothing to $90 Billion in value, and changed our collective world forever. I can't wait to see what he does next. I, and billions of people, will benefit from his future work- it's going to be simply incredible. Thank you… — Eric Schmidt (@ericschmidt) November 17, 2023\nOpenAI’s board of directors now consists of OpenAI’s chief scientist Ilya Sutskever; Quora CEO Adam D’Angelo; tech entrepreneur Tasha McCauley; and Helen Toner, the director of strategy at Georgetown University’s Center for Security and Emerging Technology.\nAltman’s removal comes unexpectedly, to say the least. The company just last week hosted its first developer conference, OpenAI DevDay, which Altman emceed. Altman spoke at the Asia-Pacific Economic Cooperation conference and an Oakland, California event on Thursday. And according to The Verge and The New York Times, citing multiple internal sources, OpenAI employees learned of Altman’s firing when it was announced publicly.\nAltman has a long history steering OpenAI. After co-founding the company alongside Peter Thiel, LinkedIn cofounder Reid Hoffman and others, Altman, who formerly headed startup accelerator Y Combinator and also holds a seat on the board at Worldcoin, the ambitious cryptocurrency project, initially served as a co-chair of OpenAI alongside Elon Musk. Musk left in 2018 to avoid a conflict of interest with Tesla.\nAltman over the past several months played an active role in attempting to shape regulators’ responses to AI, appearing at U.S. congressional hearings and meeting personally with world leaders including President Joe Biden, German Chancellor Olaf Scholz and French President Emmanuel Macron, among others, on an international policy tour.\nMore important than being one of the most brilliant and impactful people our industry has ever had Sam is one of the most generous and caring people I know. I've never met someone who has supported and lifted up more people around them than him. Couldn't be a prouder brother. — Jack Altman (@jaltma) November 17, 2023\nIt’s unclear what missteps Altman might’ve made helming OpenAI… at present. But they evidently relate to his relationship with OpenAI’s rather unusual board makeup and corporate governance structure — and perhaps OpenAI’s active talks to raise substantial new capital.\nAs a recent piece in VentureBeat explored, OpenAI’s for-profit subsidiary, OpenAI Global, LLC, is fully controlled by OpenAI’s nonprofit. While the for-profit subsidiary is permitted to commercialize its tech, it’s subject to the nonprofit’s mission: attaining artificial general intelligence (AGI), or AI that can — as OpenAI defines it — “outperform humans at most economically valuable work.”\nThe nonprofit OpenAI’s board has the power to both determine when the company has achieved AGI and exclude this AGI from IP licenses and other commercial terms, including with Microsoft, one of OpenAI’s biggest investors and a steadfast integrator of OpenAI’s various technologies.\nMicrosoft has poured $13 billion into OpenAI so far and has what amounts to a 49% stake in the company. The former’s stock price fell more than 1% in the last 30 minutes of trading, after Altman’s departure was announced; Axios reports Microsoft was notified Altman would be leaving “minutes” before the public announcement.\nOpenAI was founded as a nonprofit in 2015, but restructured in 2019 as a “capped-profit” company to raise capital — an acknowledgement of the huge costs associated with training cutting-edge AI systems. Underlining the point, Altman said in an interview this week with the Financial Times that he “hoped” Microsoft would increase its investment to help pay for “huge” imminent model training costs.\nWhen contacted via email, OpenAI’s press relations declined to comment beyond the official blog post. But Microsoft PR gave this statement from Frank Shaw, its chief communications officer: “We have a long-term partnership with OpenAI and Microsoft remains committed to Mira and their team as we bring this next era of AI to our customers.”\nNadella later published a statement:\n“As you saw at Microsoft Ignite this week, we’re continuing to rapidly innovate for this era of AI, with over 100 announcements across the full tech stack from AI systems, models and tools in Azure, to Copilot. Most importantly, we’re committed to delivering all of this to our customers while building for the future. We have a long-term agreement with OpenAI with full access to everything we need to deliver on our innovation agenda and an exciting product roadmap; and remain committed to our partnership, and to Mira and the team. Together, we will continue to deliver the meaningful benefits of this technology to the world.\n\nThis article, authored by Kyle Wiggers, was published by TechCrunch on 2023-11-17 under the category 'technology'.\n\n","id":516}
{"title":"YouTube demonetizes popular content creator SSSniperwolf after doxxing accusations","context":"## YouTube demonetizes popular content creator SSSniperwolf after doxxing accusations\n\nThe debate over “reaction” content on YouTube has been brewing for years, but a recent incident between two creators has refueled the urgency of the conversation.\nThe debate centers on Alia “SSSniperwolf” Shelesh, a YouTuber with over 34 million subscribers, and Jack “Jacksfilms” Douglass, a YouTuber with 4.9 million subscribers. The two have been feuding online over the past year, but it came to a head this weekend, as Douglass said that Shelesh showed up to his home and filmed the outside of his residence on Saturday. Shelesh shared a video of the incident as an Instagram story, saying “let’s talk like adults,” according to a report from NBC News. On Oct. 20, YouTube said that Shelesh’s account would be temporarily demonetized.\nWhat led to this confrontation, and why did it ignite such a firestorm of controversy online?\nWhat is ‘reaction content’ and why is it so controversial?\nReaction content is an umbrella term that applies to a content creator responding to or riffing on an existing piece of media. Reaction content has been controversial for a long time; in 2016, the Fine Brothers made an infamous attempt to copyright their “React” videos, which was met with near unanimous criticism. In August, the conversation reignited as popular creators like Félix “xQc” Lengyel “reacted” to long-form content with very little (if any) original input or transformative commentary.\nHow are Jacksfilms and SSSniperwolf involved in the reaction content debate?\nDouglass has made content on YouTube since 2006, primarily focusing on comedy videos. In the past, he has called out “reaction” content that he says fails to meet the bar for fair use, and has even made parody videos reacting to reaction content.\nWithin the last year, he set his sights on Shelesh’s content, citing a lack of credit or links to original creators and their work, and a lack of transformative commentary. Shelesh has been a content creator for roughly a decade, including making YouTube and TikTok videos. Her recent work is largely reaction content, which she posts to both platforms. Shelesh has been aware of Douglass’ commentary, even making jokes about the YouTuber in her own reaction content.\nIn addition to Douglass’ video callout above, he revived an old joke channel called JJJacksfilms, poking fun at Shelesh’s content and celebrating times she deleted clips. He also regularly made content on Twitch reacting to and even grading Shelesh’s reaction content, complete with a bingo game for viewers to play. The JJJacksfilms streams were designed to apply pressure to Shelesh, encouraging her to credit original creators and provide substantial commentary.\nThe SSSniperwolf doxxing accusations\nOn Oct. 13, Shelesh posted an Instagram story with the text, “Should I go visit @Jacksfilms? He lives 5 mins away from my shoot.” She proceeded to add more posts to her story throughout the night, which included a photo of the outside of Douglass’ house and the caption “Let’s talk like adults.”\nDouglass was livestreaming on Twitch when Shelesh posted these images to her Instagram story, and he disconnected and posted the following tweet on Oct. 13: “Sssniperwolf just doxxed me on her IG. Creepy, gross, violating,” wrote Douglass, alongside a screenshot of Shelesh’s Instagram story. “What you do is disgusting. You steal content AND stalk youtubers. @YouTube demonetize this dangerous ‘creator’ or just get her off your platform. She posted an IG story right outside our home and deleted it.”\nAs Douglass’ fans waited for YouTube to respond, they scoured Shelesh’s content, looking for potential additional rule violations. Shelesh also posted updates making light of the situation, including a since-deleted photo of her and her sister with the caption “We show up to ur house wyd??” and a post over Douglass’ tweet, captioned: “This creep has been harassing me for months then plays victim saying I threatened him when I just wanted to talk to him. I have no ill intentions. It’s so sad when people have to constantly create drama to pay their bills.”\nThe incident inspired a series of videos and posts from influencers and commentary channels, with public opinion largely being in favor of Douglass. Of course, the situation also inspired a fair few shitposts and memes — some of which were aimed at YouTube, encouraging the platform to respond.\nPolygon reached out to Douglass, Shelesh, and YouTube and will update this story when we hear back.\nYouTube responds\nOn Oct. 20, a week after the doxxing incident, YouTube and Shelesh both made public statements. YouTube posted a tweet confirming Shelesh had received “a temporary monetization suspension per Creator Responsibility policies.” The tweet also criticized “the behavior on both sides” and expressed hope that the incident would “move this convo to a better place.”\nConfirming SSSniperWolf has received a temporary monetization suspension per Creator Responsibility policies. Off platform actions that put others’ personal safety at risk harm our community & the behavior on both sides isn’t what we want on YT. Hoping everyone helps move this… — TeamYouTube (@TeamYouTube) October 20, 2023\nShelesh also made a statement on X, apologizing to “Jacksfilm, YouTube, the entire creator community, and my incredible fans for not being a better example of conflict resolution.” She has since posted a handful of new videos to her YouTube account, with the comment sections disabled.\nThe response from both YouTube and Shelesh failed to address many fans’ concerns, considering the official comment from YouTube spoke about “both sides,” implying responsibility on Douglass’ side of the conflict. The demonetization feels like a slap on the wrist, which has only inspired further commentary among the community. It seems like, for now, YouTube is content to avoid the debate around reaction content and simply profit off of it from afar.\n\nThis article, authored by Cass Marshall, was published by Polygon on 2023-10-25 under the category 'entertainment'.\n\n","id":517}
{"title":"Cell phone shocker as 97% of kids use their device during school hours and beyond, says study","context":"## Cell phone shocker as 97% of kids use their device during school hours and beyond, says study\n\nMobile phones just might be young people's best friend, whether their parents like it or not.\nA new study from Common Sense Media, a nonprofit group in San Francisco, California, researched phone usage among a diverse group of 203 kids aged 11 to 17 — and the results were startling, experts say.\nThe researchers found that smartphones have become a \"constant companion\" for young people, according to a news release, although results varied.\nKids spent a median of 4.5 hours per day on their phones, with the maximum amount of time reaching 16 hours, according to the study.\nPHONE CALL ETIQUETTE FOR TODAY: BEST TO ‘OPT FOR A TEXT MESSAGE,’ EXPERT ADVISES\nMost teens check their phones frequently, ranging from two to 498 times per day.\nAdolescents were more likely to check their phones over 100 times a day, the study found.\nA whopping 97% of kids used their phones during school hours, while nearly 60% used them overnight — between the hours of midnight and 5 a.m. — on school nights.\nSocial media such as Instagram and Snapchat took up most screen time, at 32% during the school day, followed by YouTube and gaming, the study found.\nKEEPING KIDS SAFE: 'WAIT UNTIL 8TH' PLEDGE AIMS TO EMPOWER PARENTS TO RESIST SMARTPHONES FOR CHILDREN\nOvernight phone use was primarily spent engaging with the same media, although YouTube appeared to be the longest-running app because videos were often left playing during the night.\nTeens spent an average of 20 minutes per night on their phones, while some spent up to five hours.\nSixty-seven percent of participants picked up their phones on school nights, but the median number of pickups per night was only once.\nMore than 50% of kids get 237 notifications per day — while some receive as many as 4,500 every day, according to Common Sense Media's findings.\nAbout 23% of these notifications occurred during school hours.\nThe largest share of notifications came from apps including Snapchat and TikTok.\nYOUNG PEOPLE ARE MORE LIKELY TO FALL WHILE TEXTING AND WALKING AT THE SAME TIME, STUDY SAYS\nIn particular, TikTok was used by half of the study participants, for nearly two hours per day on average.\nCompared to other social media apps, teens were more likely to spend several hours daily on TikTok, with some scrolling on the app for up to seven hours.\nComparatively, the longest amount of time spent on Snapchat and Instagram was about three hours daily, the study found.\nOf the 85 participants under age 13, 68% used social media and had at least one app rated \"teen\" or higher – allowing access to \"age-inappropriate experiences,\" the study suggested.\nTikTok was the most popular app used by kids aged 11 and 12, while nearly half (45%) of participants used apps with mature or adult-only ratings, such as porn sites, fantasy sports and betting apps, according to the study findings.\nUNDERAGE DRINKING DANGERS: THESE ARE THE STATES WITH THE HIGHEST RATES OF TEEN ALCOHOL USE, STUDY FINDS\nMore than two-thirds of all participants admitted they sometimes or often find managing their use of technology difficult — or that they use it to escape \"sorrow\" or \"negative feelings.\"\nThey also said they've missed sleep due to being on their phones at night.\n\"People feel good and are enhanced by interactions with others … Those feelings cannot be replicated by connecting through a phone.\"\nLicensed clinical social worker Jennifer Kelman in Boca Raton, Florida — who provides expert advice on the Justanswer platform and was not involved in the study — shared some of the negative repercussions of kids spending large amounts of time on their phones.\n\"They lose the ability to have face-to-face interactions, and to converse and connect with others,\" she said in an interview with Fox News Digital.\n\"The phones and all the apps aren’t real-life interactions, and there is beauty in connecting with others face-to-face that is lost,\" Kelman went on.\nKids also lose out on developing problem-solving skills, since they aren't typically tasked with negotiating \"tough spaces\" or navigating human challenges, the expert added.\nBACK TO SCHOOL: TIPS FOR HOMESCHOOLING THE KIDS AS MORE PARENTS DITCH CLASSROOMS\n\"The more apps we use, the more likely it is that we lose parts of ourselves, our confidence and self-esteem,\" said Kelman.\n\"People feel good and are enhanced by interactions with others, and those feelings cannot be replicated by connecting through a phone.\"\n\"Kids' brains aren’t fully developed, so they aren’t able to sniff out who is safe on the other end of the chat or the game.\"\nKelman warned parents that smartphone usage triggers the same dopamine release as drugs, as apps are designed to \"reel kids in and keep them hooked.\"\n\"[Parents] are the ‘drug dealer’ in this analogy, so please think twice before free rein is given,\" she said.\n\"Withdrawal is common as well, so be prepared for a lot of pushback when you try to limit the use of their phones and other tech devices,\" Kelman warned.\nThe therapist's biggest rule for cracking down on daily phone usage among kids is to delay phone access for as long as possible.\n\"Parents are giving their kids phones at young ages and kids are hooked quickly,\" she said.\n\"Forget what friends are doing — and delay this as long as you can,\" she advised.\nIf a cell phone is necessary due to schedules and after-school activities, a kid-safe starter phone like a Pinwheel could be a better alternative, Kelman suggested.\n\"It's a phone that lets parents manage and monitor their usage, but there is no internet and only specific, parent-approved apps that can be turned on and off at will,\" she said.\n\"Better for your child to have a little FOMO [fear of missing out] than to have access to porn, become a victim of sextortion, or lose the ability to truly connect with other people.\"\nKelman stressed that kids \"can’t unsee what they have already seen,\" and that many adult apps may put kids \"in harm’s way.\"\nCLICK HERE TO SIGN UP FOR OUR HEALTH NEWSLETTER\n\"Kids' brains aren’t fully developed, so they aren’t able to sniff out who is safe on the other end of the chat or the game,\" she said.\n\"Kids are coerced into sending photos of themselves, often finding themselves victims of sextortion after they share the photos,\" the expert warned. \"This leads to shame, despair and fear of telling their parents.\"\nParents should vet and monitor all content accessed by their kids, Kelman advised.\nCertain types of content are more harmful than others, noted Shelley Delayne, parent education director at Pinwheel in Austin, Texas, who was also not involved in the study.\nThese include \"attention-mining apps,\" adult images and interactions, user-generated content and \"invisible influences\" that can impact children's worldview, she said.\n\"Take it slow and give them only what they need,\" Delayne recommended.\n\"Delay the introduction of adult online spaces and social media to [age] 16 or older, and stay involved in their digital lives just as much as you are in their physical life.\"\n\"We interpreted this data with assistance from an advisory council of young people to understand the nuanced relationships that young people develop with their smartphones.\"\nShe also said, \"Remember that just because a kid can tap around on a device and make it do stuff doesn't mean they have all the skills they need to be unharmed by it.\"\nIn its report, Common Sense Media said it used \"software to collect data from the smartphones of a diverse group of about 11- to 17-year-olds. We then interpreted this data with assistance from an advisory council of young people to understand the nuanced relationships that young people develop with their smartphones.\"\nCLICK HERE TO GET THE FOX NEWS APP\nIt also provided additional context, noting the study was done with \"Android phone users only, because Apple device tracking does not share with the research community the names of specific non-Apple apps that young people commonly use.\"\nFox News Digital reached out to the group for further comment.\n\nThis article was published by FOX News - Health on 2023-10-01 under the category 'health'.\n\n","id":518}
{"title":"The best portable chargers for your gear","context":"## The best portable chargers for your gear\n\nIf you buy something from a Polygon link, Vox Media may earn a commission. See our ethics statement .\nYour time — and money — is precious. Polygon’s What to Buy has rounded up the best in gaming hardware, entertainment, tabletop, merch, and toys, and how to get them for the best value, so you spend less time shopping and more time enjoying.\nA power bank, also commonly referred to as a portable charger, is an essential purchase for anyone who’s on the go with a phone, tablet, or a gaming handheld like a Nintendo Switch or a Steam Deck. It lets you recharge your precious gadgets one or more times via a USB connection, so you can keep talking, texting, or gaming throughout the day.\nPower banks range in price depending on a few factors: how compact it is, what kind of ports it has, how much battery capacity it contains (typically measured in mAh), and how quickly it can recharge your devices.\nBest portable charger for your phone and tablet\nToday’s phones and tablets may differ in terms of their peak wired charging speeds, yet we’ve found some battery packs that should work well no matter what device you have. It’s true that some outliers, like Samsung’s Galaxy S23 phone, can recharge at 25 W or higher depending on the model, but many other Android phones and iPhones recharge via a wired connection at under 20 W — even less when you’re charging wirelessly.\nHow to pick the best power bank\/portable charger for you Get one that lists the Power Delivery capability (noted as “PD” in the specs), and it should ideally match, or come close to, the peak charging speeds (in watts) of the devices that you intend to charge with it. The batteries we recommend for phones and tablets are also a good pick for the Nintendo Switch. However, the Steam Deck needs more juice, as do some mightier laptops that can receive power via USB-C.\nIn terms of tablets, picking either of the two power bank options we recommend below should be a good fit for what you may have. For reference, all iPads currently ship with 20 W power adapters, and so far, tablets from other manufacturers like Samsung and Amazon haven’t deviated far from that charging speed.\nWhichever you choose, it never hurts to get some extra USB-C-to-USB-C cables. You can get this two-pack at Amazon for $15.99, so you can keep one at home and then put the other in a bag you bring around during everyday travels.\nBest power bank for your Switch\nThe Nintendo Switch console with detachable Joy-Cons can receive a maximum of 18 W through its USB-C charging port (the Switch Lite is slightly less demanding). So, the very same compact power bank we recommend for phones and tablets can be used to charge your Switch.\nSame note as before: We suggest buying more charging cables than you’ll immediately need (stow one permanently in the bag you frequently use). You can get this two-pack of 100 W-ready, six-foot-long, USB-C-to-C cables at Amazon for $15.99.\nRelated The best Nintendo Switch accessories\nBest power bank for your Steam Deck\nEach Steam Deck console includes a 45 W USB-C wall adapter, so it’s a good idea to find a power bank that can meet that power level when you’re on the go. Thankfully, some options exist that can do this. One thing to note during your search is that only batteries that support the PD 3.0 spec, including the two options below, can recharge the Steam Deck at its fastest speed.\nRelated The best Steam Deck accessories\nBest portable charger for your laptop\nThe number of laptops that can recharge via USB-C is growing, making it possible to use the same charger to refill your laptop as you do your phone or Nintendo Switch. For instance, Apple’s entire MacBook lineup allows it, as do several popular Windows laptops, like the Dell XPS 13, Razer’s Blade gaming laptop, and more. The thing is, different laptops have different power requirements, so one power bank may not work well across multiple laptops.\nIf you have a 13-inch MacBook Air or Pro, or a similarly sized Windows laptop, the chances are very good that a 65 W power bank should be fast enough to recharge your laptop as you use it (check your power supply’s wattage to be sure). Keep in mind that if you’re trying to play games, or do other resource-intensive tasks, your battery may recharge slowly, or it may continue to discharge if your power bank isn’t powerful enough.\nFor more powerful laptops, there are bigger, more powerful batteries to match that can supply up to 140 W of recharging power. That’s currently a top-of-the-line spec, costing significantly more than our other options, and you’ll even need a compatible USB-C-to-USB-C cable to reach the 140 W top speed, as well as a laptop that supports the PD 3.1 USB-C charging spec.\nOne of the chargers we recommend below can match the speed delivered by Apple’s 140 W wall charger that’s included with 16-inch MacBook Pro laptops. On the Windows side of things, most laptops don’t go above 90 or 100 W at peak USB-C recharging speed, so you should be set with our picks.\nIt might be tough to justify spending $100 to $150 on a power bank just to charge a laptop. I get it. However, it’s easier to justify getting one if you frequently travel with multiple power-guzzling devices that you’d like to recharge simultaneously, as these are but a few available that can manage multitasking.\nUpdate (Nov. 17): Checked prices and stock for accuracy.\n\nThis article, authored by Cameron Faulkner, was published by Polygon on 2023-11-17 under the category 'entertainment'.\n\n","id":519}