{"title":"The Soccer Star on the Verge of Breaking an 89-Year-Old Record","context":"## The Soccer Star on the Verge of Breaking an 89-Year-Old Record\n\nErling Haaland is just six away from Norway’s goalscoring record, so it is surely inevitable that he will soon be his nation’s most prolific striker ever.\nOn one hand, that will have happened remarkably quickly – Haaland only scored his first goals for Norway in 2020. On the other, this has been an incredibly long time coming.\nGO DEEPER What is Haaland really like?\nOf the 213 FIFA-affiliated nations, Norway’s is the longest-standing outright individual goalscoring record in the world. It was set by Jorgen Juve, a fascinating figure who ended his international career in 1937 and later became a renowned sports journalist in his home country.\nAdvertisement\nJuve scored a relatively modest 33 goals in 45 matches for Norway, including five hat-tricks, although his tally is made remarkable by the fact he played as a centre-forward in less than half of those games. He was otherwise positioned in defence, from where he captained his nation to the bronze medal at the 1936 Olympics. That explains why his final international goal came three years before his final cap, in June 1934. Therefore, it is likely that by the time Haaland scores six more goals, it will be around 90 years since Juve reached the 33-goal mark.\nThere is technically one other record that stands for longer, also in Scandinavia.\nPoul “Tist” Nielsen scored 52 goals in 38 games for Denmark between 1910 and 1925, although his record was equalled by Jon Dahl Tomasson — now manager of Blackburn Rovers in the English Championship — in 2010. Tomasson elected to retire from international football after that year’s World Cup in South Africa rather than seeking to make the record his own. Nielsen’s name therefore remains in the record books, although he now holds Denmark’s record only jointly.\nThis graph demonstrates the extent to which these records are outliers.\nOnly six countries’ goalscoring records have stood for more than 50 years, including Libya, Sudan and Guinea. Therefore, if we only include nations to have qualified for the World Cup, it is only Denmark, Norway and Hungary whose records have lasted more than half a century.\nHungary’s record is perhaps the most impressive, considering Ferenc Puskas scored 84 goals in just 85 games, and his international career was brought to a premature end at the age of 29 because of the Hungarian Revolution. He later represented Spain at the 1962 World Cup, having gone half a decade without playing international football.\nFerenc Puskas (right) playing for Hungary against England at Wembley in 1953 (Barratts\/PA Images via Getty Images)\nThe most striking thing about the graph is how many goalscoring records have been set recently.\nAdvertisement\nSixty-four of the 211 nations’ record goalscorers have appeared for them in 2023, and in terms of time since they were set, the median goalscoring mark has stood for just seven years, which includes the likes of the Republic of Ireland’s Robbie Keane and Paraguay’s Roque Santa Cruz. Increased longevity due to superior fitness levels in the modern game is clearly a major factor, as is the number of relatively new nations on the FIFA list.\nPerhaps the most surprising international goalscoring record is that of Italy.\nGiga Riva’s relatively insubstantial haul of 35 goals has been the mark to beat since World Cup 1974. Not only has it not been matched or eclipsed, but no one has ever got particularly near it — Roberto Baggio and Alessandro Del Piero both reached 27 and that’s as close as anyone has come.\nFor context, four Englishmen have reached 35 goals in that period — Gary Lineker, Michael Owen, Wayne Rooney and Harry Kane. Four Spaniards too — Raul Gonzalez, Fernando Torres, David Villa and David Silva, while Alvaro Morata (on 34) should get there shortly.\nFurthermore, no current Italians seem set to challenge it — Ciro Immobile (with 17) has less than half that tally, turns 34 years old in February, and has been omitted from recent squads. Nobody in Luciano Spalletti’s current squad has scored more than eight international goals.\nItaly’s shortcoming clearly isn’t about a complete lack of prolific strikers — the likes of Christian Vieri, Pippo Inzaghi and Luca Toni all scored heavily at club level. Sometimes it’s been the opposite, with various strikers competing for a starting place, meaning none of them got to dominate the national side for a decade. That said, around a decade ago, there was simply a dearth of prolific Italian strikers to choose from. Antonio Conte used Eder and Graziano Pelle up front at the 2016 European Championship.\nAdvertisement\nThere are also tactical considerations. Not only have Italy traditionally been the most defensive of the major European nations, but their attacking play has generally been based around using a second striker. Baggio, Del Piero and Francesco Totti have all been the golden boy at various — overlapping — stages, with Italy’s No 9 often selected primarily to bring the best out of Italy’s No 10.\nWhat of Norway? They, similarly, were traditionally a defensive-minded side, favouring counter-attacks and long balls. At their peak under Egil Olsen in the mid-1990s, they often used a striker out of position on the wing, where he would challenge for long, diagonal balls.\nNorway’s Jostein Flo, a giant striker often utilised on the right flank, at the 1994 World Cup (Chris Cole\/Allsport)\nBut perhaps the more pertinent thing about Norway is that, historically, they generally haven’t been very competitive.\nThey’ve only ever qualified for four major tournaments — in 1938, 1994, 1998 and 2000 — and have won a combined three matches in those appearances. They’re also similar to Italy in that, at times, they’ve boasted various high-level strikers whose careers roughly overlapped — John Carew, Ole Gunnar Solskjaer, Tore Andre Flo, Steffen Iversen — and at other points have suffered a complete lack of good centre-forwards.\nAt this point in time, Norway appear to have the most prolific striker in Europe, and it’s not unreasonable to consider where Haaland might end up in the all-time international goalscoring charts worldwide, never mind just in relation to his compatriots.\nHaaland is currently averaging nearly a goal a game for his country, which will inevitably be difficult for the 23-year-old to sustain over his career. But it’s worth pointing out how impressive that is, even at this early stage. Again, excluding countries who have never qualified for a World Cup, only the aforementioned quartet of Juve, Riva, Puskas and Nielsen, plus Japan’s Kunishige Kamamoto, hold their nation’s international goalscoring records and also boast a rate of 0.75 goals per game or more.\nEven Cristiano Ronaldo, the most prolific international goalscorer of all time with 127 for Portugal, boasts ‘only’ 0.63 goals per game, a lower rate than the likes of Romelu Lukaku (Belgium), Kane and Aleksandar Mitrovic (Serbia), which owes to his early days as a winger rather than a central striker.\nKane and Ronaldo, two national-team record scorers still operating in 2023 (Burak Akbulut\/Anadolu Agency\/Getty Images)\nConsidering how many hat-tricks Haaland scores for Manchester City, it’s not beyond the realms of possibility that he could score six goals during this international break to move level with Juve, particularly given Norway’s first fixture is a home friendly against the Faroe Islands today (Thursday), before a European Championship qualifier against Scotland in Glasgow on Sunday. That said, the Faroes’ defence is less leaky than you might expect — only twice in their last 22 outings have they conceded more than three times in a game.\nAdvertisement\nThe wider question is whether we will ever see Haaland at a major tournament.\nDespite the presence of him and Arsenal captain Martin Odegaard, Norway have failed to qualify from their Euro 2024 qualification group directly, with Spain and Scotland already securing the top two spots.\nThey are, at least, likely to qualify for the play-offs, and therefore will have two must-win games in March to secure their first major tournament appearance since 2000 — the summer when Haaland was born. But there’s been little in recent performances to think Norway will breeze through those play-offs.\nJuve’s individual record will soon be surpassed, but captaining his side to a bronze medal at the Olympics may stand as his nation’s greatest achievement for much longer.\nGO DEEPER Erling Haaland is phenomenal - so why hasn’t he made Manchester City better?\n(Top photo: Sebastian Widmann – UEFA\/UEFA via Getty Images)\n\nThis article, authored by The New York Times, was published by The New York Times on 2023-11-17 under the category 'sports'.\n\n","id":400}
{"title":"Twitch’s money guy talks about the revenue split controversy and its monetization long game","context":"## Twitch’s money guy talks about the revenue split controversy and its monetization long game\n\nTwitch has had a tense year, in part due to community backlash over policy changes that affect the way creators can monetize their content.\nLast year, the company announced that it would end the 70\/30 subscription revenue split deal that it had offered select streamers in favor of prioritizing ad revenue. In June, Twitch launched the Partner Plus program, a new monetization tier that would grant eligible creators a 70\/30 subscription revenue split on the first $100,000 they make per year. The program further strained its relationship with its community, because the requirements to qualify excluded the vast majority of streamers. Streamers need at least 350 monthly paid subscriptions, and gift subs and monthly subs that come with an Amazon Prime account don’t count.\nIn response, Twitch pivoted eligibility to a points-based system, assigning a value to each subscription tier. The higher-priced subscriptions now count more toward the point total.\n📣 We’re updating how we calculate progress toward the Partner Plus program. To recognize deeper support from your community, Tier 1, 2, and 3 subs will earn you 1, 2, and 6 points respectively towards qualifying for the program. pic.twitter.com\/HdOiLvg3qC — Twitch Support (@TwitchSupport) August 28, 2023\nTwitch also walked back its policy restricting embedded ads and other sponsored content, following fallout from streamers who depend on branded content as the bulk of their income.\nThe company’s CEO Dan Clancy, who took over earlier this year, has prioritized engaging with Twitch streamers, and involving their perspectives in policy changes going forward. The company’s receptiveness to community feedback has marginally lessened animosity from its streamers, and community sentiment toward Twitch at this year’s TwitchCon in Las Vegas was significantly more positive than it was last year. New features and policy changes announced during the convention’s keynote address, including granting streamers more control over ad breaks and allowing simulcasting to other livestreaming platforms, also appeased the Twitch community.\nIn an interview with TechCrunch, Twitch’s Chief Monetization Officer Mike Minton discussed the unpopular policy decisions, supporting smaller creators through branded partnerships and what Twitch is doing to mend its relationship with its community.\nTechCrunch: I’m going to start with a maybe unpleasant question, but Twitch has made some unpopular decisions in terms of monetization. Is there anything that Twitch is doing to appease irate creators?\nMike Minton: Two years ago, we said we’re no longer gonna do these deals that weren’t objective in terms of eligibility criteria. We ended that program. It affected a relatively small number of creators, but what it really impacted was the community going, “I don’t have anything to work for.” And that led to us recently announcing Partner Plus. There was some feedback saying, “Hey, we’re going to need a lot of subs,” and we reacted to it by making it eligible by sub points so that your higher price point subscriptions cost more, and that was actually received quite positively.\nBoth Dan and I have said in different forms, that this is the beginning. It’s not the end and we’re going to continue to work to provide access to higher rev shares as we can over time, to more streamers.\nWhat would that look like?\nThe simple answer is now, 350 was the criteria we established, right? And that number is arbitrary and could easily come down. Now, our target and our goal in this program still remains the same. We’re looking to benefit the creators, where livestreaming is a meaningful part of what they’re doing as a creator. That allows us to focus on those streamers that are really at a point where it will matter most for them in terms of keeping them as a livestreaming creator.\nRight, and that decision to change the revenue split also came out of a decision to prioritize ad revenue. Creators and viewers have said that integrating ads in their streams is very frustrating. What kind of feedback is Twitch going to provide in response to that?\nLet’s level set a couple things. So one of the things we knew with ads, if we’re going to get streamers to buy into ads as a good way to monetize, is that we had to increase the rev share, which we did, and launch the ad incentive program.\nWe’re helping streamers understand that with ad running, you have to think about it consistently over time in order to earn predictable revenue. It’s a very reliable source of income for many streamers.\nSo I think the combination of making it easier to run, increasing the rev share and then recently in the keynote, we talked about two new features to allow moderators to know when an ad break is coming, and adjust the ad break around the content because the problem in livestreaming, as you’re aware, is that people don’t want to miss out. So we’re very focused on improving the ad experience by allowing the ad breaks to be synchronized with the content and enrolling moderations and eventually the community in adjusting those ad breaks.\nLike you said, livestreaming is very different from static content, and tactics for monetization that work for Instagram or TikTok just don’t really work for Twitch or any livestreaming platform. In those cases, what has Twitch done differently from those more standard platforms in terms of making monetization more seamless?\nOne thing we’ve done since the beginning, where we are a leader, is getting people to take their wallets out and support creators through subscriptions, gifting, cheering. I think that sets us as a unique community-based platform where viewers are directly supporting creators in that way.\nOther services have tried it but from what I can tell them, what streamers have told me, is that Twitch is really the leader in that way. We’ve spent a lot of time on advertising, because there’s no social media, content distribution service in the world that doesn’t rely on advertising as a component. So ads have been a big focus.\nAnd the third piece, which is where we’re behind, is sponsorships. We’re now focused a lot on growing sponsorship opportunities for streamers and ensuring that we have three — based on what size you are, where you’re located, how experienced you are, what type of content you’re creating, where you’re located in the world — three options to support you as a creator.\nI’ve spoken to a lot of creators over the course of my career, and a common gripe seems to be that they can’t subsist off of just subs and ad revenue. They have to have these branded partnerships that are difficult to land for midsize creators and smaller creators. What is Twitch doing specifically to diversify its branded partnership content?\nWe have this unique opportunity, being part of the third largest and fastest growing advertising business in the world, AKA Amazon. So what we’re actively working on is, as advertisers that come in through Amazon advertising, that they understand the magic of Twitch, that they can easily set up influencer deals programmatically. And ultimately, you don’t have the measurement that they expect.\nBut because of Amazon’s diversity of advertisers, this is where before it was more focused on endemic advertisers, game publishers, et cetera. And now we’re able to expand that reach to a much broader set of advertisers and serve the needs of both the affiliate marketing end of sponsorships, which is more of a performance model, as well as more of the top of the funnel, where you’re looking for more brand awareness.\nObviously a lot of this discord among Twitch’s community also comes at a time when other streaming platforms like YouTube or Kick are starting to take off, and enticing streamers with better revenue splits. A common complaint that I’ve heard is that bigger streamers are going to be making money wherever they are, but smaller streamers who have less of an audience don’t qualify for Partner Plus will get a better deal at YouTube or Kick than at Twitch. What is Twitch doing to keep those streamers?\nThere are a couple of things that I’ll point out. One is acknowledging what Dan has done as the CEO to get out and engage with streamers, hear their concerns, and really influence our priorities as a company, is really a consequence of him both being an active streamer as well as being extremely engaged within the community.\nAnd then, more broadly for both Jeremy [Jeremy Forrester is VP of Community Product] and myself as the product leaders, building the product is continuing to innovate and ensure that we are absolutely a unique service. Whether that’s features, like we’re working on Stories, whether that’s monetization — it’s all in service of ensuring that livestreaming creators can be more successful on Twitch.\nFor a long time, there was a sort of exclusivity with Twitch, where there were exclusive deals, and simultaneous streaming on other platforms was forbidden. I have to wonder if those decisions to change these policies were in response to competition from other platforms.\nI would say it this way: I think they are an acknowledgement, and maybe a closer connectivity to the community via Dan specifically. I credit Dan in his short time as CEO to really make some big, hard decisions. Both the launch of Partner Plus, as well as simulcasting, the embed stuff we talked about in the keynote — these are three things that I think are very much an acknowledgement of the feedback from the community. We’ve made that change, so I wouldn’t call it out of competitive pressures. I would call it out of focus on the community.\n\nThis article, authored by Morgan Sung, was published by TechCrunch on 2023-10-26 under the category 'technology'.\n\n","id":401}
{"title":"Beeper Mini is back in operation after Apple’s attempt to shut it down","context":"## Beeper Mini is back in operation after Apple’s attempt to shut it down\n\nBeeper Mini, the app bringing blue bubble iMessage texts to Android users, is back in operation on Monday after a long weekend that saw Apple putting an end to Beeper’s services, claiming it was a security risk. Now, the startup behind the new app says it has resumed functioning, but hasn’t disclosed how that’s been made possible. In addition, Beeper Mini will be free for the time being given the unstable nature of Beeper’s status and Apple’s attempts at shutting it down.\nFounded by former Pebble smartwatch founder Eric Migicovsky, Beeper had originally been working on an app that aggregated all of a user’s chat apps into a single interface. However, upon the discovery of new technology that allowed it to reverse-engineer the iMessage protocol, it set out to build a new app called Beeper Mini that solely focused on bringing iMessage chats to Android users for $1.99 per month. That included support for high-quality photos and videos, tapback reactions, typing indicators, read receipts and more.\nThe app quickly climbed into the top 20 in the Play Store’s charts and saw over 100,000 downloads in its first 48 hours, the company claims.\nUnfortunately, Beeper Mini’s success was short-lived. Only days after launching, Apple on Friday night took action against the startup, having found a way to stop Beeper Mini’s messages from being passed from Android phones to its servers. The Cupertino tech giant explained that it needed to shut down the app because it “posed significant risks to user security and privacy, including the potential for metadata exposure and enabling unwanted messages, spam, and phishing attacks.” Essentially, Apple said that it couldn’t verify that Beeper’s claims of end-to-end encryption were true, and therefore it needed to take “steps to protect our users by blocking techniques that exploit fake credentials in order to gain access to iMessage.”\nAs the Beeper team scrambled for a fix, U.S. Senator Elizabeth Warren (D-Mass.) shamed Apple for its intervention in a post on X, formerly Twitter, saying “Green bubble texts are less secure. So why would Apple block a new app allowing Android users to chat with iPhone users on iMessage? Big Tech executives are protecting profits by squashing competitors. Chatting between different platforms should be easy and secure,” she wrote.\nOn Monday, Beeper announced on its blog that it has updated the Beeper Mini app to fix the issue that “caused messages not to be sent or received.” It hasn’t said exactly how it’s made that happen, but notes that the security of Beeper Mini remains unchanged — promising it still includes local, end-to-end encryption as previously described. Migicovsky told TechCrunch he can’t share anything on that topic beyond what’s already in the blog post.\nThough Beeper Mini is running again, there is a caveat: phone number registration isn’t yet working. That means users will have to sign in with an Apple ID. The startup says it’s working to address this too.\nIt has also decided to make Beeper Mini free for the time being, given how “chaotic” things have been over the past few days. “As soon as things stabilize (we hope they will), we’ll look at turning on subscriptions again,” the blog post reads.\nAlthough Beeper did not have its app reviewed by an independent third-party security firm before launch, it’s challenging Apple to put it to the test.\n“If Apple doubts the security and privacy of our app, we’re willing to share the entire Beeper Mini codebase with a mutually agreed upon 3rd party security research firm,” the blog post stated. Asked if they would run an audit without Apple’s participation, Migicovsky tells us he wants Apple to agree on the firm first. The company also said it would be willing to add a pager emoji to metadata on all its sent messages, which would allow the Messages app to filter out messages from Beeper Mini users.\nUsers can get the updated version of Beeper Mini from beeper.com\/update on their phone for the time being as the company has not yet submitted the new version to the Play Store, claiming it needs to do some final testing. But that means users are being asked to sideload the app update onto their devices, which is riskier than downloading from the Play Store, where apps undergo reviews and basic security checks. The app update is now live on Google Play (updated, 1:28 pm ET).\nThe update, which now prompts users to sign in with their Apple ID, also includes new features, like chats that will open at the last unread message and an improved video player, the blog post noted. In tests, signing in with our Apple ID generated an Apple prompt that noted our ID was being used to sign in with a device “near Los Angeles, CA” (where we are not located.) We received an error message “2FA submission error” after updating the app, but an uninstall\/reinstall fixed this. We understand this is a known bug.\nAfter setting up the new Beeper Mini, a message appeared on our iPhone that said: “Device Added to Your Account. A Mac now has access to iMessage,” which offers a hint as to Beeper’s fix.\nApple has not yet gotten in touch directly with Beeper, having only released a statement to the press. It’s unclear at this time if, how, or when it will be able to disable Beeper’s updated build.\n\nThis article, authored by Sarah Perez, was published by TechCrunch on 2023-12-11 under the category 'technology'.\n\n","id":402}
{"title":"Know the price-matching policies for Best Buy, Target, Walmart, and others","context":"## Know the price-matching policies for Best Buy, Target, Walmart, and others\n\nNothing is more frustrating than buying a new pair of headphones, an OLED TV, or a backpack just to find out that you could have gotten it for a lot cheaper somewhere else. In order to keep customers happy — and prevent them from going elsewhere — many retailers offer price-matching policies where they promise to match a lower price you’ve found elsewhere. That’s information that could come in handy now that Black Friday and Cyber Monday are just around the corner.\nWhat follows are the price-matching policies for a variety of major retailers. There are a few things to make note of here. First, all price-matching policies have a number of rules attached to them. We’ve summarized some of the rules here, but you’d be advised to go to the links that we’ve provided and read the policy carefully. Second, and logically enough, retailers that serve as marketplaces for other sellers, such as Costco, don’t have price-matching policies.\nLastly, there are always exceptions to the rules. If you’re looking for a deal on a product and you know it’s available for a lower price elsewhere (or it was previously offered at the same retailer), it never hurts to call or chat with a customer service rep and ask if they’ll match the price. After all, what do you have to lose?\nIf Best Buy offers a better discount than Target on the latest Kindle Paperwhite, Target will refund you the difference. Photo by Chaim Gartenberg \/ The Verge\nAmazon doesn’t offer price matching. Full stop. You can contact customer support, but even if you’re an Amazon Prime customer, they’re not likely going to help you out.\nThat said, Amazon does offer a pretty liberal return policy, meaning you can often return an item you purchased from Amazon if it’s available for less elsewhere (or at Amazon). Then, you can just repurchase the product wherever it’s cheapest.\nAs of October 22nd, Target will match the price of any item purchased online or in-store from Target that goes on sale through December 24th. However, the current price-matching policy doesn’t apply to products you may have bought from one Target store and found for less at another.\nTarget will also match the price of items purchased from Amazon, Best Buy, and a select group of competitors if you ask for it at the time of or within 14 days of your purchase. You must bring the original ad or listing, whether digital or in print, along with your receipt into the store. Alternatively, you can call for online purchases at 1-800-591-3869 or chat online via contactus.target.com.\nBe mindful, however, that Target’s policy excludes doorbusters and competitors’ lightning sales, like those that Amazon offers. It also doesn’t apply to products that require that you log in to see the price, “Marketplace” items from third-party sellers, or lower-priced items purchased from other Target stores.\nBest Buy’s Price Match Guarantee states that a product could be eligible for a price reduction if it’s new, identical to the competitor’s product, immediately available at a qualifying competitor’s store or on its site, and not shown on Best Buy’s exclusion list (which includes “items for sale the Friday before Thanksgiving Day through the Monday after Thanksgiving”).\nTo get the difference, you have to contact Best Buy via its on-site chat and be able to show the ad or website with a lower price point. Alternatively, you can call 1-888-237-8289 or visit any Best Buy or Pacific Sales store.\nBest Buy will also, upon request, match an in-store or online price that was lowered during the return and exchange period, which typically lasts up to 15 days.\nWalmart doesn’t price-match the prices of its competitors, though Walmart’s online store offers price-matching on items purchased from Walmart stores if the item is in stock at Walmart.com.\nHowever, the policy doesn’t apply to those who live in Alaska, Hawaii, or Puerto Rico. Additionally, it doesn’t apply to special event prices, like those seen during Black Friday. Walmart also does not retroactively price-match items bought from Walmart.com that have dropped in price after the time of purchase. The retailer additionally doesn’t price-match items purchased from Walmart Marketplace retailers or third-party sellers.\nApple doesn’t offer a price-matching policy, though you can price-match on devices like the 15-inch MacBook Air — assuming it’s on sale — elsewhere. Photo by Amelia Holowaty Krales \/ The Verge\nWhile we’ve seen some claims that Apple will price-match up to 10 percent for products bought at certain major retailers, there is no official policy on the company’s website.\nApple does say that if it reduces its price on an Apple-branded product within 14 days from when you received your item, you can visit an Apple Store or contact the Apple Contact Center at 1-800-676-2775 to request a refund or get credit for the price difference. However, that doesn’t apply to special sales like Black Friday or Cyber Monday.\nB&H says that it might be able to honor a current lower price or match the price of a competitor, but it does so on a case-by-case basis. You have to contact its Customer Service team using the on-site chat, email, or by calling 800-606-6969 \/ 212-444-6615.\nCostco does not price-match with competitors. However, according to the website, it will issue a credit for the difference between the price a member has paid and a promotional price if you bought the item online at Costco and requested the credit up to 30 days before the change in price. If you bought the product from a Costco warehouse location, visit the membership counter at the store where you made the purchase. Costco doesn’t price-match items bought from Costco warehouses with Costco.com purchases.\nDell will price-match identical products from Dell, Amazon, Best Buy, Walmart, Target, HP, Apple, Lenovo, and a number of other retailers. You can call 1-877-275-3355 or chat online to run a price check, but you’ll need to provide a link to the competitor’s product.\nYou can also contact the company about a price difference within 30 days of purchase. However, there is a long list of restrictions, and none of this is available between Thanksgiving Day and the Monday following Thanksgiving (or on Green Monday).\nAs a general rule, eBay doesn’t match the prices of purchases made during the weeks of Thanksgiving and Cyber Monday. It does, however, offer a generous price-matching policy for items bought before or after that time period. If you find a lower price from a qualifying competitor on an eBay Deal item that you bought within 48 hours — or on another product with the “Best Price Guarantee” symbol attached to it — you’ll get “110 percent” of the difference. That means eBay will give you an eBay coupon for the difference in price between what you bought the item for and what the competitor is selling it for, plus an additional 10 percent of that price difference. Note, however, that these coupons will expire within 30 days of being issued.\nThe products must be new, unopened, and identical to the competitor’s item. You have to contact eBay Customer Service, and if they verify your claims are legitimate, you will receive the coupon and be able to use it toward your next eBay purchase.\nGameStop does not mention an official price-matching policy on its website. Last year, however, GameStop tweeted that the store will price-match items sold and shipped by Amazon as long as they’re available online or in-store. Although GameStop only mentioned Amazon in the tweet, others have reported that the store will price-match items purchased from Target and elsewhere.\nGoogle will match online pricing from select retailers — specifically Amazon, Best Buy, Walmart, B&H Photo, and Target — if a request is made within the standard return period. It doesn’t, however, match preorder pricing from other retailers or carrier deals. The product also must be identical, right down to the color and configuration, and must be in stock. Plus, you need to provide a public link to the promo page or product listing to verify the rival’s price.\nYou may also get the difference if a product purchased from the Google Store lowers in price within the standard return period. To get the price match or correction, contact Google.\nThe Home Depot will match the price of identical, in-stock products from other retailers, except for membership-based wholesalers. The price-match policy does not apply to special events like Black Friday, though, and you must bring the ad or listing with you in-store to the register. Additionally, The Home Depot will only honor requests submitted by the original buyer — no friends or family allowed.\nYou could potentially buy HP’s Spectre x360 14 at a lower price thanks to HP’s price-matching policy. Image: Monica Chin \/ The Verge\nAccording to HP’s website, the company will match the current pre-tax price for new comparable PCs and identical HP printer, display, and accessory model numbers from nationally recognized online retailers, such as Dell, Amazon, Newegg, and Best Buy. The specs have to be the same, but the product model number does not need to be identical for computers. You have to ask for the match at the time of purchase by calling 1-800-888-0229. You can’t request a price match via email or chat, though, and the policy does not extend to items bought during promotional periods. It also doesn’t apply to membership stores like Costco and Sam’s Club.\nIf you find a comparable product at a lower price during the return period, you can email HP at myhpsales@hp.com. This only applies to branded HP products and doesn’t apply to products purchased during certain promotional events. This includes Green Monday and products on sale during the week of Thanksgiving and the week after.\nLenovo matches pricing on comparable PCs from Lenovo, HP, or Dell with the same key specs as long as they’re sold through a list of recognized retailers. The comparable PC must also be in stock and readily available from both Lenovo and the competing retailer, and you have to contact a Lenovo sales rep in order to facilitate the match.\nThat said, you can’t take advantage of coupons or special discounts while receiving a price match, and the policy doesn’t apply to membership stores like Costco. The policy also doesn’t apply to “Marketplace” items where third parties fulfill the order, so double-check that you bought the product directly from the retailer.\nLenovo also offers a price guarantee refund for laptops and personal desktop computers bought from Lenovo.com within 30 days of purchase. To receive a refund, you must contact Customer Care and show the lower price of the identical product offered on Lenovo.com. This policy doesn’t apply to doorbuster or clearance products, however.\nLowe’s will match the price of identical, in-stock products when you present an ad, product listing, or photo from a qualifying online or local retailer, including Amazon, Best Buy, Target, and Walmart. The product must be purchased directly from the retailer and not a third-party seller, however, and it doesn’t apply to special sales like Black Friday and other various holiday promotions. Lowe’s also doesn’t match prices from one Lowe’s store to another. To request a price match, head to the store, call 1-877-465-6937, or chat online.\nIf Microsoft lowers the price of the Xbox Series X, Microsoft could refund you the difference. Photo by Vjeran Pavic \/ The Verge\nNow through January 31st, Microsoft will refund you the difference if it drops the price of a physical product purchased online from the Microsoft Store. The same policy also applies if you find the product on sale at a lower price at a qualifying retailer, such as Amazon or Best Buy.\nYou can contact Microsoft’s Sales and Support team at 1-877-696-7786 to get a refund. If you purchase an item from a Microsoft Experience Center, you’ll have to go back to that location with your receipt.\nNewegg offers price matching on select items; these products are identified by the label “Price Match Guarantee” that appears in the price box on the right side of the product page. This applies whether you find that lower price on Newegg or at what Newegg judges to be a major retailer. Regardless, you need to notify Newegg of the lower price within 14 days of purchase. You’ll then be issued a credit you can use on the Newegg website, though you’ll only have 90 days to do so.\nNewegg’s price-match guarantee is not valid during major holiday sales events, including Black Friday, Cyber Monday, and Green Monday.\n\nThis article, authored by Barbara Krasnoff, was published by The Verge on 2023-10-25 under the category 'technology'.\n\n","id":403}
{"title":"The best Black Friday headphone deals from Sony, Apple, Bose, Beats and more","context":"## The best Black Friday headphone deals from Sony, Apple, Bose, Beats and more\n\nEngadget has been testing and reviewing consumer tech since 2004. Our stories may include affiliate links; if you buy something through a link, we may earn a commission. Read more about how we evaluate products.\nBlack Friday is often a boon for deals on headphones and earbuds, and this year is no different. The shopping holiday has brought a plethora of deals on all kinds of headphones, include several top picks from our guides to the best wireless headphones, wireless earbuds, budget wireless earbuds and gaming headsets. Other popular models from the likes of Sony, Beats, Bose and Apple are discounted as well. All of this means it's an ideal time to pick up a new set, whether it's to give as a gift to someone on your holiday shopping list or just to replace your own aging cans. To help you get a good bargain, we've rounded up the best Black Friday deals on headphones and earbuds we could find for 2023.\nSony WH-1000XM5\nPhoto by Billy Steele \/ Engadget Sony WH-1000XM5 $328 $400 Save $72 Black Friday has brought the top pick in our guide to the best wireless headphones back down to its all-time lowest price. $328 at Amazon\nThe Sony WH-1000XM5 is down to $328 at Amazon, B&H and other retailers, which is a $72 drop and ties the lowest price we’ve seen. This is the top pick in our guide to the best wireless headphones, and we gave it a review score of 95 last year. Its active noise cancellation (ANC) is among the better options we’ve tested, its design is comfortable to wear over extended periods and its battery lasts a solid 30 or so hours per charge. The sound goes heavy on the bass by default, which should please fans of hip-hop and pop music, but you can customize the EQ curve through Sony’s app. Like many Sony headphones, it also comes with a number of useful bonus features; “Speak-to-Chat,” for instance, automatically pauses your music when you start speaking.\nSony WF-1000XM5\nFor an in-ear pair, the Sony WF-1000XM5 is also on sale for $248 at Amazon, B&H and others. (Yes, Sony’s headphone naming scheme is bad.) That matches the lowest price we’ve seen and comes in $52 below Sony’s usual list price. This set tops our list of the best wireless earbuds and earned a score of 87 in our review this past July. Like the over-ear XM5 above, it offers a host of useful features, a warm yet customizable sound, powerful ANC and a comfortably snug fit that naturally isolates a good chunk of outside noise on its own. Battery life should sit around seven to eight hours with average use.\nSony WH-1000XM4\nIf you don’t want to pay up for Sony’s highest-end noise-canceling headphones, Amazon, Adorama and B&H have the older Sony WH-1000XM4 down to $248 as well. While that isn’t an all-time low, it’s $100 off Sony’s list price and a little lower than the usual sale price we’ve seen over the course of the year. The XM4 delivers similar ANC and battery performance as its successor and has nearly the same feature set. Unlike the XM5, it can also fold up for easier storage. However, its mics aren’t as clear for calls, it’s a little bulkier (though it’s still comfy) and it sounds a bit boomier out of the box. But at this price, it’s still a strong value. We gave it a 94 in our review back in 2020.\nApple AirPods Pro\nApple’s AirPods Pro are on sale for $190 at Amazon, Walmart, Target and Best Buy. That's $60 less than buying from Apple directly and ties an all-time low. This is the “best for iOS” pick in our wireless earbuds guide thanks to its suite of helpful Apple-specific features, including hands-free access to Siri, quick pairing with iPhones and device tracking through Apple’s Find My network. Effective (if not class-leading) ANC, a superb transparency mode and a pleasantly warm sound also stand out. That said, the Pro’s six-hour battery life is just average and, as with any set of AirPods, you pretty much have to be a dedicated Apple fan to get the most out of it.\nThis deal applies to the latest iteration of the earphones, which come with a USB-C charging case. If you don’t mind using a Lightning charging case, Walmart has the previous version on sale for a new low of $169. Either way, we gave the AirPods Pro a review score of 88 last year.\nApple AirPods (3rd-gen)\nThe third-gen AirPods are available for $140 at Amazon, Target, Best Buy and others. Typically, these wireless earbuds have retailed between $10 and $20 higher in recent months, but steeper discounts have been uncommon. We gave this pair a review score of 88 back in 2021: There are certainly better-sounding options for the money, but the third-gen AirPods sound noticeably richer than their predecessor, and their haptic touch controls are altogether more convenient. This is another open design, though, so there still isn’t much in the way of deep bass or noise cancellation. Not everyone will find the wider earpieces comfortable either.\nApple AirPods (2nd Gen)\nThe second-gen AirPods are down to $80 at Amazon and Target, which isn’t an all-time low but comes in roughly $20 below the pair’s usual street price in recent months. These are Apple’s entry-level wireless earbuds, having launched way back in 2019. They’re a bit tougher to recommend these days, as their one-size-fits-all design won’t fit everyone and you can get better sound quality even at this discounted rate. But if you prefer an open design that doesn’t completely seal off your ear canal or just want the typical AirPods conveniences for as cheap as possible, this is at least a more acceptable price.\nApple AirPods Max\nApple’s top-of-the-line headphones, the AirPods Max, are discounted to $450 at Amazon and Best Buy. That’s $20 more than the lowest price we’ve seen but about $30 below the pair’s usual street price. Apple itself sells the headphones for $550. The AirPods Max are still overpriced for most even with this discount, but they remain undeniably premium, with top-tier ANC, a superbly balanced sound profile, a high-quality aluminum design, reliable controls and all the usual AirPods features. They’re hefty, though, and their included “case” is bafflingly flimsy. We gave the AirPods Max a review score of 84 in late 2020.\nBose QuietComfort Ultra Headphones\nBose’s new QuietComfort Ultra Headphones are $50 off at multiple retailers, bringing the over-ear cans down to $379. Outside of a very brief drop a few weeks back that may have been a pricing error, this is the first significant discount we’ve seen. Bose only released the QuietComfort Ultra last month. We gave it a score of 86 in our review, praising its predictably comfy design, outstanding ANC, above-average call quality and bassy default sound. We still recommend the Sony XM5 to most, as that pair offers a wider feature set and the ability to be used passively (i.e., without being turned on), but the QuietComfort Ultra may still be worth a look if you must have especially powerful noise cancellation.\nWe’ll also note that the new, non-Ultra QuietComfort Headphones are $100 off, bringing them down to a new low of $249. We haven’t reviewed this model yet, but it’s the follow-up to 2021’s QuietComfort 45, which we generally liked. Other reviews suggest it has a more bass-heavy sound, though, and we’d expect it to be a slight step down from the Ultra across the board.\nBose QuietComfort Ultra Earbuds\nThe new Bose QuietComfort Ultra Earbuds, meanwhile, are down to $249 at several stores. That's another $50 discount and an all-time low. We gave these in-ears a review score of 88 in September and recently named them the “best for noise cancellation” pick in our wireless earbuds buying guide. As that title suggests, the main reason to consider this pair over the Sony WF-1000XM5 is its ANC performance, which is the strongest we’ve tested from a true wireless model. We also enjoy Bose’s spatial audio tech. But the earpieces are on the larger side, the call quality and battery life (at six-ish hours) are just OK and there’s no support for multi-device pairing.\nBeats Fit Pro\nThe Beats Fit Pro is back down to $159, which isn’t an all-time low but is still roughly $20 below its average street price. This is the “best for workouts” pick in our wireless earbuds buying guide, as it packs many of the iOS-friendly conveniences of Apple’s AirPods in a sportier and more stable design. It also uses physical control buttons instead of touch panels, and its punchy sound plays well with most popular music. But it can’t connect to multiple devices at once, it doesn’t support wireless charging and its ANC, while fine, isn’t as capable as the AirPods Pro’s. The Fit Pro earned a score of 87 in our review from 2021.\nBeats Studio Pro\nThe Beats Studio Pro is down to $170 for Black Friday at Amazon, Target and Best Buy. That tops the pair’s previous low by $10 and falls about $130 below its average street price in recent months. The Studio Pro isn’t a top pick in any of our guides, but we gave it a solid review score of 81 in July. Its sound is largely pleasant and even-handed, its ANC is strong enough to be useful and it can stream higher-quality audio if you connect over a USB-C cable. It works well with both iOS and Android, too, though it doesn’t support multi-device pairing on the former. There’s no auto-pausing when you remove the headphones, either, and the design is mostly made of plastic. But if you like the Beats style, those flaws should be a little easier to accept at this price.\nAmazon Echo Buds (2023)\nWe recommend the Amazon Echo Buds in our budget wireless earbuds guide to those who hate the feeling of traditional in-ear headphones. They’re now down to $35 for Black Friday, a $15 drop that matches an all-time low. The Echo Buds have a semi-open design, so they let in a good amount of outside noise and can’t produce deep bass, but some will find the shape preferable to a pair that sticks in their ear canals. They can sound perfectly decent with a bit of EQ tweaking, while features like multi-device pairing, wear detection and hands-free Alexa are all nice to have. However, there’s no wireless charging, the battery life (five or so hours per charge) is mediocre and the IPX2 sweat-resistance rating is too weak for the gym. Amazon’s companion app is rather bloated too. But those shouldn’t be deal-breakers for $35. We gave the Echo Buds a review score of 77 in July.\nAnker Soundcore Space A40\nThe Anker Soundcore Space A40 is one of the best values in wireless earphones at its normal price of $79, but now it’s down to $54 for Black Friday. That ties the lowest price we’ve tracked. The Space A40 tops our guide to the best budget wireless earbuds because it delivers most of the features we expect from headphones that cost twice as much. It’s comfortable, its ANC is genuinely capable, its battery lasts up to 10 hours per charge, its tiny case supports wireless charging and it can pair with two devices at once. Its warm sound will be pleasing enough for most by default, but it can also be customized through a clean companion app. The only major downsides are middling mic quality and a lack of auto-pausing when you remove an earbud.\nAnker Soundcore Liberty 4 NC\nThe Anker Soundcore Liberty 4 NC is the runner up in our budget wireless earbuds guide, as it offers a highly similar feature set as the Space A40 but comes in a larger “stem” design reminiscent of Apple’s AirPods. It has a more bass-forward sound by default, which some may find fatiguing, but it also has slightly more extensive touch controls and technically supports wear detection. Right now the Liberty 4 NC is down to $70 at Amazon, B&H and Best Buy, which beats its previous low by $10 and falls $30 below Anker’s list price. If you prefer this kind of bulkier but easier-to-remove shape, this is an excellent value.\nAnker Soundcore Space Q45\nIf you’re after a wallet-friendly pair of noise-canceling over-ear headphones, Anker’s Soundcore Space Q45 is worth a look at its Black Friday price of $100. For that amount, this pair’s better-than-average ANC, softly padded design and multi-device pairing make for a strong value. Its V-shaped sound profile isn’t especially detailed, but it can work well enough for pop music and it’s customizable through Anker’s app. Call quality is mediocre, however. This $50 discount matches the lowest price we’ve tracked, and it's available at both Amazon and Anker's online store; just use the on-page coupon for the latter.\nAudio-Technica ATH-M20xBT\nThe Audio-Technica ATH-M20xBT is a modest $10 off for Black Friday, bringing the wireless headphones down to $69. We saw this pair fall to $55 during Amazon’s Prime Day sale in July, but this is about as low as it’s been outside of that. The M20 is the budget pick in our wireless headphones guide thanks to its comfortable fit, 60-hour battery life, multi-device connectivity and relatively detailed audio quality. It lacks ANC and doesn’t have the sturdiest design, but it should do the job if you just need a no-frills wireless headphone for cheap.\nEarFun Free 2S\nThe EarFun Free 2S is down to $24.59 at Amazon with a Prime-only discount and the checkout code FREE2SPD1. That’s an all-time low. The Free 2S is the “best under $50” pick in our budget wireless earbuds guide. It has a hugely bass-forward sound out of the box, but some may enjoy that with hip-hop or EDM and the profile is customizable through the EarFun app. The earpieces are comfortable and fully waterproof, the battery lasts around seven hours, and the suite of touch controls work reliably, which isn’t a given in this price range. There’s no ANC, multi-device connectivity or wear detection, however, and the built-in mic will pick up wind noise if you’re on a call outside.\nSamsung Galaxy Buds 2 Pro + $10 Amazon gift card\nThe Samsung Galaxy Buds 2 Pro are on sale for $160 for Black Friday, and you can get them with a $10 Amazon gift card for no extra cost. That’s a good way from their all-time low — they very briefly fell to $105 last year — but it’s still $30 or so less than their average selling price in recent months. While the Galaxy Buds 2 Pro aren’t a top pick in any of our guides, they’re worth a look if you use a Galaxy phone, as they can quickly pair with and swap between other Samsung devices (including TVs) and support a higher-quality audio codec on the company’s handsets. More generally, this is one of the better sounding pairs of wireless earphones we’ve tested, with impressive clarity and well-controlled bass, and the buds themselves are both comfortable and waterproof. You can’t connect to two devices at once, however, and the five-hour battery life is poor. We gave the Galaxy Buds 2 Pro a review score of 86 last year.\nJabra Elite 3\nAnother pick from our budget wireless earbuds guide, the Jabra Elite 3, is down to $40 at Best Buy. That matches the best price we’ve tracked. This pair’s mildly bass-boosted sound is great for the money, and its snug, IP55-rated design is well-suited for workouts. It’s a relatively basic set, though, as it lacks ANC, multi-device pairing, wireless charging and wear detection. But those omissions are easier to accept for $40. We gave the Elite 3 a score of 88 in our review from September 2021.\nJLab Go Air Pop\nThe JLab Go Air Pop is available for $17 at Amazon, which isn't an all-time low — the pair was briefly down to just $10 at Walmart earlier this week — but still takes about $6 off their usual going rate. We highlight the Go Air Pop as an honorable mention in our budget wireless earbuds guide. Its IPX4-rated design is light and generally comfortable, its battery lasts around eight or nine hours per charge and, unlike many cheap earphones, its touch controls actually work. Its boomy sound profile won’t win any awards, predictably, but it’s well beyond serviceable for less than $20. JLab even bakes three different EQ presets directly into the earphones. If you’re looking for a cheap backup to your main wireless earphones, this is a great value.\nGoogle Pixel Buds Pro\nThe Google Pixel Buds Pro are available for a new low of $115 at Wellbots, which is about $50 off their average street price. Other retailers like Amazon and Best Buy have them for $5 more. We call the Pixel Buds Pro the best option for Android users in our wireless earbuds buying guide due to their tight integration with the OS (and Google’s Pixel phones in particular). Their ANC and V-shaped sound are solid (if not superlative) as well, and they can last between up to 11 hours depending on how often you use the former. The fit may be tricky for those with smaller ear canals, though. We gave this pair a score of 87 in our review last year.\nBeyerdynamic DT 900 Pro X\nBeyerdynamic's DT 900 Pro X headphones are down to $249 at Amazon and Target from a trusted third-party seller. That’s only $20 off their usual going rate, but we haven’t seen many larger discounts over the past few months. The DT 900 Pro X is a wired pair of open-back headphones designed for critical listening at home. It’s currently the top pick in our guide to the best headphones for gaming, as its wonderfully spacious sound does well to envelop you in the fine details of any given game. Like most open-back cans, it can’t produce truly deep sub-bass, but it delivers enough low-end to give in-game explosions a powerful sense of impact. A set of soft velour earpads keep the whole thing comfortable, though it can’t fold up, and the open design means it won’t block much external noise when you’re outside of the house.\nSennheiser HD 560S\nThe Sennheiser HD 560S is another open-back pair of wired headphones we highlight in our gaming headset guide. It’s down to $150 at Amazon, B&H, Sennheiser’s online store and other retailers — that’s not an incredible deal, as the pair often sold for the same rate earlier in the year, but it’s about $30 less than the street price we’ve seen since the summer. Regardless, the HD 560S offers a pleasingly balanced, spacious and detailed sound profile and a frame that’s comfortable to wear for extended periods. It can sometimes sound a little piercing in the treble, it’s not as sturdily built as the DT 900 Pro X and, again, it’ll leak and let in lots of noise. But if you want audio-centric headphones for less than $200, this is one of the better options in the price range.\nIn other Sennheiser deals, the Drop X Sennheiser HD 6XX is on sale for $169 at Drop, a $50 discount that’s only $10 more than the lowest price we’ve tracked. We haven’t formally reviewed this pair, but Engadget’s audio expert Billy Steele gave some positive impressions in a hands-on way back in 2016, and the pair upon which it’s based (the Sennheiser HD 650) has long been a favorite among audiophiles. If you’d prefer an open-back pair with a little more bass warmth, it might be worth a look.\nAstro A40 TR\nOur favorite dedicated gaming headset for most people, the Astro A40 TR, is down to $100 at Amazon. That’s a $30 discount. This deal bundles the headset with Astro’s MixAmp M80, an optional amp that connects to Xbox controllers and provides various audio controls. Even without the accessory, we like the open-back A40 for providing a wider soundstage than most gaming headsets. It’s not as open or detailed as the Beyerdynamic DT 900 Pro X or Sennheiser HD 560S, and it misses more detail in the treble range, but it’s immersive, with a slight bass boost gives in-game effects a little extra boom. The headset as a whole looks “gamer-y,” but it’s comfortable. And while its built-in mic isn’t the clearest we’ve tested, it’s at least serviceable for basic chat.\nHyperX Cloud Stinger 2\nIf all you want is a decent gaming headset for as little as possible, the HyperX Cloud Stinger 2 is worth considering at $35. That’s only $5 below its usual going rate, but it matches the lowest price we’ve seen. The Cloud Stinger 2 is the budget pick in our gaming headset guide: It sounds narrower and less balanced than the Astro A40, but its built-in mic is great for the money and its bass-heavy profile at least makes action scenes feel a little more exciting. It’s all comfy, too, though it’s largely made of plastic.\nLogitech G535\nThe Logitech G535 is another honorable mention in our gaming headsets guide, one that should specifically appeal to those who want a wireless option for less than $100. If that’s you, good news: It’s available for just under $80 at Amazon, B&H and Best Buy, which is about $25 off its usual street price. The G535’s noticeably light frame, relatively balanced sound and Bluetooth support all impress for the price; just note that it doesn’t work with Xbox, and that its mic sounds a bit thinner than the wired headsets highlighted above. Its battery life clocks in at 30 to 35 hours per charge, which is decent but not great.\nShokz OpenRun Pro\nPhoto by Jon Turi \/ Engadget Shokz OpenRun Pro $125 $180 Save $55 If you want a pair of headphones that don't totally shut you out from the outside world, the bone-conducting Shokz OpenRun Pro are worth a look. $125 at Amazon\nThe Shokz OpenRun Pro is back down to $125 for Black Friday, which is $25 more than its all-time low but $55 less than its usual street price. These are bone conduction headphones, which means they go around the side of your head and deliver sound via vibrations to your skull. If you want to listen to music and podcasts without totally blocking the outside world, they might make sense. The flipsides are that they’re harder to use in noisier areas and, generally speaking, not as full-sounding as traditional in-ear headphones. Engadget Editor Jon Turi found this pair to deliver more low-end depth than most of its peers, however. It can also last up to 10 hours per charge.\nYour Black Friday Shopping Guide: See all of Yahoo’s Black Friday coverage, here. Follow Engadget for Black Friday tech deals. Learn about Black Friday trends on In The Know. Hear from Autoblog’s experts on the best Black Friday deals for your car, garage, and home, and find Black Friday sales to shop on AOL, handpicked just for you.\n\nThis article, authored by Jeff Dunn, was published by Engadget on 2023-11-24 under the category 'technology'.\n\n","id":404}
{"title":"Kick streamers consider leaving over CEO’s comments in a sex worker ‘prank’ stream","context":"## Kick streamers consider leaving over CEO’s comments in a sex worker ‘prank’ stream\n\nKick streamers consider leaving over CEO’s comments in a sex worker ‘prank’ stream With little moderation, many question if Kick is safe. Others can't afford to stop streaming.\nStreamers are leaving Kick en masse in protest of the platform’s lack of safety guidelines, after a prominent creator streamed an encounter with a sex worker without informing her that there were other people present. She was briefly prevented from leaving after she expressed discomfort, while Kick’s CEO posted laughing emotes in the stream chat.\n“It sucks to see a platform stand behind someone who clearly doesn’t respect sex workers or their safety,” Rachel, a streamer known as TheFoodieWaifu, told TechCrunch. “This was a job for her and to them a game. This woman clearly was afraid and was just trying to work and be safe.”\nPaul Denino, a creator also known as Ice Poseidon, streamed the encounter on September 21. The interactions with the sex worker took place in a living room, while Denino and fellow streamer Sam Pepper hid in an adjacent bedroom. The stream shows another man, named Andy, paying the sex worker $500 and asking for her consent to film. When the encounter became physical, Denino and Pepper made noises behind the door, which startled the woman. She tried to leave after receiving a text about the people in the other room, but Andy stopped her. When Andy reminded her that he had already paid her, she said the encounter was “creepy.”\n“Why is it creepy?” Andy said. “It’s you and me and no one else.”\nIn a post days later, Denino disputed claims of a “hidden camera” and alleged that the interaction was legal. Denino streamed from Brisbane, Australia, where sex work is legal in licensed brothels or if a sex worker is working in private and alone. He also posted footage of a call allegedly asking the sex worker he could film her, which she approved for an extra fee. Later in the clip, he tells Andy that he can’t block the sex worker from leaving.\n“Where’s the mention that you two were hiding in the room? Creepy as fuck,” Repzion, another creator who streams on Kick, replied. “Did she consent to that? When she found that out, she left because she was uncomfortable. It’s shitty regardless.”\nKick has lured disenchanted Twitch streamers away from the platform with non-exclusive streaming deals, light moderation and a coveted 95\/5 revenue split. The platform is young, but its first year has been checkered with controversy — starting with its ties to a crypto gambling site also owned by Kick CEO Eddie Craven. The most recent scandal is a wake-up call for many of its streamers — especially women who question if the platform is safe for them at all.\nThe platform addressed the incident in a public post earlier this week, affirming that community and public safety “cannot be compromised” in content creation.\n“We’re continuously learning where this balance sits and are making changes daily,” the post continued. “We appreciate our community for the continuous feedback, both the good & the bad. We’ll keep you updated on upcoming changes to community guidelines and subsequent enforcement measures.”\nKick did not respond to TechCrunch’s request for comment. In a statement to 404 Media, the company said that they “continuously review and refine” its policies, but may not disclose specific details “for privacy and confidentiality reasons.”\n“We aim to maintain a fair and consistent approach to content moderation while respecting the privacy of our users and employees,” the statement said.\nThe company also removed Denino from the front page and featured category, which Bree, another Kick streamer, described as a “start.” Returning to Twitch isn’t an option for her, she said, because of the harassment she faced on the platform.\n“Kick’s decision not to ban him does hurt, but I do think that from a business standpoint with contracts involved you can’t just ban someone,” she said in a DM. “I feel like a lot of people are focusing on this while our time could be better spent working together to make our platform better.”\nSo many people will say “oh go back to twitch”… I can’t. That platform let creators openly harass, bully, abuse, oppress and threaten my life multiple times. I don’t feel safe there and I never will. I’m stuck rn. This is my livelihood and how I keep a roof over my head. — Bree (@KickBree) September 24, 2023\nKick’s pallid response infuriated both streamers and viewers. Bob, a creator known as BobDuckNWeave, described the incident as “just sickening” and criticized the platform’s “non-response.”\n“I understand consent was in fact given by the woman on stream, but the premise alone was bad enough for a site seemingly focused on gaming\/creative content,” he said over DM.\nHe is one of many streamers who vowed to leave the platform in the aftermath of the incident.\nIn a thread announcing his departure, he apologized for his association with the platform, and told TechCrunch that he thought it would get better.\nBob acknowledged that the platform has had a string of controversies in its short existence — most recently, an offensive fake interview between white supremacist sympathizer Adin Ross, accused sex trafficker Andrew Tate and a Kim Jong Un impersonator — and that seeing Craven laughing at the sex worker was “more than enough to stamp out any hope that the platform intends to improve any of its policies.”\nRachel, who also makes cooking videos on YouTube, also decided to leave Kick despite the opportunities it gave her as a smaller creator. She started streaming on the platform because she was burning out on Twitch, and believed that Kick would figure out stronger moderation with time.\n“I can’t stand behind a platform that thinks it’s OK to view people as objects,” she said in a DM. “I am not saying if folks choose to stay on the platform that they are for encouraging this behavior. I am saying that for me, I can no longer say I stream on Kick. This will be a [financial] hit most definitely, not as much for some bigger streamers, but still enough to feel it with inflation being at its highest right now.”\nBut others can’t afford to take the hit, and can’t rely on Twitch alone to pay their bills.\nThe default sub (subscription) revenue split for Partners is 50\/50, but select streamers were offered a premium 70\/30 deal until last year. Twitch cut that deal in favor of the platform’s ad revenue program, which angered many of its most loyal creators. Partners grandfathered into the agreement were still paid a 70% cut of the first $100,000 they earned, and 50% of any revenue after that.\nThe platform rolled out a new Partner Plus program this year, which allowed qualifying streamers to apply for the same deal given to streamers grandfathered into the 70\/30 split. The steep requirements excludes the majority of Twitch Partners and doesn’t count gifted subs toward the minimum subscription requirement, further straining the relationship between the platform and its creators. Although Twitch adjusted the program so that higher tier subscriptions count for more points toward the minimum subscription requirement, it wasn’t the change that streamers were requesting.\nKelly, a streamer known as MrsViolence, joined Twitch when it was still operating as Justin.tv. She began streaming full time when she had to step away from her esports coaching and hosting career for her health. Like many streamers who joined Twitch before its explosive pandemic growth, Kelly was offered a 70\/30 revenue split. About a year ago, before Twitch axed the premium revenue deal, Kelly’s Twitch income was a little over $1,000 per month (up to $1,200 on a “really good month”) with over 700 paying subscribers. She supplemented her income with tips and OnlyFans subscriptions.\nWhen the revenue split changes went into effect earlier this year, Kelly’s monthly income fell to about $400. Since she stopped prioritizing her Twitch channel, her monthly Twitch income hovers around $120. That prompted her to start streaming on Kick, where she said she makes over $1,000 per month with only 145 subscribers.\n“That’s covering all of my rent and groceries and then like a night out with my boyfriend,” Kelly said in a call with TechCrunch. “So I don’t care if it’s run by some gambling, underground Dark Web loser. It’s making people money and it’s helping them in the worst economic depression we have ever seen.”\nThat’s not to say that Ice Poseidon’s stream didn’t affect her.\n“I broke down in tears,” she continued. “I was like, now I’m part of this website that has pieces of shit running fucking wild and there’s nothing I can do about it, and I refuse to go back and make pennies on Twitch.”\nAs a creator who’s been working in the games industry for more than a decade, Kelly said she’ll continue making content wherever she can make money, because her chronic health conditions prevent her from returning to in-person hosting and coaching. She experienced “just as much abuse” as a woman on Twitch, and isn’t optimistic about other livestreaming platforms like Rumble or YouTube. Kelly added that in its early days, Twitch was just as unmoderated and violently misogynistic as parts of Kick are today. The streaming community can’t rely on platforms to operate in the best interest of their creators, she said, and instead has to hope that local governments will step in to regulate safety.\n“I feel very small. There’s nothing we can do and it’s a fight that I think too many people are investing their lives in, and changing their careers over, their money, their income, because of something you can’t change,” Kelly said. “I’m very numb. Desensitized is a great word. I feel for people, I get it. But at the same time I got to survive in this dumb world. Like, gas is up again!”\n\nThis article, authored by Morgan Sung, was published by TechCrunch on 2023-09-30 under the category 'technology'.\n\n","id":405}
{"title":"NBL Round 4: Creek pours in points as Phoenix swamp Sixers, CJ claims Kings didn’t look after DJ","context":"## NBL Round 4: Creek pours in points as Phoenix swamp Sixers, CJ claims Kings didn’t look after DJ\n\nGun import Jordon Crawford has exploded late to lead the Tasmania JackJumpers to a club-record score in a 105-95 NBL road win over the defending champion Sydney Kings.\nThe American guard opened the final period at Qudos Bank Arena on Sunday with four consecutive three-pointers and scored all of his team’s points on a stunning 14-2 run.\nIt gave the JackJumpers a game-high 19-point lead and just about put the result to bed after Sydney had lost Jaylin Galloway (shoulder) and Jonah Bolden (fouled out).\nFacebook Twitter Whatsapp Reddit Email Share\nThe Kings never gave up but could not close the gap as Crawford finished with a game-high 32 points.\nFellow import Milton Doyle and Majok Deng each scored 17 for Tasmania, who recorded their second win over Sydney in as many attempts this season.\n“I had a couple of opportunities where I’m open and I shot the ball,” Crawford said. “Marcus (Lee) and Majok were setting great screens and in order for me to get those shots, them guys have to get me open.\n“They did a hell of a job in doing that and it was a team effort. The ball was hot, the ball was moving and everybody contributed today.”\nAdvertisement\nSydney only had themselves to blame for the loss as they went 10-of-37 from three-point range.\nJaylen Adams (18 points, 10 rebounds) and Jordan Hunter (16, five) couldn’t lift the Kings over the line.\n“Sometimes you just miss shots,” Kings coach Mahmoud Abdelfattah said.\n“We’ve been practising these for the last two-and-a-half months, we got some great looks and at the end of the day that’s the difference.\n“When you’re missing a ton of shots you’ve got to win the offensive rebounding battle and they beat us on that.”\nTasmania burst out to a double-figure lead when they piled on 36 points during the opening period, and the margin blew out to 18 before halftime.\nDoyle (12 points), Deng and Jack McVeigh (both 10) all did plenty of damage on the scoreboard in the first half for the visitors, who never trailed. Galloway’s huge dunk sparked Sydney early in the third period and they cut the margin to three.\nAdvertisement\nBut he and Bolden soon exited and Crawford’s scintillating run gave the JackJumpers the upper hand. The Kings are hopeful Galloway will be fit for Saturday’s trip to take on the Cairns Taipans.\n“The doctors may have other plans, but he’s doing alright,” Abdelfattah said. “Obviously he was out for the rest of the game and he’s in pain a little bit, but we’ll see.”\nGoulding’s golden touch too much for Breakers\nVeteran shooter Chris Goulding has fired a series of clutch three-pointers to pilot NBL ladder leaders Melbourne United to a 97-88 win over New Zealand.\nGoulding had a quiet first half but drove daggers into the visitors at John Cain Arena on Sunday when he found range after the main break.\nIn his 300th game for Melbourne, Goulding delivered his trademark when he twice launched crucial bombs to help his team edge ahead in the dying stages of a tight contest.\nGoulding’s fade-away from the corner gave United a game-high nine-point lead with three minutes left as he finished with 4-of-5 shooting from distance.\nAdvertisement\n“We can’t not talk about CG’s couple of threes down the stretch,” coach Dean Vickerman told reporters post-game. “They were pretty incredible.”\nJo Lual-Acuil (16 points) and import Ian Clark (18) also came up with big plays in the final period as Melbourne outscored their opponents 33-25 with the game on the line.\nLual-Acuil shone in his second game back from a long-term wrist injury, and Clark’s wide-open three restored United’s nine-point buffer with 38 seconds left to play. Such was Goulding’s confidence in his teammate, he turned around to celebrate the game-sealing bucket with the home crowd before Clark had even released his shot.\nMelbourne had five scorers in double figures in an even team performance in the absence of injured guard Matthew Dellavedova, who has missed two games because of his latest concussion setback.\nThe result was Melbourne’s ninth consecutive home win over New Zealand and gave them a 6-1 record for the season.\nThe Breakers (1-2) led by six points midway through the third period but ran out of steam in a tough loss that ended a gruelling road trip, which included two exhibition matches against NBA opposition in the United States.\nAdvertisement\nZylan Cheatham (30 points) and Parker Jackson-Cartwright (18) threatened to drive the Breakers to a rousing victory until the guard fouled out inside the last four minutes.\nFormer NBA forward Anthony Lamb had 15 points and five rebounds on his NBL debut for New Zealand after signing as a replacement for injured import Justinian Jessup.\nBut Breakers coach Mody Maor was in no mood to look for positives in his team’s performance.\n“We have very high standards for how we want to play and this isn’t it,” Maor said. “Lack of focus, missing key players, making mistakes on covers.\n“I don’t care where we flew from, what our schedule is, what happened the day before – I care zero. This isn’t the level of execution that we expect from ourselves.”\nShea Ili (16 points, four assists) was important for Melbourne and Luke Travers finished with 16 points, including 15 in the first half.\nSixers, Phoenix continue to rise\nAdvertisement\nThe Adelaide 36ers have told each other some hard truths before responding in style to heap more pressure on the Perth Wildcats with their 89-78 victory.\nIn the other NBL match on Saturday, South East Melbourne Phoenix made it three straight wins, beating the Bullets 96-73 as Alan Williams led the way against a side looking lost without the suspended Aron Baynes.\nIn Adelaide, the 36ers responded to a disappointing loss on Thursday night, also at home to the Phoenix, and handed the Wildcats a third straight defeat with their 11-point win.\nSitting in bottom spot with one win from five games coming into the macth, the players got together to draw a line in the sand.\nIt certainly worked and their effort, energy and desperation was dramatically improved against Perth, but so was the execution and a focus on getting Isaac Humphries more involved inside.\nHe put up 26 points and eight rebounds in a match-winning performance but the shortening of the rotation to use just eight players from coach CJ Bruton worked too.\nAdvertisement\n“We met as a playing group yesterday and talked through a lot of stuff,” Humphries said.\n“We just wanted to come out today and put into action everything we talked about.\n“We executed what the coaches needed from us tonight and we executed what we, as a playing group, wanted to execute as well.”\nA third straight defeat for the Wildcats has them struggling at 2-4 this season.\nCoach John Rillie is focused know they aren’t playing well and the improvement needs to start offensively.\n“We’re not playing good basketball at this point in time,” Rillie said.\n“An area we need to improve on is our offence. That’s where we have to find some type of rhythm and we’ve yet to do that in these last couple of games.\nAdvertisement\n“The game’s played at both ends and you need to find a rhythm to generate some natural enthusiasm, and we haven’t been able to do that for good stretches.”\nBrisbane coach Justin Schueller always knew losing his superstar centre Baynes with a five-game suspension was going to be challenging, but that was magnified on Saturday night.\nWilliams produced 21 points and six rebounds for South East Melbourne but Brisbane will still be without Baynes for next weekend’s double-header away to Perth and at home to Tasmania, and he needs to find some answers.\n“We’ve got to have solutions right now for two more games without Banger (Baynes) and that’s the thing that’s sitting right in the front of my head, but scoring 73 points isn’t enough to get it done in this league,” Schueller said.\n“Then giving them 96 is way too many as well so we have a lot of stuff that we still have to work on.”\nJLA return lifts United to win in Wollongong\nAdvertisement\nMelbourne United have celebrated the long-awaited return of Jo Lual-Acuil but it was fellow centre Ariel Hukporti who starred in a 101-91 defeat of the lllawarra Hawks.\nNBL heavyweights United only kicked clear from last season’s wooden spooners towards the end of the third quarter following a high-scoring first half at WIN Entertainment Centre on Friday.\nAgain sloppy from the field, the Hawks missed nine consecutive shots to finish the third period as United (5-1) opened up a 14-point lead that proved match-winning.\n“We just have these patches against really good basketball teams that let us down,” said Hawks coach Jacob Jackomas.\n“The shots weren’t disgusting today, just some little things right now. We said that before with the team is that we need to do all the little things right against this basketball team and we didn’t.”\nBig man Gary Clark (17 points) was one of few Hawks who got his eye in, with imports Tyler Harvey (19 points, six from 16 attempts) and Justin Robinson (nine points, two from eight) again struggling.\nRobinson was one of three Hawks to foul out, alongside big men Sam Froling and Lachlan Olbrich.\nAdvertisement\nDespite Illawarra’s shooting issues, United gave up more first half points (51) than in any other of their games this season.\nThe Hawks dominated the offensive glass (18-10) and punished United with 21 points from turnovers.\nBut they finished the day shooting at 38 per cent from the field to United’s 53, which made things difficult, especially when United locked the paint down in the third quarter.\n“It took us a little bit of time to wake up with their physicality and the way they got after it,” said United coach Dean Vickerman.\nNBL champion Lual-Acuil returned from a wrist injury for the first minutes of his United comeback, while NBA hopeful Hukporti (21 points, 10 rebounds) shone for the visitors.\nHukporti was United’s rock under the basket and a defensive board in the final minute sealed his third double-double from five games this season.\nAdvertisement\n“I think I’ve found my role in the team now, it took me a while because I’m coming off the (achilles) injury and it was a year out,” Hukporti said.\nThat is vintage Tyler Harvey ????\n\nCan he pull the Hawks back into this one?\n\nCatch the last quarter live on ESPN via Kayo ???? pic.twitter.com\/40zoswVyPh — NBL (@NBL) October 20, 2023\n“I’ve got it now, I know what my role is and I think I did a great job today.”\nLual-Acuil had a scratchy start, missing his first two free-throws and subbing out to change out of an incorrect pair of shorts, but went on to register 12 points on a minutes restriction.\n“He’s going to see double-teams down there so once we get our spacing right and our cutting right to play off that, he’s going to be a weapon,” Vickerman said.\nProjected NBA draft lottery pick AJ Johnson had his best Hawks game yet, but was again short on opportunities.\nThe teenager set the crowd alight with his first NBL three-pointer just after quarter time and sent a dime through traffic that led to a Gary Clark jam on transition soon afterwards.\nAdvertisement\nCreek swamps Sixers for Phoenix\nA powerful second quarter propelled South East Melbourne Phoenix to a clinical 102-85 NBL victory against the Adelaide 36ers at the Adelaide Entertainment Centre.\nThe Phoenix pummelled the Sixers 28-14 in the second term on Thursday night to put the game out of the home side’s reach.\nMitch Creek (23 points) led the Phoenix’s charge, import guards Gary Browne (19 points, eight assists) and Will Cummings (18 points) did as they pleased, while Alan Williams (15 points, 13 rebounds) was influential in his first game of the season following a knee injury.\n“We were trading baskets until that second five minutes of the second quarter when the guys got multiple stops in a row and kept scoring freely,” Phoenix coach Mike Kelly said.\n“That was the difference right there, that five-minute patch.”\nAdvertisement\nImport Trey Kell (21 points) top-scored for Adelaide, while Dejan Vasiljevic, signed by the 36ers from the Sydney Kings only 48 hours earlier, had 17 points on debut with his new club.\nVasiljevic was prolific early, firing 10 attempts and scoring 10 points in the first quarter.\nAt the other end, Browne racked up nine points and four assists in the opening period, which ended with scores tied at 28-28.\nVasiljevic’s third triple gave Adelaide a slender 40-39 lead, before the visitors rattled off the next 15 points and led 54-42 at half-time.\nAfter Browne led Phoenix’s early charge, it was fellow imports Williams and Cummings who, in the second stanza, troubled the Sixers, who looked all at sea offensively and passive defensively.\nAfter Phoenix’s lead ballooned to 17 points midway through the third, experienced 36ers reserves Sunday Dech and Jason Cadee helped the home side briefly trim the deficit to single digits.\nAdvertisement\nBut their hard work was undone when Creek, who helped himself to 13 points for the term, drained an uncontested three on the three-quarter-time buzzer to push Phoenix out to 77-65, before Williams and Browne continued on their merry way in the fourth.\n“Disappointing – that’s what that was,” Sixers coach CJ Bruton said.\n“Our effort left, our communication left, and everyone was a step too slow.”\nThe Phoenix rose to 3-3 with their second straight win, while Adelaide (1-5) remain anchored to the bottom of the ladder.\nCJ claims Kings didn’t look after DJ\nAdelaide coach CJ Bruton has accused Sydney of not looking after Dejan Vasiljevic, as the war of words between the 36ers and Kings over the sharpshooting guard escalated.\nVasiljevic, a two-time championship winner with Sydney, had originally been released from his Kings contract to chase his NBA dream.\nAdvertisement\nBut when the Washington Wizards waived him just before pre-season training camp, the 26-year-old decided to return to the NBL – signing with the Sixers on Tuesday, which didn’t please Sydney’s powerbrokers.\n“We originally amended the contract in good faith and completed our roster with the understanding that ‘DJ’ (Vasiljevic) would play internationally this season,” Kings chief executive Chris Pongrass said.\n“We are disappointed with how this has been handled and another NBL team’s role in this process.”\nAustralian basketball legend and Kings co-owner Andrew Bogut chimed in on X where he posted, in part, that Sydney had granted Vasiljevic a release “after he told us he wanted to ‘chase his NBA dream’, not his NBL dream with another club”.\nVasiljevic, fronting the press as a 36er for the first time on Wednesday, fired back at the Kings, saying “they made me look like a villain, they made Adelaide look like the villain”.\nBut on Thursday night, Bruton called for Sydney to “move on”.\nAdvertisement\n“I’ve only got my perspective – you (Kings) had the chance to have him, you chose not to have him,” he said.\n“He’s moved on. Move on.\n“If you wanted to do something more, look after the kid.\n“Talk to him, championship ceremony or whatever … but that’s on them (Sydney).\n“That’s not on us or me.”\nVasiljevic scored 17 points in his Adelaide debut on Thursday, including 11 in a productive first quarter, but he couldn’t prevent the bottom-placed Sixers from suffering a 102-85 loss to South East Melbourne Phoenix.\nAdvertisement\n“I thought his energy was good,” Bruton said of his prized recruit.\n“With more time to settle in, the better he’ll become.”\n© AAP\n\nThis article, authored by The Roar, was published by The Roar | Sports Writers Blog on 2023-10-19 under the category 'sports'.\n\n","id":406}
{"title":"Eddie Jones says he needs to ‘give myself an uppercut’ but ‘100 percent’ committed to coaching Wallabies","context":"## Eddie Jones says he needs to ‘give myself an uppercut’ but ‘100 percent’ committed to coaching Wallabies\n\nWallabies coach Eddie Jones has again denied any contact with Japan and committed to staying in the job through to the next World Cup.\n“That’s the intention, mate, but as you know, we play in a game where the coach doesn’t decide how long they stay,” he said at a media conference on Tuesday, adding he had a “100 percent” passion to continue coaching the Wallabies.\n“I’m staying. I’ve always been committed to Australian rugby, want to leave it in a better place and that’s still the job. “\nFacebook Twitter Whatsapp Reddit Email Share\nHe was asked about his pre-tournament press conference where he attacked reporters’ negativity – “I probably need to give myself an uppercut, don’t I?” he joked.\nJones said he accepted that a review would be required into the World Cup flop, but his statement puts the ball firmly in Rugby Australia’s court as far as his future goes.\nSo far RA have said they intend backing Jones and he said he believed he had official support. He refused to answer a question on potential break clauses in his contract with RA.\nAdvertisement\nOn whether he will see out his contract through the end of 2027, Jones said: “It’s not absolutely my decision. “We’ve got a review going forward and let’s see what happens at the end of the review.\nHe said he was not worried about being sacked but accepted it was possible.\n“I don’t control those sort of things. All I can do is coach. I went to the World Cup, came in for a short period of time and had to make a decision on the team, made the decision we needed to go with youth, and whilst the results in the World Cup weren’t the results we wanted, I think I’ve left the Australian team in a great position to go on to 2027.\n“That judgment will be decided by the 2027 World Cup.”\nHe said the team – including coaches and players – have already completed their own review of the World Cup disaster. The next one would be “a formal review to be done by independent consultants” and he was ready to participate.\n“I didn’t come back to Australia to have a holiday – sit down at Coogee Beach, eat fish and chips, have a nice flat white. It was always going to be a battle. When you’ve got a team that hasn’t done well for a long period of time, it’s always a battle.”\nAdvertisement\nJones said it was crucial that Rugby Australia got alignment in the code from grassroots through to the top team as it looks to rebuild it’s international standing. Australia, a two-time world champion, is currently ranked 10th in the world.\n“You just got to watch the quarterfinals at the weekend. We’re not at that level. And we can’t pretend to be at that level. But can we be at that level by 2027? Yes, we can,” said Jones.\n“We’re definitely off the pace but the opportunity to get better is there. I love the game. I love working with young players. I loved seeing some of the young players maturing during the World Cup and some of them struggle. And that’s all part of it. But I love the game and I love coaching the Wallabies.”\nJones was named Wallabies coach at the start of the year as replacement for Dave Rennie. He came in with grand statements that his team could win the Rugby Championship, Bledisloe Cup and make a smash and grab on the World Cup.\nNone of those targets were achieved and Jones changed his tune about building for the future when he named a young team for the doomed Cup campaign – where his team became the first Australians to bow out of a RWC in the pool stages.\nHe finished the year with a 2-7 win loss record – the only two victories coming against lowly Georgia and Portugal.\nAdvertisement\nOn Tuesday he said he no regrets with leaving experienced players such as Quade Cooper and Michael Hooper out of the side for the tournament.\n“Everyone’s got their own judgment and they’re allowed to have that judgment,” he said. “My choice was that I decided to go with youth. And I stand by that because I think we’ve got a a lot of good young players who are really going to benefit from that experience at the World Cup, and going forward to the 2027 World Cup.”\nIt was reported during the campaign that Jones had an interview for the Japan head coach role but he denied that again on Tuesday, having previously also denied the story.\n“I haven’t been speaking to anyone, mate,” was all Jones would say on multiple reports of conversations with sources in Japanese rugby.\nHe said he understood why Australian fans were hurting.\n“We feel all the supporters hurt and really appreciate the great support we had in France and back in Australia for the team,” said Jones.\nAdvertisement\n“Sometimes the change you have to have is uncomfortable. It is quite difficult. And sometimes you have to go through this to get into a better state and I believe that the problems we’ve had particularly at the national team will put us in a better state going forward.”\nJones clearly believes he is the right man to carry Australia on.\n“I think I’ve got the foresight to see where we need to go. I’ve got the experience of being in difficult situations before,” Jones said.\n“This is not an unusual situation. You’ve got a team that was struggling for a period of time, you’ve got underneath it a system that’s not supporting it and at some stage you bottom out.\n“This is the opportunity now to change the team- as we’ve started with picking younger players with bright futures – and then we’ve got to look at the development system underneath as well.\n“It’s not a simple equation that the Wallabies are bad. Let’s be serious about this. The Wallabies are not where they need to be but underneath that we need to fix the system to go forward. And if we can do that now we’ve got a rosy future.”\nSports opinion delivered daily\n\nThis article, authored by Tony Harper, was published by The Roar | Sports Writers Blog on 2023-10-16 under the category 'sports'.\n\n","id":407}
{"title":"World Series 2023 live score: Rangers vs. Diamondbacks updates, highlights, results from Game 4","context":"## World Series 2023 live score: Rangers vs. Diamondbacks updates, highlights, results from Game 4\n\nThe Rangers found themselves one strike away from a championship twice in 2011. They couldn't finish the job. On Wednesday night, they'll have a chance to avenge that painful finish.\nTexas found out before Tuesday's Game 4 that slugger Adolis Garcia's season was over, but a talented lineup didn't miss a beat. The Rangers erupted for five runs in the second inning and five more in the third, bludgeoning Arizona's bullpen to take a 10-0 lead in the blink of an eye.\nCorey Seager came through with his third home run of the series, while Marcus Semien drove in five of the Rangers' first 10 runs — including a three-run blast that put Texas up by double digits.\nFAGAN: Three things Diamondbacks need to flip script on World Series\nThe Diamondbacks have earned a reputation for not backing down, and to their credit, they didn't. Arizona scored six runs over the final two innings, putting together competitive at-bats despite the dramatic deficit and forcing the Rangers to go to closer Jose Leclerc for the final out.\nStill, it wasn't nearly enough. The Diamondbacks' best hope is that their late-game surge carries over to Game 5, where they will face elimination for the third time in this postseason.\nThe Rangers just need one more win to become World Series champions, and they will have the right man on the mound in Game 5 as Nathan Eovaldi makes his sixth start of the postseason. Zac Gallen, who was less than sharp in October but earned Cy Young consideration during the regular season, will start for the Diamondbacks with everything on the line for Arizona.\nMORE: How Bruce Bochy went from retirement to World Series in one year\nThe Sporting News tracked live scoring updates and highlights from Game 4 of the 2023 World Series between the Rangers and Diamondbacks. Check out all of the key moments you might have missed.\nWorld Series Game 4 final score\n1 2 3 4 5 6 7 8 9 F Rangers 0 5 5 0 0 0 0 1 0 11 Diamondbacks 0 0 0 1 0 0 0 4 2 7\nWorld Series results. highlights from Rangers vs. Diamondbacks Game 4\n(All times Eastern)\nFinal: Rangers 11, Diamondbacks 7\n11:24 p.m. — Walker pops out in foul territory, and the Rangers ride an offensive explosion way back in the early innings to a Game 4 win. Texas is one win away from its first championship. The Rangers can win it all as early as tomorrow night at Chase Field.\nThe @Rangers are one win away from their first #WorldSeries title in franchise history 🤠 pic.twitter.com\/cHb2I3ZBOS — FOX Sports: MLB (@MLBONFOX) November 1, 2023\nRangers 11, Diamondbacks 7\n11:22 p.m. 2-RUN SINGLE — The Snakes are still alive. Gabriel Moreno singles in two more runs to trim the Rangers' lead to 11-7.\nThe Snakes are not going away quietly 👀\n\n📺: FOX pic.twitter.com\/4XtYSF0fZj — FOX Sports: MLB (@MLBONFOX) November 1, 2023\n11:18 p.m. — Bochy is bringing in Jose Leclerc for the final out despite the six-run lead...\n11:17 p.m. — Smith strikes out Carroll, and the Rangers are an out away from a 3-1 series lead.\n11:14 p.m. — Marte swings at a pitch well out of the zone and strikes out.\n11:13 p.m. — Perdomo singles into the gap and sends Lawlar over to third. Arizona has a little something brewing here.\n11:12 p.m. — Lawlar with a very professional plate appearance for a player who was just called up in September. He starts the inning with a walk.\n11:09 p.m. — It'll be rookie Jordan Lawlar facing Will Smith to lead off the inning.\n11:07 p.m. — Chris Stratton warmed up to start the inning, but Bruce Bochy is making a change after seeing Pavin Smith enter as a pinch-hitter.\n11:04 p.m. — Jung quickly grounds into an inning-ending double play. Now the Diamondbacks just need six runs in the bottom of the ninth to extend the game.\n11:02 p.m. — Saalfrank hits Carter, a call that is upheld after Torey Lovullo asked for a review.\n10:59 p.m. — After Garver strikes out, Andrew Saalfrank is coming in to face Evan Carter.\n10:56 p.m. — Seager leads off the ninth with a ground-rule double.\n10:54 p.m. — Thomas hits a bouncer that ends the inning.\n10:52 p.m. 3-RUN HOME RUN — Snakes alive? Gurriel launches a 3-run home run to give the crowd something to cheer about. The Rangers' lead is cut to six.\nRangers 11, Diamondbacks 2\n10:50 p.m. SACRIFICE FLY — Pham works a long at-bat against Stratton, and it ends in a sac-fly to trim the lead to nine.\n10:44 p.m. — Now Walker delivers Arizona's third consecutive single, forcing Bradford out of the game. Chris Stratton is coming in with the bases loaded and one out.\n10:41 p.m. — Moreno follows Carroll with a single of his own. You have to give credit to the Diamondbacks' fans. They're still cheering pretty loudly.\n10:40 p.m. — Corbin Carroll has struggled in this series, but he comes up with a one-out single here in the eighth.\n10:34 p.m. — Semien strikes out to end the inning for the Rangers.\n10:33 p.m. — The game was briefly paused while the public address announcer asked fans to stop throwing paper airplanes onto the field. That's where this game is right now.\nRangers 11, Diamondbacks 1\n10:29 p.m. HOME RUN — For the first time since the third inning, the Rangers have a run. Jonah Heim blasts a home run to right field to extend Texas' lead back to 10.\nThe Heim Hammer 💥\n\n📺: FOX pic.twitter.com\/G4pO4pz9jv — FOX Sports: MLB (@MLBONFOX) November 1, 2023\n10:24 p.m. — Jankowski collides with Semien in foul territory but makes a nice catch for the final out of a quick inning for Bradford.\n10:20 p.m. — Cody Bradford is into the game to pitch for Texas.\n10:17 p.m. — Nelson still gets through the inning unscathed as he preserves what's left of the Diamondbacks bullpen for Game 5.\n10:15 p.m. — The first baserunner allowed by Nelson is Josh Jung, who has a three-hit night for the Rangers.\n10:09 p.m. — It's just not the Diamondbacks' day (if you couldn't already tell). Gurriel grounds into an inning-ending double play to end that threat.\n10:07 p.m. — Walker and Pham put back-to-back singles on the board with one out.\n10:01 p.m. — Nelson strikes out Seager, whose World Series MVP case might be hurt by the fact he's hitting under .200 in the series. Onto the bottom of the sixth.\n9:59 p.m. — Ryne Nelson is doing his part, at least. He's retired the first eight hitters he's faced with Seager now coming to the plate.\n9:53 p.m. — The middle of the fifth inning is MLB's annual Stand Up to Cancer tribute. A fantastic moment at Chase Field.\nTonight, we come together to Stand Up To Cancer. pic.twitter.com\/uFwnMBu47t — FOX Sports: MLB (@MLBONFOX) November 1, 2023\n9:52 p.m. — Heaney is through five innings of one-run ball for the Rangers, who lead 10-1.\n9:51 p.m. — Marte is retired for the first time tonight on a ground ball that moves Perdomo over to second.\n9:49 p.m. — Perdomo works a one-out walk against Heaney, who's up to 76 pitches.\n9:44 p.m. — Make it 6-for-6 for Nelson, who has coasted through two scoreless innings. Let's see if Arizona can put any pressure at all on the Rangers.\n9:43 p.m. — Nelson gets the first two outs without incident. He's retired all five batters he's faced.\n9:40 p.m. — Fan on the field! At least there's some action.\n9:37 p.m. — Heaney retires Alek Thomas, so the Diamondbacks come away from that opportunity with only one run. They're going to need more.\nRangers 10, Diamondbacks 1\n9:35 p.m. SACRIFICE FLY — Gurriel hits one a long way to right field, but it's caught near the warning track. Still, it's a run. Moreno scores to put Arizona on the board.\n9:33 p.m. — Tommy Pham works a 3-1 count, but Heaney comes right back and strikes him out looking.\n9:30 p.m. — Walker quickly lines one down the left field line for a double. The Diamondbacks have runners on second and third with nobody out.\n9:29 p.m. — Moreno walks to open the bottom of the fourth.\n9:27 p.m. — Nelson retires Carter and Jung, so it's a much-needed quick inning by Diamondbacks pitching. Now it's just up to Arizona's offense to put up 10 or so runs.\n9:24 p.m. — Ryne Nelson strikes out Garver to open the fourth.\n9:20 p.m. — Nathaniel Lowe makes the play to retire Carroll, and that will bring the Rangers back up to bat with a 10-0 lead.\n9:17 p.m. — At least Ketel Marte showed up for the Diamondbacks tonight. He's 2-2 after a double off of Heaney.\n9:16 p.m. — Perdomo grounds out up the middle for the second out of the inning.\n9:15 p.m. — Emmanuel Rivera opens the bottom of the third with a lineout.\nRangers 10, Diamondbacks 0\n9:09 p.m. 3-RUN HOME RUN — This is ugly, ugly, ugly for Arizona. Marcus Semien blasts a 3-run home run to put the Rangers up by double-digits, and an Arizona bullpen that has been so great in this postseason is getting bludgeoned.\nA 3-RUN HOMER FROM SEMIEN MAKES IT 10-0 @Rangers! 😱\n\n📺: FOX pic.twitter.com\/83qi1EGjO2 — FOX Sports: MLB (@MLBONFOX) November 1, 2023\nRangers 7, Diamondbacks 0\n9:08 p.m. 2-RUN DOUBLE — Who needs Adolis Garcia? Jankowski comes through with a massive 2-run double and puts the Rangers up 7-0. Texas is all over the Diamondbacks' bullpen.\nThe Rangers tack on two more runs 😳\n\n📺: FOX pic.twitter.com\/AWYICKRMiq — FOX Sports: MLB (@MLBONFOX) November 1, 2023\n9:06 p.m. — Luis Frias strikes out Taveras and has a chance to wiggle out of this against Jankowski.\n9:03 p.m. — Disaster. Christian Walker had a chance to turn two but couldn't hold onto the ball. The Rangers have the bases loaded with one out.\n8:59 p.m. — Lowe keeps the line moving and laces a single up the middle. The Rangers have two runners on with one out. This one could get even more out of hand for Arizona. Kyle Nelson's night is done.\n8:58 p.m. — Jung hits a one-out single for his second hit of the night.\n8:53 p.m. — Thomas flies out to left to end the inning.\n8:51 p.m. — Gurriel hits a two-out single to give the Diamondbacks a pulse. That'll bring up Alek Thomas.\n8:49 p.m. — Heaney notches two quick outs to start the bottom of the second.\n8:44 p.m. — The inning ends on a nice throw by Emmanuel Rivera, but what an inning it was for Texas with five runs.\nRangers 5, Diamondbacks 0\n8:43 p.m. 2-RUN HOME RUN — Corey Seager has broken this game open! The 2020 World Series MVP has three hits in this series, but they're all home runs. He takes Kyle Nelson deep and gives the Rangers a commanding 5-0 lead.\nCOREY SEAGER STRIKES AGAIN 💥\n\n📺: FOX pic.twitter.com\/oKytcm45H6 — FOX Sports: MLB (@MLBONFOX) November 1, 2023\nRangers 3, Diamondbacks 0\n8:39 p.m. 2-RUN TRIPLE — There goes Semien! He hits on just inside the foul line, and it takes an eternity for Lourdes Gurriel Jr. to get to it. Two runs score. It's 3-0, Rangers.\n2-run triple for Marcus Semien!\n\nThe @Rangers came out swinging!\n\n📺: FOX pic.twitter.com\/Je43lpXXMi — FOX Sports: MLB (@MLBONFOX) November 1, 2023\n8:37 p.m. — Taveras walks, and Travis Jankowski quickly singles up the middle to give the Rangers runners on first and second with two outs. Semien is up with a chance to extend Texas' lead.\nRangers 1, Diamondbacks 0\n8:35 p.m. WILD PITCH — Jung scores on a ball that gets away from Moreno! Castro's pitch in the dirt took a bad bounce, and there was no play at the plate. The Rangers lead early.\nThe @Rangers strike first in Game 4!\n\n📺: FOX pic.twitter.com\/E5FCruQby7 — FOX Sports: MLB (@MLBONFOX) November 1, 2023\n8:33 p.m. — Jung gets moved over to third on a chopper by Heim, who is out at first. Leody Taveras has a two-out RBI opportunity.\n8:31 p.m. — Miguel Castro is in to face Heim with one out and Jung at second.\n8:29 p.m. — Mantiply quickly strikes out Lowe for the first out of the inning, and that will be the end of his day.\n8:27 p.m. — Keeping Mantiply in to face Josh Jung was not successful. Jung belts a double into the gap and gives Texas a leadoff runner in scoring position. Mantiply will stay in to face Nathaniel Lowe.\n8:25 p.m. — The Diamondbacks are sticking with Mantiply to start the second inning.\n8:23 p.m. — Heim nabs Marte on the stolen base attempt! That'll end the inning. A quick momentum shift back to the Rangers after the leadoff Marte single.\n8:21 p.m. — Another strikeout for Heaney, who gets Moreno. The Diamondbacks are making him work, but he's getting the job done early.\n8:18 p.m. — Heaney bounces back with a strikeout of Corbin Carroll.\n8:15 p.m. — Ketel Marte's hitting streak reaches 20 as he singles up the middle to lead off the bottom of the first.\n20-game postseason hitting streak for Ketel Marte 👏\n\n📺: FOX pic.twitter.com\/GJoEF1GVKj — FOX Sports: MLB (@MLBONFOX) November 1, 2023\n8:12 p.m. — Carter flies out, so Mantiply gets through a scoreless first inning. Here come the Diamondbacks against Andrew Heaney, who was hit hard in the first inning during the ALCS.\n8:11 p.m. — Mitch Garver works a two-out walk after Seager's quick at-bat.\n8:08 p.m. — Seager swings at the first pitch and sends it deep into the outfield, but it's caught comfortably for the second out.\n8:08 p.m. — Semien works a full count, but Geraldo Perdomo gets things started with a great defensive play to get him for the first out.\n8:05 p.m. — Joe Mantiply is ready. Marcus Semien is ready. Game 4 of the World Series is underway with a strike.\n7:55 p.m. — Jon Rahm and Michael Phelps are among the stars in attendance at Chase Field.\n7:35 p.m. — For all of the Rangers' losses, a win tonight with Nathan Eovaldi and Jordan Montgomery in line to start the next two games would put Texas in a terrific position.\n7:18 p.m. — Max Scherzer is also off the World Series roster for Texas. He's been replaced by Brock Burke.\n7:07 p.m. — It's being reported that Adolis Garcia is off the World Series roster. His season is over. Ezequiel Duran has been added to the roster.\n6:45 p.m. — Look who spent some time together before Game 4? The Diamondbacks are earning Chris Russo's trust.\n6:25 p.m. — Bruce Bochy said he's anticipating making a roster decision on Adolis Garcia tonight. Garcia has a moderate oblique strain.\n5:10 p.m. — Adolis Garcia is not in the lineup for Texas. Travis Jankowski takes his place, although Garcia told ESPN's Buster Olney in the clubhouse that he's \"good.\"\n4:45 p.m. — Emmanuel Rivera is replacing Evan Longoria in the Diamondbacks' lineup for Game 4.\nRangers vs. Diamondbacks Game 4 start time\nDate: Tuesday, Oct. 31\nTuesday, Oct. 31 First pitch: 8:03 p.m. ET (5:03 p.m. local time)\n8:03 p.m. ET (5:03 p.m. local time) Location: Chase Field, Phoenix\nFirst pitch for Game 4 of the 2023 World Series between the Rangers and Diamondbacks is set for 8:03 p.m. ET.\nHow to watch the 2023 World Series\nChannel: Fox (U.S.) | Sportsnet (Canada)\nFox (U.S.) | Sportsnet (Canada) Live stream: Fox Sports app, Fubo (U.S.) | Sportsnet NOW (Canada)\nFox will carry the full World Series between the Rangers and Diamondbacks. Joe Davis will be handling play-by-play, while John Smoltz will provide commentary. Ken Rosenthal and Tom Verducci will be reporting from the dugouts.\nFor those who have cut the cord on cable, fans can find the game on the Fox Sports app or with Fubo, which offers a free trial. Canadian viewers can find the game on Sportsnet or on Sportsnet NOW.\nMLB playoff schedule, results\n(All times Eastern)\nAmerican League\nWild Card\nDate Result Oct. 3 Rangers 4, Rays 0 Oct. 3 Twins 3, Blue Jays 1 Oct. 4 Rangers 7, Rays 1 Oct. 4 Twins 2, Blue Jays 0\nDivision Series\nDate Result Oct. 7 TEX 3, BAL 2 (TEX, 1-0) Oct. 7 HOU 6, MIN 4 (HOU, 1-0) Oct. 8 TEX 11, BAL 8 (TEX, 2-0) Oct. 8 MIN 6, HOU 2 (Tied, 1-1) Oct. 10 HOU 9, MIN 1 (HOU, 2-1) Oct. 10 TEX 7, BAL 1 (TEX wins 3-0) Oct. 11 HOU 3, MIN 2 (HOU wins, 3-1)\nChampionship Series\nDate Matchup Start time (ET) TV channel Result Oct. 15 Rangers at Astros 8:15 p.m. Fox TEX 2, HOU 0 (TEX, 1-0) Oct. 16 Rangers at Astros 4:37 p.m. Fox or F TEX 5, HOU 4 (TEX, 2-0) Oct. 18 Astros at Rangers 8:03 p.m. FS1 HOU 8, TEX 5 (TEX, 2-1) Oct. 19 Astros at Rangers 8:03 p.m. FS1 HOU 10, TEX 3 (TIE, 2-2) Oct. 20 Astros at Rangers* 7:07 p.m. FS1 HOU 5, TEX 4 (HOU, 3-2) Oct. 22 Rangers at Astros* 8:03 p.m. FS1 TEX 9, HOU 2 (TIED, 3-3) Oct. 23 Rangers at Astros* 8:03 p.m. Fox or FS1 TEX 11, HOU 4 (TEX wins, 4-3)\n*If necessary\nNational League\nWild card series\nDate Result Oct. 3 Diamondbacks 6, Brewers 3 Oct. 3 Phillies 3, Marlins 1 Oct. 4 Diamondbacks 5, Brewers 2 Oct. 4 Phillies 7, Marlins 1\nDivision Series\nDate Result Oct. 7 PHI 3, ATL 0 (PHI, 1-0) Oct. 7 ARI 11, LAD 2 (ARI, 1-0) Oct. 9 ATL 5, PHI 4 (Tied 1-1) Oct. 9 ARI 4, LAD 2 (ARI, 2-0) Oct. 11 PHI 10, ATL 2 (PHI, 2-1) Oct. 11 ARI 4, LAD 2 (ARI wins, 3-0) Oct. 12 PHI 3, ATL 1 (PHI wins, 3-1)\nChampionship Series\nDate Matchup Start time (ET) TV channel Result Oct. 16 Diamondbacks at Phillies 8:07 p.m. TBS PHI 5, ARI 3 (PHI, 1-0) Oct. 17 Diamondbacks at Phillies 8:07 p.m. TBS PHI 10, ARI 0 (PHI, 2-0) Oct. 19 Phillies at Diamondbacks 5:07 p.m. TBS ARI 2, PHI 1 (PHI, 2-1) Oct. 20 Phillies at Diamondbacks 8:07 p.m. TBS ARI 6, PHI 5 (Tied 2-2) Oct. 21 Phillies at Diamondbacks 8:07 p.m. TBS PHI 6, ARI 1 (PHI, 3-2) Oct. 23 Diamondbacks at Phillies 5:07 p.m. TBS ARI 5, PHI 1 (Tied, 3-3) Oct. 24 Diamondbacks at Phillies* 8:07 p.m. TBS ARI 4, PHI 2 (ARI wins, 4-3)\n*If necessary\nWorld Series schedule\nDate Matchup Start time (ET) TV channel Result Oct. 27 Diamondbacks at Rangers 8:03 p.m. Fox TEX 6, ARI 5 (TEX 1-0) Oct. 28 Diamondbacks at Rangers 8:03 p.m. Fox ARI 9, TEX 1 (Tied 1-1) Oct. 30 Rangers at Diamondbacks 8:03 p.m. Fox TEX 3, ARI 1 (TEX, 2-1) Oct. 31 Rangers at Diamondbacks 8:03 p.m. Fox -- Nov. 1 Rangers at Diamondbacks* 8:03 p.m. Fox -- Nov. 3 Diamondbacks at Rangers* 8:03 p.m. Fox -- Nov. 4 Diamondbacks at Rangers* 8:03 p.m. Fox --\n*If necessary\n\nThis article, authored by Dan Treacy, was published by Sporting News on 2023-10-31 under the category 'sports'.\n\n","id":408}
{"title":"When was the first Cricket World Cup? History, winners' list and tournament details ahead of 2023 men's ODI showpiece","context":"## When was the first Cricket World Cup? History, winners' list and tournament details ahead of 2023 men's ODI showpiece\n\nThe heart and soul of ICC Championships — the ODI Men's Cricket World Cup — will be held in India from October 5 to November 19.\nOrganised every four years by the International Cricket Council (ICC), the event is one of the most viewed sporting tournaments in the world.\nHere we take a look at the history of the competition, and some of the landmark moments that have helped make the World Cup what it is today.\nMORE: Who will win the World Cup? Make your prediction and bet here (selected territories)\nWhen was the first ODI Cricket Word Cup?\nEngland hosted the inaugural ODI World Cup back in 1975, and held the event the following three times too.\nInitially, the game was played in cricket whites and with a red ball instead of a white ball.\nEight teams were a part of that inaugural tournament — India, Pakistan, England, Australia, West Indies, New Zealand and a composite team from East Africa and Sri Lanka.\nCurrent cricketing powerhouse South Africa was banned at the time from international sport due to its policy of racial segregation under the Apartheid system, and thus did not take part in the first ODI World Cup.\nThe West Indies won the first tournament and defended the title in the second World Cup in 1979, while India's first taste of glory came when they clinched the trophy in 1983 by defeating the West Indies by 43 runs in the final.\nODI World Cup full list of winners and finals\nYear Host Winner Runner-up Result 1975 England West Indies Australia West Indies won by 17 runs 1979 England West Indies England West Indies won by 92 runs 1983 England India West Indies India won by 43 runs 1987 India & Pakistan Australia England Australia won by seven runs 1992 Australia & New Zealand Pakistan England Pakistan won by 22 runs 1996 Pakistan, India & Sri Lanka Sri Lanka Australia Sri Lanka won by seven wickets 1999 England Australia Pakistan Australia won by eight wickets 2003 South Africa Australia India Australia won by 125 runs 2007 West Indies Australia Sri Lanka Australia won by 53 runs (DLS) 2011 India, Sri Lanka & Bangladesh India Sri Lanka India won by six wickets 2015 Australia & New Zealand Australia New Zealand Australia won by seven wickets 2019 England & Wales England New Zealand England won on boundary count after a Super Over\nWho has won the most ODI Cricket World Cups?\nAustralia are the most successful nation in ODI World Cup history, with India and the West Indies chasing them.\nCountry World Cup titles Years won Australia 5 1987, 1999, 2003, 2007, 2015 India 2 1983, 2011 West Indies 2 1975, 1979 England 1 2019 Sri Lanka 1 1996 Pakistan 1 1992\nMORE: Complete ICC Cricket World Cup schedule and results from India\nA 50-over ODI Cricket World Cup\nThe 1987 tournament saw two prime changes in the way the ODI World Cups were organised — a shift of venue from England to the Indian subcontinent, and games being played in 50 overs instead of 60.\nThe change in the number of overs was attributed to shorter daylight hours in Asia in comparison to England.\nThe 1987 tournament also had a new winner in Australia, who went on to defeat England by seven runs.\nODI World Cup kits, white ball introduction\nHeld in Australia and New Zealand, the 1992 World Cup saw a number of landmark moments.\nThat tournament was the first in which teams wore coloured kits, while it also saw the introduction of the white ball, changes in fielding rules, day\/night matches and the inclusion of South Africa in the event for the first time following the end the Apartheid regime.\nAfter a slow and disappointing start to their year, Pakistan made an historic comeback in the tournament to eventually win the trophy by defeating England in the final.\nREAD: ICC sends 2023 World Cup trophy into space\nThe 1999 World Cup and a three-year gap\nThe 1996 tournament was jointly hosted by India and Sri Lanka, and will go down in history as one of the most controversial episodes in the game.\nBoth the host teams met in the semi-finals at Eden Gardens, Kolkata. India's poor performance sparked an unruly crowd to protest against the home team and Sri Lanka was declared the winner by default, due to the halt in play.\nSri Lanka then went on to win the trophy that year, and they were back to try and defend it three years later in England, rather than the usual four-year cycle.\nFollowing the 1996 event the ICC opted to try and revamp the schedule, with three years between events rather than four. But the move proved unpopular and 1999 was the only tournament to follow that pattern.\nWhen was the last time India hosted the ODI Cricket World Cup?\nThe last time India welcomed the ODI Cricket World Cup was in 2011, when they were co-hosts with Sri Lanka and Bangladesh.\nPakistan were barred from hosting due to terrorist attacks on the Sri Lankan team when touring the country a couple of years prior to the World Cup.\nThe 2011 World Cup was a tournament of many firsts: Australia's streak of remaining unbeaten in 35 World Cup matches was broken when they were defeated by Pakistan. They hadn't lost a game since the 1999 tournament.\nIt was also the first time two Asian teams were in the finals, as India became the first country to win a World Cup at\nhome by defeating Sri Lanka in the decider.\nAfter a prolonged drought of ICC trophies, India are favourites to bring the trophy home again this time in 2023.\n\nThis article, authored by Vishakha Deshpande, was published by Sporting News on 2023-10-01 under the category 'sports'.\n\n","id":409}
{"title":"Strategizing for sustainable development","context":"## Strategizing for sustainable development\n\nPublic policies attempt to fulfill one or more of the following objectives: efficiency, equity, and stability. Efficiency and stability are necessary conditions for sustainable growth while equity helps make development inclusive.\nThis is the second article in our series following the 2nd SGV Tax Symposium, which focused on how a sustainable and effective tax ecosystem can advance the sustainability agenda for both the public and private sectors.\nIn this article, we will discuss the Philippine strategy for sustainable development.\nGROWTH THROUGH TRADE AND INVESTMENT\nThe Philippine Development Plan (PDP) 2023-2028 aims for a deep economic and social transformation to reinvigorate job creation and accelerate poverty reduction by steering the economy back to a high-growth path. In this regard, two main performance indicators are identified and will be monitored by the National Government.\nThe first is for the country to graduate into upper middle-income class status within the term of the current administration. For this, the economy must grow its per capita income above the threshold set by the World Bank, which means a gross national income (GNI) per capita of at least $4,466. In 2022, the Philippines achieved a GNI per capita of $3,950.\nThe second is to lower the poverty level from 18.1% in 2021 to single digits by 2028 — the end of the term of the current administration. Both indicators require high growth rates. For the next year through 2028, the government pencils the growth rate between 6.5% and 8%.\nGrowth is expected to be investment-led with the implementation of structural changes such as the Corporate Recovery and Tax Incentives for Enterprises (CREATE) law, which lowered the corporate income tax rate, and the amendments to the Public Service Act (PSA), Foreign Investment Act (FIA), and Retail Trade Liberalization Act (RTLA), which further liberalized the economy. The new legislation is expected to attract more local and foreign investment, especially in the liberalized sectors. For the energy sector in particular, amendments to the PSA are envisioned to help raise the capital needed to speed up the energy transition of the country to renewables.\nIn addition, the Regional Comprehensive Economic Partnership (RCEP), a trading bloc that encompasses the ten members of the Association of Southeast Asian Nations (ASEAN) and the ASEAN Plus One Free Trade Agreement (FTA) partners Japan, China, South Korea, Australia, and New Zealand, is already in force for the Philippines, helping ease market access through trade and investment rules and supporting global and regional supply chains. The Philippines can potentially position itself as a regional manufacturing hub if the right incentives and policy measures are put in place to encourage local and foreign investors to participate. Together, trade and investment are expected to play an important role in attaining economic transformation, the second goal of the PDP.\nHUMAN CAPITAL AND INFRASTRUCTURE\nThe ability of people to take advantage of market opportunities arising from investment rests on human capital. To this end, the first goal of the PDP is social transformation which includes, among others, sustained expenditure on social services, mainly education, health, and social protection.\nThe first two goals of the PDP help attain the developmental objectives of efficiency and equity, which rest on the pillars of sustainability and resilience. The third fosters societal resilience: an enabling environment encompassing institutions, macroeconomic stability, and the physical and natural environment.\nInstitutions are vital to economic acceleration, which is why the government’s steps to enhance the ease of doing business are most welcome. Infrastructure development also enables an economy to sustain higher levels of growth, which, in turn, catalyzes yet more investment. The Public-Private Partnership (PPP) Act is up for the signature of President Marcos and, if approved, is expected to further enhance the business atmosphere in mobilizing private resources for infrastructure development.\nThe government aims to sustain its infrastructure program at 5-6% of GDP through 2028 amid a six-year medium-term fiscal framework. This plan gradually narrows the deficit to 3% of GDP by 2028, down from 7.3% in 2022, such that the debt-to-GDP ratio is reduced from nearly 61% in 2022 to a more sustainable level of at most 53% by 2028.\nDEBT MANAGEMENT\nThe National Government’s debt was less than 40% before the pandemic struck. It expended much of its fiscal space combatting the pandemic, incurring debt and large budget deficits. While the current 61% debt-to-GDP ratio may be manageable for an emerging economy like the Philippines for some time, the country may not have the fiscal space to respond to another potential domestic or external shock. If the debt continues to rise more than the economy, risks will increase, and the government may “crowd out” private investment as it competes with the private sector for funds to service its debt.\nThe planned fiscal consolidation entails harmonizing the revenue needs with the promotion of investment through the structure and administration of the reformed incentive system. The National Government plans to raise more revenue to finance the country’s socio-economic needs, largely through a progressive and simplified tax system, more efficient and effective tax collection measures through digitalization and, to some extent, from policy measures such as value-added tax on digital service providers and excise tax on sweetened beverages and junk food.\nAchieving fiscal stability presupposes the sustainability of fiscal policy, and fiscal stability helps “crowd in” private investment.\nPRICE STABILITY AND INFLATION\nIn his second State of the Nation Address (SONA), President Ferdinand Marcos, Jr. singled out inflation as the country’s most pressing problem. In the first nine months of 2023, inflation averaged 6.6% — far above the upper end of the target range of 2-4% set by the BSP. If left unchecked, inflation could undermine growth. Not only does this increase costs to organizations, but it also sets in motion second-round effects as workers start demanding higher wages, consequently increasing business costs and discouraging investments.\nInflation is partly driven by supply-side issues and the government is allocating more resources to the agriculture sector to boost production. Mr. Marcos also mentioned that the National Government had distributed 28,000 new tools and machinery to farmers. An additional 600 km of farm-to-market roads were laid down to support the 14 million hectares of farmland, enhancing farmer access to markets. In addition, he signed Executive Order No. 28 in May, forming the Inter-Agency Committee on Inflation and Market Outlook, which is tasked to keep inflation within government targets and boost the economy.\nENHANCING CLIMATE RESILIENCE\nWhile price stability and fiscal sustainability are important macroeconomic issues, environmental sustainability is increasingly gaining importance. Climate change uncertainties and challenges need to be managed and both the Philippine government and the private sector are hard-pressed to deliver their commitments to addressing them. Despite climate change risks, the Philippines has the opportunity to position itself as a prime destination of foreign investments against climate change or environmental, social, and governance (ESG) investments.\nThe government calls for embedding resilience, sustainability, and nature-based solutions in infrastructure planning and investment to enhance climate resilience. Likewise, investments in renewable energy are expected not only to enhance energy security but also reduce greenhouse gas (GHG) emissions.\nFrom an economic vantage point, GHG emissions are economic “bads” and are a cause of inefficiency as they get over-produced. Their effects, however, go beyond national borders, and while the Philippines contributes minimally to global GHG emissions, the World Risk Index 2022 report identifies the Philippines as the most disaster-prone country in the world.\nThe government envisions that by 2028: (1) Climate and disaster risk resilience of communities and institutions will increase (2) Ecosystem resilience will be enhanced, and (3) A low-carbon economy transition is enabled.\nTo ensure that these are realized, the government is set to safeguard cross-sectoral convergence and implement a comprehensive risk management approach to address the adverse consequences posed by climate change. It will also promote a green and blue economy coupled with improved governance to guarantee long-term climate and disaster resilience.\nBUILDING RESILIENCE THROUGH SUSTAINABLE DEVELOPMENT\nComing off from the pandemic and with the current global economic climate, it is opportune for the government to proactively drive for actionable policies and programs that focus on building the resiliency of the economy through sustainable development with greater emphasis given to addressing climate change.\nNavigating external and domestic economic headwinds will not be an easy feat for the administration, but the private sector will be an important catalyst for sustainable development. With the private sector sharing industry knowledge, resources and potentially even leading certain socio-economic programs and projects of the National Government, it is to be hoped that AmBisyon Natin 2040 of long and healthy lives for Filipinos that are strongly rooted, comfortable, and secure will be achieved.\nThis article is for general information only and is not a substitute for professional advice where the facts and circumstances warrant. The views and opinions expressed above are those of the author and do not necessarily represent the views of SGV & Co.\nNoel P. Rabaja the strategy and transactions (SaT) service leader of SGV & Co.\n\nThis article, authored by BusinessWorld, was published by Business World on 2023-11-05 under the category 'business'.\n\n","id":410}
{"title":"Michigan State hires Jonathan Smith: Oregon State coach leaves alma mater to take over Spartans job","context":"## Michigan State hires Jonathan Smith: Oregon State coach leaves alma mater to take over Spartans job\n\nMichigan State has hired Jonathan Smith as its next football coach, the school announced on Saturday. Smith, 44, has spent the past six seasons as coach at Oregon State where he's guided the Beavers to 18 wins over the past two seasons, including a 10-3 mark and No. 17 finish in the AP Top 25 during a 2022 campaign that earned him Pac-12 Coach of the Year honors.\nSmith was among the initial pool of candidates linked to the Michigan State opening after the Spartans fired fourth-year coach Mel Tucker with cause midseason amid sexual harassment allegations. Smith later emerged as the leading candidate to replace Tucker during the final week of the regular season, which saw Oregon State suffer a 31-7 loss at rival Oregon.\n\"Jonathan has a proven track record of success, building the Oregon State program from the ground up by implementing a plan resulting in sustained historic success for the Beavers,\" said Michigan State athletic director Alan Haller in announcing the hire. \"He's been a part of championship staffs, coached in the College Football Playoff, and understands what's required to be successful at the highest level, learning from some of the game's most successful coaches.\n\"On the field, his teams are tough and physical, yet innovative. This year, Oregon State has controlled the line of scrimmage on both sides of the ball, ranking among the nation's leaders in both rushing offense and rushing defense. He's shown not only the ability to recruit talented student-athletes who fit his system, but also to develop and maximize players once they're in the program.\"\nSmith, a former quarterback for the Beavers from 1998-2001, exits Oregon State with a 34-35 overall mark as coach, including a 1-1 record in bowl games, as he now joins the Big Ten coaching ranks.\n\"As I start this next chapter of my coaching career, I want to first thank all the players, coaches and colleagues I have worked with the last six years,\" Smith said in a statement posted to social media. \"I will cherish the memories and friendships. I also want to express my deepest gratitude to the people of OSU\/Corvallis for your support. When I first arrived as a freshman college student, I had no idea the opportunities and relationships this community would provide for me and my family. The collective impact you have made makes it impossible to thank everyone individually, but I am forever grateful.\"\nOregon State left in dust amid uncertain future\nAlthough Smith narrowly finished below. 500 in six seasons at the helm in Corvallis, Oregon, the Beavers made clear progress during the back half of his tenure. Smith guided Oregon State to seven victories in 2021 after the program went 9-22 during his first three years. The 2022 season, which marked the Beavers' first 10-win season since 2006 and highest AP Top 25 finish since 2000, resulted in a contract extension for Smith through February 2029 that bumped his annual salary to $4.85 million. Oregon State then started the 2023 season 8-2 before dropping back-to-back games against Washington and Oregon.\nEarlier in the week, Oregon State athletic director Scott Barnes called it the \"No. 1 priority\" to reach a contract extension with Smith as speculation of this move began to grow. In a statement Saturday after Smith's departure was finalized, Barnes thanked him for his efforts at Oregon State as the Beavers now embark on the search for Smith's replacement.\n\"Coach Smith and his staff worked tirelessly to rebuild the culture at Oregon State, both on the field and in the classroom,\" Barnes said. \"All of Beaver Nation should thank him for the lasting legacy he has left to his alma mater and wish him and his family nothing but the best moving forward.\"\nSmith held multiple assistant jobs from 2002-17 before returning to his alma mater as coach in 2018. Smith spent six seasons as an assistant under former college football coach Chris Petersen, first as Boise State's quarterbacks coach from 2012-13 and then as Washington's quarterbacks coach and offensive coordinator from 2014-17. His time in Seattle included a Pac-12 title and College Football Playoff berth for Washington during the 2016 season.\nSmith's exit from Oregon State comes at a point where the Beavers face much uncertainty as the Pac-12 prepares to lose 10 of its 12 members ahead of the 2024 season. Oregon State and Washington State are the only schools in the conference that have not been picked up by other power leagues. Four Pac-12 members -- USC, UCLA, Washington and Oregon -- will join Smith in the Big Ten next fall.\nCan Smith turn the Michigan State program around?\nThe task now for Smith is revitalizing a Michigan State program that has struggled to field consistent success in recent seasons. After winning 10 or more games six times in a span of eight seasons under former coach Mark Dantonio from 2010-17, the Spartans have only won more than seven games in a season once since then, finishing 11-2 under Tucker's second year at the helm in 2021.\nWhat seemed to be a breakthrough season for Tucker in 2021 earned him a 10-year contract extension worth $95 million, but Tucker's remaining tenure in East Lansing was all downhill afterwards. Michigan State regressed to 5-7 in 2022 before allegations of sexual harassment surrounding Tucker against rape survivor and activist Brenda Tracy emerged just two games into the 2023 season. Tucker was promptly suspended before the school fired him with cause several weeks later. The Spartans went on to finish 4-8 with assistant Harlon Barnett serving as interim coach the rest of the way, ending the season with a 42-0 loss to Penn State on Friday.\nWhile Michigan State has found itself playing in a stacked Big Ten East division for roughly the last decade -- Michigan, Ohio State and Penn State have all been annual opponents -- that will change in Smith's debut season as the Big Ten expands and does away with divisions. Smith will also get the chance to face some familiar opponents from his time at Oregon State given that four Pac-12 schools are joining the conference. As far as the 2024 season is concerned on that front, Michigan State still faces Ohio State and Michigan (the Wolverines are a protected rival) but avoids Penn State. Oregon is the only newcomer it will face next fall, with the Spartans set to travel to Eugene, Oregon, in early October.\n\nThis article, authored by Dean Straka, was published by CBSSports.com on 2023-11-25 under the category 'sports'.\n\n","id":411}
{"title":"Billie Jean King sees progress in her crusade for more investment women’s sports: 'We’re kind of at a tipping point'","context":"## Billie Jean King sees progress in her crusade for more investment women’s sports: 'We’re kind of at a tipping point'\n\nBillie Jean King is still globetrotting in support of more investment and equity in women’s sports.\nShe attended the Women’s World Cup in Australia, kicked off the player draft for the new women’s professional hockey league in Toronto and is opening an office in London for a tennis business venture involving the international Billie Jean King Cup.\nThat’s all in the last three months for King, who turns 80 in November.\n“We’re kind of at a tipping point,” King said. “People are actually looking at women’s sports like a great investment.”\nShe’s part of ownership groups involved with the Los Angeles Dodgers, the NWSL’s Angel City FC and the PWHL hockey league that starts in January.\nHer busy schedule is reminiscent of the summer of 1973, when a 29-year-old King established the WTA, won the Wimbledon triple crown in singles, doubles and mixed doubles, achieved equal pay at the U.S. Open and beat self-proclaimed chauvinist Bobby Riggs in the “Battle of the Sexes” match.\nOn Thursday, King and about 60 athletes will celebrate the 50th anniversary of equal prize money at the U.S. Open and the King-Riggs match at her annual awards dinner for the Women’s Sports Foundation in New York.\nIn August, former President Barack Obama and first lady Michelle Obama attended the U.S. Open at Arthur Ashe Stadium to mark the pay equity milestone.\n“Let us remember all of this is bigger than a champion’s paycheck,” Michelle Obama said during the ceremony on opening night. “This is about how women are seen and valued in this world.”\nKing recently launched the production company “Pressure is a Privilege,” a phrase associated with the 39-time Grand Slam winner. She’s also an executive producer and host of “Groundbreakers,” a documentary about female athletes that airs on PBS on Nov. 21.\nThere’s an effort by members of Congress to award King the Congressional Gold Medal, one of the highest U.S. civilian honors given to individuals whose achievements have a lasting impact in their field.\nHere’s a Q&A with King, which has been edited for brevity and clarity.\n___\nAP: It’s the 50th anniversary of so many accomplishments in 1973. Talk about that whirlwind.\nKING: We started the WTA four days before Wimbledon. I won all three titles at Wimbledon, which for me was a big deal. Then equal prize money came into being, it started in 1972 with us saying we’re not coming back (to the U.S. Open in 1973). Then King-Riggs. That’s all in 3 months. I can appreciate it since being away from it so long. How the heck did we do that?\nYou’ve said the King-Riggs match was about social change, women standing up for themselves in all areas.\nIt was really about men, too. Because men started to shift a little. Obama was 12 years old when he saw the King-Riggs match. He said it affected him a lot. Guys are much better thinking about their daughters than they used to be. All these things add up.\nYou’re part of ownership groups for pro sports. How did you get involved in women’s pro hockey, which will have teams in Boston, New York, Minnesota, Toronto, Ottawa and Montreal?\nThe PWHL, it’s really exciting. It took five years. Plus, it took all those years of the other leagues, everyone trying. (U.S. Olympic gold medalist) Kendall Coyne said, ‘can you help us?’ We need to have a league where the very best players will play. We went to Toronto and I did an opening speech about trailblazers. It was amazing because the families were crying, the players were crying, they said ‘we’ve never been treated like this, it’s amazing, we feel like pros for the first time.’ There were a lot of little kids there. Kids are going to have an amazing opportunity that the generations before them never had. All three of their networks had it on. It’s a religion up there.\nHow is investment in women’s sports changing?\nI’m asking CEOs and everyone now — ‘do you invest as much in women as you do in men?’ Then it usually gets quiet. But I must say it’s better than it used to be. We’re really lucky to be with this investment group. The male allies we’ve had through the years have made such a difference. They have the money and the power. But we’re getting there, getting more and more women investors, particularly in soccer. Women’s sports, we’ve all been fighting for it.\nWhat would you like to see in the future for women’s sports?\nMore. And make sure we get girls early in life into sports. It’s really about the health issue, more than anything. More jobs, more everything. Women of color and diversity is really important.\nWe only get 5% of the media. That’s where the money is. People always say, ‘why doesn’t the WTA have as much money as the ATP?’ I’m like, really? If you watch a show at night, a sports show, just count how many minutes are on men and how many minutes are on women. We’re at 5%. We’ve got to change that.\n\nThis article, authored by Melissa Murphy, The Associated Press, was published by Fortune on 2023-10-13 under the category 'business'.\n\n","id":412}
{"title":"Israel's prince of public diplomacy","context":"## Israel's prince of public diplomacy\n\nAs a Jewish kid born and raised in London to parents who had moved there from Israel, Eylon Levy dreamed about serving as a spokesperson for the State of Israel. He would sit and watch the then Israeli ambassador to the UK Mark Regev on television and say to himself, \"That's what I want to do when I grow up.\"\nToday, aged 32, that is exactly what he is doing - battling day and night on screens to make the world acknowledge the atrocities and the reality forced on Israel since October 7, as a government spokesperson to the international media at the National Public Diplomacy Directorate in the Prime Minister's Office.\nHe tells \"Globes,\" \"Perhaps you won't believe it but it has always been my dream to act as a spokesperson for the state. It's a shame that it's in such painful circumstances. The legendary Mark Regev and myself have been working shifts on the TV channels worldwide and I remember how I watched him as a kid in London and wanted to do what he is doing.\"\nBack in October few people had heard of Levy. But now sitting in a café in the Azrieli Mall in Tel Aviv to be interviewed by \"Globes,\" passersby clearly recognize him and some even stop to take a selfie with him.\nTo filter out the bullshit\nIn recent weeks, interviews with Levy have gained massive exposure worldwide and the Israeli public has embraced the eloquent and quick-witted spokesperson who has been articulating Israel's point of view so admirably, with his English accent. With degrees from both Oxford and Cambridge, Levy received the greatest exposure in an interview with UK Sky News presenter Kay Burley, who asked him whether the fact that Israel is willing to release 150 Palestinian prisoners in exchange for 50 Israeli hostages indicates that Israel thinks that Palestinian lives are worth less.\nLevy's spontaneous, shocked response saw his eyes open wide with surprise and his eyebrows shoot up. But within a second he had regained his composure and explained that Israel would release one Palestinian for each Jewish hostage if it could. \"We did not choose to release these prisoners who have blood on their hands. That's a disgusting accusation.\"\nThe strange question aroused anger and criticism worldwide but Kate Burley did not apologize and even justified her question on X (formerly Twitter) by saying that interviewers sometimes present one side of an argument so that those being interviewed can refute it. She claimed that she was presenting a controversial opinion that she had heard to allow the interviewee to respond.\nLevy does not accept this explanation. \"It's true that the role of the media is to challenge speakers with controversial opinions but it is also to filter out the bullshit and to know when you have been told nonsense that requires no further comment,\" he says.\nLevy posted the clip from the interview on his Twitter account and it received 16 million views and 15,000 shares (just from the Tweet). His number of followers has soared from 24,000 before the war to 140,000 after the Sky News interview. At the same time his look of astonishment and raised eyebrows have become a popular meme and WhatsApp sticker. \"If you would have told me several weeks ago that people would make memes of my face I wouldn't have believed it. But joking aside, we are here to explain the story of Israel abroad, if along the way there are amusing moments that allow people to enjoy a funny moment amid all the darkness and gloom we are experiencing, then let the joke be on me.\"\nAre you are asked many questions that smack of antisemitism, or lack of understanding and support for Israel's position?\nHow long have you got? I was asked by the BBC in a radio interview whether there is CCTV evidence that the hostages are in Shifa Hospital and what medical treatment were they receiving. I was asked by Sky News about why Yahya Sinwar was releasing hostages, even though Israel is bombing Gaza and I had to explain that it was because Israel is bombing Gaza.\n\"I was asked twice, in Ireland and by the Voice of America, why Hamas had been begging for five weeks to return hostages and we were only now bowing to US pressure to take back our children. I was interviewed by Piers Morgan in London who is very confrontational, who spoke to me about pictures from Gaza and said 'this the most shocking thing I have ever seen.' And I told him Piers, 'the most shocking thing we have seen in our lives was the slaughter on October 7.' Then he answered 'you are right.'\"\nFrom questions like these, do you get the feeling that everyone in the world hates us and they are all anti-Semites?\n\"It's not true that everyone hates us and they are all anti-Semites. We enjoy a great deal of support in the world. People understand that what happened on October 7 crossed a line with atrocities that cannot be repeated and for which there can be no excuse. This is what gives us legitimacy in this war against Hamas and the understanding that it not possible not to respond to this.\"\nWhy is it so hard for the world to understand this point of view?\n\"We are faced with difficult images coming out of Gaza. Israeli TV does not show what viewers abroad see of the destruction as a result of the military campaign to destroy the terrorist infrastructure built beneath houses, hospitals, mosques and schools. The world sees these pictures and wants to understand why we are doing this to civilians in Gaza. We are asked for how long? What's the limit? And we have to explain things that to Israelis sound self-evident, but in the world to those who do not live in our reality, they are incomprehensible. We must explain that this is a war imposed by Hamas through the most terrible massacre since the Holocaust, and it is a war that we must win because Hamas has repeated that it wants to carry out more October 7s until it murders every man, woman and child in our country.\"\nDo the explanations produce greater acceptance?\n\"Yes. There is understanding that we must end this war by destroying the capabilities of Hamas, otherwise we will be in the same situation in another six months. This is something I explain a lot to the Irish, for example. The Irish have been pressing for a ceasefire for a long time and I explain to them that if we had taken their advice and stopped firing then little Emily Hand would still be in captivity, and if we take their advice now to agree to a ceasefire then Hamas will commit more atrocities, because it will feel empowered and it will come out of this war with a feeling that the world has its back.\n\"We are being asked difficult questions about the dead on the other side and we must remind them that everyone who was killed in the Gaza Strip over the last month would be alive today if Hamas had not started the atrocities on October 7, and then decided to fight in populated areas, while preventing people from leaving despite all of Israel's efforts for over a month to evacuate civilians from the battle zones.\"\nLies continue to echo\nIn recent weeks Levy, and all Israel's spokespeople and volunteers in the National Public Diplomacy Directorate, headed by Moshe Aviv, have been working around the clock. \"We try to be available 24\/7. Last Friday I was interviewed at six in the morning and I finished with a CNN interview the following morning at 2am. There was a Saturday when I did four interviews with the BBC and it's not just me. Mark Regev is doing interviews at all hours of the night as well as Tal Heinrich in the US who is being interviewed non-stop in prime time. I am part of an amazing team of professionals.\n\"The work is being done in collaboration with Israel Police, the Ministry of Foreign Affairs, the IDF Spokesperson, the Israel prisons Service, the Shin Bet, the National Security Council and the Ministry of Diaspora Affairs, which is responsible for producing items for digital channels. It's amazing to see every day when we all assess the situation, how all these bodies put their egos aside and I'm proud to be a part of it. If any channel wants an official spokesperson for the Israeli government, then we will be there because we cannot abandon the battlefield.\"\nThe world does not make life easy for Israel's spokespeople, to say the least, compared with the ease with which the Hamas narrative is adopted. \"I remember an interview the day after the bluff about the Al-Ahli hospital, which the Palestinians claimed had been hit by an Israeli missile, killing 800 civilians, but in the end it turned out that it was actually by a splinter group of Islamic Jihad, and that no hospital was destroyed and certainly not 800 people were killed. I explained to them in Sky News that Hamas lies and makes up numbers and the reporter asks me almost speechless with surprise, if I doubt Hamas' numbers.\"\nLevy describes these moments as intensely frustrating. He recounts, \"In a BBC interview, the interviewer told me 'Hamas denies what you are saying,' and you see the frustration on my face when I tell her that of course Hamas denies this. Hamas denies that it is even holding hostages. Hamas massacres, beheads, rapes, burns families, and then, day and night, denies that it did this.\n\"Some journalists around world see that Hamas continues to lie about the biggest things when the whole truth is in front of everyone's eyes, and they continue to echo the lies. This is not only a kinetic war in Gaza, it is also an information war.\"\nTwo months now, Levy has been fighting in this arena with the tools at his disposal. \"We are fighting to make it clear to the world that the information coming out of Gaza comes either directly from Hamas or from independent reporters and photographers that are part of the system in Gaza. Everyone knows that even if they are not affiliated with Hamas, they are not free to present the full truth, because they are not allowed to. There is not a single photo of a terrorist, there is not a single photo of a missile being launched from a densely populated area, from a mosque or a school, not even a single photo from the Hamas tunnels under Shifa. Why? Because these reporters, even if they are not explicitly on the side of Hamas, operate under a dictatorial regime and cannot provide the information even if they wanted to. And it is very important to continue reminding the world how much the information that reaches them is biased and does not reflect reality.\"\nDespite all this, Levy feels he must stress that not everyone is against us. \"I don't want to give the impression that all the interviewers are hostile and every question is delusional. Absolutely not. I have many interviews with reporters who understand what is happening here and simply want to get information and hear the Israeli side, which is completely legitimate.\"\nGeorge Galloway got up and walked out\nLevy was born and raised in England and attended a private school in North London in an area with a large Jewish population. He has always taken an interest in news and current affairs and a student was active in the world of debating, including tournaments. \"It would not be an exaggeration to say that I would sit in the bath reading The Economist. Arguing and opposing incorrect positions has always been one of my great hobbies. Alongside this, I grew up with a strong awareness of the importance of the State of Israel and its historical role in the history of our people. I have often had to explain Israel over the years.\"\nThe UK is currently in the headlines over anti-Israel and pro-Palestinian demonstrations and antisemitism. Did you encounter antisemitism in your childhood there?\n\"I did not personally experience antisemitism but I was exposed to it during debates and every time there was a round of fighting I found myself defending Israel's position.\"\nOne of the most significant occasions on which Levy was defending Israel was in 2013, when he was an undergraduate at the University of Oxford, and was conducting a debate with British MP George Galloway on his remarks about Israel. \"Galloway is known as a notorious Israel hater. He arrived an hour late gave his crazy speech and sat down and then I spoke. In the middle of the speech I said 'we' referring to the State of Israel, and he stood up and asked me 'what do you mean we? Are you Israeli? When I answered yes, he said 'I don't do debates with Israelis. Goodbye' and left. It was filmed and the next morning all the UK media reported on it. It even made it into a cartoon in \"The Times.\"\nThat was a moment that reverberates for Levy when he sees what is currently happening in universities around the world. \"I look at what is happening on campuses around the world and tear my hair out, because I was there 10 years ago and tried to warn about the connection between antisemitism and anti-Zionism, how deep-rooted the hatred against Israel actually is and how many Jews are harmed by this blind hatred.\"\nIn 2014, on completing his master's degree in international relations at the University of Cambridge, Levy found himself at the crossroads that led him to Israel: \"One option was to study law and work as a lawyer in London, and the other option was to go on a Zionist adventure. That summer I was on the March of the Living and I remember myself standing wrapped in a flag and crying, realizing that a decision had been made. I decided that I was immigrating to Israel and enlisting in the army at the age of 23.\"\nThe decision was made just as Operation Protective Edge (2014) began. \"I wanted to enlist to help in the war. It was the scariest experience in my life. I remember a child who looked out the window and said, 'Dad, I think I saw a missile.'\"\nWhen I actually immigrated to Israel, the taxi driver told me that the war had finished six months previously. Even so I reported the next day to the IDF Induction Center in Tel Hashomer.\"\nLevy served in the command center of the IDF coordinator of activities in the administered territories, which is responsible for civil policies and security coordination with the Israeli government in Judea, Samaria and the Gaza Strip. After his army service he worked as a newsreader for the English news on the Israel Broadcasting Authority and then as a newsreader for i24News. He served as foreign media advisor for President Isaac Herzog for two years until May 2023 and has translated some 30 books from Hebrew to English. He was also active in the protests against the government's judicial reform.\nSo how does that all fit together - one day you are at a demonstration against the government and the next day you are its spokesperson?\n\"Like many, I participated in the protests against the reform. It's no secret. There was Israel before October 7 and there is Israel after. Nothing will return to what it was before. There is now only one task: to win the war, and for that we must put the wars of the Jews aside and unite.\"\nThis is also the message with which Levy wants to conclude the interview. \"It's amazing to see how Israeli society has come to its senses after the traumas. One of our strengths is that everyone works for everyone,\" he says proudly. \"When I left synagogue on Yom Kippur after the concluding services and I saw what was happening in Dizengoff Square with all the shoving and the shouting, I found myself on the verge of tears. Today I miss the days when we were on the verge of a civil war because of a gender partition (in Dizengoff Square).\"\n\"It's so ridiculous what we argued about and what we pulled our hair out over for before October 7, a date that reminds us all of the big picture, why we are here, why we owe each other and in the end also love each other. It's sad that it took such a tragedy to remind us of the importance of unity in the nation, but we must maintain it.\"\nPublished by Globes, Israel business news - en.globes.co.il - on December 3, 2023.\n© Copyright of Globes Publisher Itonut (1983) Ltd., 2023.\n\nThis article, authored by Ela Levi-Weinreb, was published by Globes English | Israel Business Arena on 2023-12-03 under the category 'business'.\n\n","id":413}
{"title":"Damien Penaud leads historic rout of Italy as France confirm progress in style","context":"## Damien Penaud leads historic rout of Italy as France confirm progress in style\n\nEt voilà. France are through to the quarter-finals after the tournament’s latest mismatch against a demoralised Italy. The unthinkable outcome – a pool-stage exit for Fabien Galthié’s side – had remained a possibility, but was never on the cards from the moment Damian Penaud scored the first of eight French tries in the second minute. France have beaten Italy 14 times consecutively, a run stretching back to 2014.\nIf the predatory Penaud’s progress is a marker of France’s hopes, their fellow title contenders should be worried. The wing has scored in seven straight matches and 14 times this year. Two tries here took him to second overall in their men’s try-scorers’ chart, with 35, three behind Serge Blanco. As a whole, the French machine is tuning up satisfactorily with top spot in Pool A secured. A potential last-eight collision with Ireland or South Africa, or indeed Scotland, will be a monumental affair.\n“It’s easy to congratulate Damian for his attacking performance,” Galthié said. “But it’s also easy when you have a team like that working for you. Players that become great are served by their teams; there’s always a balance.” The former France scrum-half added: “We’re happy to qualify … We’ll recuperate together, celebrate qualification, then turn to the quarter-final. For us, after a World Cup final against New Zealand [on opening night], our game next Sunday will be a second final.”\nFor Kieran Crowley, Galthié’s opposite number, his Italy tenure ends in profound disappointment, although crushing defeats by the All Blacks and now the hosts are offset by victories against Namibia and Uruguay.\n“I’ve said before, I’d like to take this team forward,” he said. “I think the next World Cup is our cycle … we’ll get to the next tournament, and a lot of these players will have 60, 70 caps. But that wasn’t my decision.\n“What needs to happen is that these players need to be treated with a bit of respect off the field … They [the Italian Rugby Federation] need to get some of that stuff sorted. Quite honestly, I don’t know if I’d want to be involved unless that gets sorted. I respect these guys, these players and staff. They’ve gone way beyond … and yet people will judge us on these last two games. It’s disappointing.”\nDamaging setbacks have arrived with regularity for France, most notably Antoine Dupont’s fractured cheekbone. But the prop Cyril Baille had returned from injury in the thrashing of Namibia, along with the estimable Jonathan Danty in midfield, and both started against Italy.\nAny hint of home nerves was calmed by the try for Penaud that stemmed from the first attack. Uini Atonio and Thibaud Flament were both involved, busting through tackles and creating a huge overlap for Penaud. Thomas Ramos belted over a penalty and the pressure on Italy continued unabated, Penaud fluffing a grubber kick with another big overlap created.\nThe hosts quickly came again, and Penaud got his kick right this time, picking out Louis Bielle-Biarrey with a chip that the wing converted impeccably. Ramos flopped over after another fluent exchange with Gaël Fickou.\nLouis Bielle-Biarrey scores France’s try to again underline his potential. Photograph: Anne-Christine Poujoulat\/AFP\/Getty Images\nAt 24-0 Italy temporarily steadied a listing ship. After Ange Capuozzo was removed for a head injury assessment, Simone Ferrari powered over, but the television match official spotted a high hit by Ferrari on Maxime Lucu and the try was chalked off. Almost immediately, Penaud went over at the other end to secure a bonus point after fielding Matthieu Jalibert’s cross-kick. It was 31-0 at half-time.\nskip past newsletter promotion Sign up to The Breakdown Free weekly newsletter The latest rugby union news and analysis, plus all the week's action reviewed Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\nThings got worse for Italy when Jalibert darted through a gap seven minutes after the break and when Peato Mauvaka, the France hooker, crashed across the line, Italian heads were beginning to drop alarmingly.\nCapuozzo failed his HIA – another unwelcome blow – while Galthié’s thoughts were turning to managing his resources for the quarter-final: Melvyn Jaminet replaced Ramos and Yoram Moefana, freshly introduced in midfield for Fickou, jogged in for the seventh on 63 minutes.\nItaly mustered a consolation score via Manuel Zuliani, his try converted by the fly-half Tommaso Allan, before Moefana completed a bright cameo with his second.\n“Our goal is to win the game,” Galthié said of France’s eight-try display. “There are several boxes to tick. The important thing is that at the end of the game, we end up ahead. We are not here to show off, or to look good. We’re here to win.” He added that he expects the injured Dupont and Julien Marchand to play during the knockout stages.\nWhen flanker Charles Ollivon – sitting alongside his head coach – was asked about next Sunday’s opponents, Galthié interjected. “We can’t know our opponent. Have you played tomorrow’s game already? There is a Scotland v Ireland game that may modify the quarter-finals. If you are talking about our quarter-final opponents, it’s quite simple. It’s a World Cup final for us.”\n\nThis article, authored by Luke McLaughlin at OL Stadium, was published by The Guardian on 2023-10-06 under the category 'sports'.\n\n","id":414}
{"title":"A timeline of Sam Altman’s firing from OpenAI — and the fallout","context":"## A timeline of Sam Altman’s firing from OpenAI — and the fallout\n\nIn a dramatic turn of events late Friday, ex-Y Combinator president Sam Altman was fired as CEO of AI startup OpenAI, the company behind viral AI hits like ChatGPT, GPT-4 and DALL-E 3, by OpenAI’s board of directors. Then, the company’s longtime president and co-founder, Greg Brockman, resigned — as did three senior OpenAI researchers. And the fallout continues.\nTip TechCrunch\nDo you work at OpenAI and know more about Sam Altman’s departure?\nDo you work at OpenAI and know more about Sam Altman’s departure? Get in touch with TechCrunch\nIt’s a fast-moving situation that we’re still trying to get to the bottom of. No doubt more will become clear as time goes on. To make it easier to follow all that’s happened in the meantime, though, we’ve put together a timeline; we’ll do our best to keep it current.\nTimeline of Sam Altman’s firing from OpenAI\nNovember 29\nMicrosoft gains a board observer\nMicrosoft will gain representation on the new initial board of directors in the form of a non-voting observer, OpenAI announced. It wasn’t immediately clear who this observer might be — only that they won’t have an official vote in board business.\nNovember 21\nSam Altman, OpenAI reach agreement on return as CEO and ‘initial’ new board\nIn a sudden late announcement, OpenAI revealed that it and Altman “have reached an agreement in principle” for him to return as the company’s CEO. In addition to Altman’s return, its new “initial” board will include former Salesforce chief executive Bret Taylor, former US Secretary of the Treasury Larry Summers and Quora founder Adam D’Angelo.\nWe have reached an agreement in principle for Sam Altman to return to OpenAI as CEO with a new initial board of Bret Taylor (Chair), Larry Summers, and Adam D'Angelo. We are collaborating to figure out the details. Thank you so much for your patience through this. — OpenAI (@OpenAI) November 22, 2023\nAltman also posted about the new deal, giving some insight into the roller coaster that we’ve all been riding since his firing was revealed Friday. In his words, his decision to join Microsoft on Sunday “was the best path for me and the team.” Since then, the new board’s composition and Microsoft’s support appear to have been enough to bring him back to the AI company he co-founded.\nAltman and board in talks\nOpenAI’s board of directors is reportedly in talks with Sam Altman, ex-Y Combinator president and an OpenAI co-founder, to return to OpenAI as CEO as soon as this week. That’s according to Bloomberg, which in a brief — citing sources close to the matter — said that discussions are happening between Quora CEO Adam D’Angelo, one current member of the OpenAI board, and Altman — and possibly other board members as well.\nBoard tensions boil over\nThe New York Times reports that, before his ousting, Sam Altman made a move to push out board member Helen Toner because he thought a paper she had co-written was overly critical of OpenAI. That, among other issues, led to OpenAI’s current predicament. Speaking of, The Times indicates that negotiations to hire Altman back continue — but that one major sticking point remaining is “guardrails” meant to improve Altman’s communication with the board.\n—\nNovember 20\nAltman joins Microsoft\nSam Altman, Greg Brockman and colleagues announce that they’ll join Microsoft to lead a new AI research team. Nadella leaves the door open to other OpenAI staffers, saying that they’ll be given the resources they need should they choose to join.\nSutskever’s mea culpa\nSutskever publishes a post on X suggesting that he regrets his decision to remove Altman and that he’ll do everything in his power to reinstate Altman as CEO.\nI deeply regret my participation in the board's actions. I never intended to harm OpenAI. I love everything we've built together and I will do everything I can to reunite the company. — Ilya Sutskever (@ilyasut) November 20, 2023\nEmployees threaten to resign\nNearly 500 of OpenAI’s roughly 770 employees — including, remarkably, Sutskever — publish a letter saying that they might quit unless the startup’s board resigns and reappoints the ousted Altman. Later Monday, that number climbed to over 650.\nAltman and Brockman considering return\nAs reported by The Verge, Altman’s move to Microsoft isn’t a done deal — and both Altman and Brockman are still open to returning to OpenAI. That is, if the remaining board members who initially fired him step aside.\nOpenAI board considers merger\nOpenAI’s board of directors approached Dario Amodei, the co-founder and CEO of rival large-language model developer Anthropic, about a potential merger of the two companies, The Information reports. The approach was part of an effort by OpenAI to persuade Amodei to replace Altman as CEO — but Amodei quickly turned down the CEO offer.\n—\nNovember 19\nAltman to meet at OpenAI HQ\nAccording to The Information, Altman is expected to meet at OpenAI’s San Francisco headquarters as executives at OpenAI push to have him reinstated as CEO. Brockman was invited to join — but it’s unclear whether he’ll take execs up on that invitation.\nBoard negotiations hit a snag\nBloomberg reports that Lightcap and Murati, among others, are pushing the board to reinstate Altman. But unsurprisingly, the directors are resisting. As of midday Sunday, the board hadn’t resigned out of concern over who could replace them, and were vetting candidates. One possible new addition could be Salesforce co-CEO Bret Taylor.\nAltman out, Shear in\nAltman won’t be returning as CEO, according to a report in The Information citing an internal memo sent by Sutskever. As the search for a new permanent CEO continues, OpenAI has appointed Emmett Shear, the co-founder of video streaming site Twitch, as interim CEO — replacing Murati.\n—\nNovember 18\n“Not … in response to malfeasance”\nIn an internal memo obtained by Axios sent Saturday morning, OpenAI COO Brad Lightcap said yesterday’s announcement “took [the management team] by surprise” and that management had had “multiple conversations with the board to try to better understand the reasons and process behind their decision.” Discussions were ongoing as of Saturday morning, per the memo.\n“We can say definitively that the board’s decision was not made in response to malfeasance or anything related to our financial, business, safety, or security\/privacy practices,” Lightcap added. “This was a breakdown in communication between Sam and the board … We still share your concerns about how the process has been handled, are working to resolve the situation, and will provide updates as we’re able.”\nOpenAI’s funding in jeopardy\nThe planned sale of OpenAI employee shares that would value the startup at about $86 billion could be in jeopardy. The Information, speaking to three sources formerly with the company, reports that they no longer expect the sale — led by Thrive Capital — to happen, or, if it does, to come with a lesser valuation because of the recent turn of events.\nAltman planning new venture\nAltman has been telling investors that he’s planning to launch a new venture, according to The Information. Brockman is expected to join the effort — whatever form it takes. (Possibly an AI chip startup.)\ni love you all. today was a weird experience in many ways. but one unexpected one is that it has been sorta like reading your own eulogy while you’re still alive. the outpouring of love is awesome. one takeaway: go tell your friends how great you think they are. — Sam Altman (@sama) November 18, 2023\nInvestors pushing for Altman’s return\nInvestors — furious at the turn of events — are reportedly exerting pressure on OpenAI’s board to reinstate Altman, going so far as to recruit Microsoft. Nadella is said to be sympathetic.\nBoard agrees to reverse course — in principle\nThe Verge reports that the board agreed in principle to resign and to allow Altman and Brockman to return. It waffled, however, missing a deadline yesterday by which many OpenAI staffers were set to leave the company. Altman is said to be ambivalent about coming back and asking for “significant” governance changes.\n—\nNovember 17\nBrockman demoted\nBrockman says he got a text from Sutskever shortly after noon on Friday asking for a quick call. After sending a Google Meet link, Brockman was told that he was being removed from the board as chairman “but was vital to the company and would retain his role” as president, and that Altman had been fired.\nAltman’s firing publicly announced\nOpenAI published a post on its blog announcing the executive shake-up. The company’s management team was aware shortly after.\ni loved my time at openai. it was transformative for me personally, and hopefully the world a little bit. most of all i loved working with such talented people. will have more to say about what’s next later. 🫡 — Sam Altman (@sama) November 17, 2023\nAll-hands meeting\nOpenAI held an all-hands meeting Friday afternoon during which Sutskever defended Altman’s ouster. He dismissed suggestions that pushing Altman out amounted to a “hostile takeover,” and claimed that it was necessary to protect OpenAI’s mission of “making AI beneficial to humanity.”\nMicrosoft releases a statement\nSatya Nadella, the CEO of Microsoft, a major investor in — and partner with — OpenAI, published a statement about Altman’s firing:\n“As you saw at Microsoft Ignite this week, we’re continuing to rapidly innovate for this era of AI, with over 100 announcements across the full tech stack from AI systems, models and tools in Azure, to Copilot. Most importantly, we’re committed to delivering all of this to our customers while building for the future. We have a long-term agreement with OpenAI with full access to everything we need to deliver on our innovation agenda and an exciting product roadmap; and remain committed to our partnership, and to Mira and the team. Together, we will continue to deliver the meaningful benefits of this technology to the world.”\nBrockman quits\nBrockman announced his resignation from OpenAI, citing “today’s news.” After sending a memo internally, he published the text on X.\nAfter learning today’s news, this is the message I sent to the OpenAI team: https:\/\/t.co\/NMnG16yFmm pic.twitter.com\/8x39P0ejOM — Greg Brockman (@gdb) November 18, 2023\nSenior OpenAI researchers resign\nThree senior OpenAI researchers resign after Brockman, including the director of research Jakub Pachocki and head of preparedness Aleksander Madry.\n—\nNovember 16\nIlya Sutskever schedules call with Altman\nAccording to a post on X (formerly Twitter) from Brockman, Ilya Sutskever, the chief scientist at OpenAI and a co-founder, texted Altman on Thursday evening about scheduling a Friday noon call.\nSam and I are shocked and saddened by what the board did today. Let us first say thank you to all the incredible people who we have worked with at OpenAI, our customers, our investors, and all of those who have been reaching out. We too are still trying to figure out exactly… — Greg Brockman (@gdb) November 18, 2023\nMurati told of Altman’s firing\nBrockman alleges that Mira Murati, OpenAI’s CTO and now interim CEO, was informed on Thursday night that Altman would be fired.\n\nThis article, authored by Kyle Wiggers, was published by TechCrunch on 2023-11-18 under the category 'technology'.\n\n","id":415}
{"title":"Amidst Managerial Shake-Ups, These 5 MLB Teams Are Looking for a New Leader: Who Are the Top Candidates?","context":"## Amidst Managerial Shake-Ups, These 5 MLB Teams Are Looking for a New Leader: Who Are the Top Candidates?\n\n2023 has been a topsy-turvy year for many teams. While some have outshone others, these 5 teams are at a crossroads, with a common stifling problem. Amid the heavy restructuring that many of the MLB teams have seen of late, there are pentagonal vacancies for managers. The New York Mets, the Los Angeles Angels, the Houston Astros, the Cleveland Guardians, and the San Diego Padres are in dire need of filling up the managerial position as the year ends.\nAmerica’s Favorite Video Today\nWhile some team representatives skim through names within the MLB world, some hope to look for an outside hire. It could be a risky state for all of them. Nevertheless, there are many possibilities and roadblocks one might encounter. Be it budgetary issues, past performance, or availability of candidates, these teams have not had success in putting a pin on one candidate. That said, the skipper market is abuzz!\nStarting With The Los Angeles Angels\nADVERTISEMENT Article continues below this ad\nAfter Joe Maddon was relieved of his managerial duties, Phil Nevin signed up as the interim manager for the remaining 106 games of 2022. Post that, he went on to sign a one-year contract to manage the Angels in 2023, and the interim tag was lifted. Nevin’s 2024 club option was rejected by the Halos, who underwent partial two seasons of 119-149 (.444) play under his supervision. Since this was a non-negotiable, the seat stands vacant.\nThe biggest challenge in this scenario is that the Angels star, Shohei Ohtani is yet to reveal which team he would be joining. In case the Angels re-sign the two-way phenom, the manager would get to head the roster with the 2021 MVP and Mike Trout. A once in a lifetime opportunity. On the flip side, if they lose Ohtani, the roster would need a solid revamp. Not to mention the Angles are infamous for their below-par farm system and playoff drought spanning 9 seasons.\nWith that out in the open, what are the possible options for the Halos? Ray Montgomery could be an option, considering that he began his tenure with the Angels. Walt Weiss could potentially be a decent fit, too. Weiss has been a part of a successful team in the Atlanta Braves recently, having been their bench coach since before the 2018 season. Additionally, among other options are Ron Washington and Clayton McCullough. Though these options are open, no solid information has been revealed yet as to who would fill up the position.\nMoving On To The Houston Astros\nAfter his fourth season with the Astros and his 26th big league managerial season, Dusty Baker announced his retirement last week. Houston won the 2022 World Series and two pennants while the 74-year-old was in charge. Despite the starry possibilities of winning, the Texas Rangers defeated the Astros in the ALCS 2023.\nWith that seat now waiting to be warmed up, the future manager would manage a seasoned roster that appears ready to make another push at winning a World Series after winning six of the previous seven AL West championships. However, given Luis Garcia’s Tommy John surgery and Lance McCullers Jr.’s forearm surgery, the starting pitchers are expected to be shaky.\nThat said, there are some obvious options available to replace Dusty. One of the most sensible picks for a smooth transition would be Joe Espada, age 48. Since 2018, he has been the bench coach for the Astros. Baker relied on him in the dugout throughout his productive tenure as manager of Houston.\nApart from him, Buck Showalter, former New York Mets manager, Don Mattingly, Toronto Blue Jays bench coach, and A. J. Hinch, Detroit Tigers manager could be other possibilities.\nNext Up Is Cleveland Guardians\nFollowing an 11-year tenure with Cleveland that included leading the team to a 921-757 record (.549), six playoff trips, and the 2016 AL pennant, Terry Francona announced his resignation. The record made him the winningest manager in franchise history. He had managed the Guardians till the conclusion of the 2023 season, but now, owing to health concerns, he decides to put his wellbeing first.\nSince Cleveland usually has one of the lowest payrolls in baseball, the team’s lineup won’t be receiving a lot of outside reinforcement. It is clear that the Guardians are not keen on getting someone from within MLB; they are open to outside hires as well. As long as the new candidate can follow Terry’s principles.\nOne applicant slated for an interview was Craig Albernaz. He is the catching and bullpen coach for the San Francisco Giants, according to Paul Hoynes of Cleveland.com. Despite lacking Major League managerial experience, the 40-year-old has led two championship-winning Tampa Bay Rays teams. Another likely candidate could be Carlos Mendoza, who is the bench coach for the New York Yankees. Though he too lacks managerial experience in MLB, the 43-year-old is familiar with the Yankees system, suiting well for Cleveland.\nSpeaking Of NY, The New York Mets Are On The Lookout\nIn his first season as manager, Buck Showalter guided the Mets to a 101-61 record. With that, he earned him the 2022 NL Manager of the Year Award. However, despite having baseball’s largest budget, the Mets ended their 2023 with a disastrous 75-87. Under the new president of baseball operations David Stearns, the organization is taking a fresh approach. The man who described 2023 as “the roller coaster of disappointment and hope” presiding over the Mets views his limited options.\nGabe Kapler made the exit three days before the San Francisco Giants season’s conclusion; he could post as a suited candidate. Another likely possibility would be Craig Counsell, who is nearing the end of his contract with the Milwaukee Brewers. Counsell is the guy to watch out for this summer because of his excellent relationship with David Stearns. This newest president of baseball operations for the Mets is a former Brewer himself.\nThe Fifth Team In The List Is San Diego Padres\nBob Melvin was said to be returning to the Padres as manager, despite the team’s 82-80 record and 2023 postseason absence. But in a turn of events, the San Francisco Giants hired Melvin when San Diego gave permission to interview him for SanFran’s managerial vacancy.\nADVERTISEMENT Article continues below this ad\nNow, the Padres’ vacant position is linking to former Cardinals manager Mike Shildt multiple times. Bob Nightengale of USA Today Sports reports that Shildt is the front-runner to take over. “The Padres will be hiring their sixth manager in just 10 years under (general manager) A. J. Preller. Former St. Louis Cardinals manager Mike Shildt is the favorite while associate manager Ryan Flaherty is getting strong consideration,” Nightengale said. With that, one has to wait and watch who serves as the best fit.\nADVERTISEMENT Article continues below this ad\nWith the facts broken down, it is a matter of time that the teams narrow down their best options. MLB world will welcome 2024 with high expectations. With new management, the fans expect teams to come back with great vigor and ferocity.\nWatch This Story: Every MLB Team That Has Never Won a World Series\n\nThis article, authored by Kanishka Prakash, was published by Essentially Sports on 2023-10-30 under the category 'sports'.\n\n","id":416}
{"title":"Teenage Engineering's K.O. II sampler proves the company can do cost-friendly cool","context":"## Teenage Engineering's K.O. II sampler proves the company can do cost-friendly cool\n\nThere's something of a theme running through Teenage Engineering's recent products. That theme is you need more money. The Field range represents the Swedish company’s most exclusive music making gear. So when its website teased a new product with a colorful countdown, the wallets of Teenies everywhere braced for impact. Once that timer hit all zeros, the big reveal turned out to be the EP-133 sampler. Or, to give it its full name, the EP-133 K.O. II 64MB Sampler Composer. The real surprise though, was that it both looked cool and, at $299, was reasonably priced.\nFadergate\nThe countdown was really just the start. Barely 24 hours after the K.O. II was revealed units started landing in buyers’ hands. Within days, YouTube was awash with first look videos and tutorials. Before our review unit even showed up, several users were complaining that theirs had defective faders. Enough folks were having this problem that it quickly became known as “fadergate.” One brave creator even took their unit apart and, possibly, discovered the cause — the internal pins were bent and not making a connection. I asked Teenage Engineering about the issue and will update this story once I hear back.\nSome buyer’s theorized that the issue might be caused by the fact that the K.O. II ships without the caps on its rotaries and fader. They come loose in the box to enable the packaging to be flatter, but the cap for the fader is unusually tight fitting. This led to speculation that the enthusiasm required to push this cap down might be putting too much pressure on components inside, opening up the cruel possibility of users breaking their own devices before they even got to play with them. I used extra caution, along with some needle-nosed tweezers to support the fader as I applied its cap and so far… so good?\nPhoto by James Trew \/ Engadget\nThe K.O. II name tells us that Teenage Engineering considers this something of a sequel to the original PO-33 K.O. Clearly the K.O. II isn’t a Pocket Operator, but its retro desk calculator aesthetic does take subtle design cues from that series. At 12-inches diagonally, it’s in iPad territory size-wise. The K.O. II also runs on AAA batteries (or USB power) which is another nod to the PO series. It’s hard to say how long it’ll run on those batteries and it’ll vary from brand to brand, but I’ve been using some cheap rechargeables for over a week and they seem to be going strong.\nPersonally, I was never particularly enamored with the Pocket Operators and much prefer the form factor of the K.O. II. It’s still very portable, but feels a bit more “serious.” It’s also just very nice to look at, which is something Teenage Engineering is quite good at. The model number, EP-133, indicates that we might see others in the line, so fingers crossed for giant calculator versions of other instruments, too.\nIn use\nFader fully checked and batteries in place, the K.O. II springs to life with a flourish of icons across its display. Those icons are actually fixed and not made up of pixels. Teenage Engineering calls it a “Super segment hybrid display” which basically fuses the digital watch part with a bunch of colorful, cute custom icons to let you know when certain modes or features are activated. It reminds me of the old Game & Watch handhelds where you can see where all the icons are and they are simply switched on or off as needed. Some of the icons are pretty abstract but there is a guide on the website to let you know that, for example, the red umbrella means undo.\nPhoto by James Trew \/ Engadget\nSomething I like to do with music gear is to see how easy it is to use without reading the manual. This works for all gadgets of course, but with music gear there are common tasks like sequencing, timing adjustment, automation and so on. How you achieve these on a drum machine might be very different to a keys-based synth. Teenage Engineering in particular likes to do things its own way but I was pleasantly surprised with the K.O. II. Within minutes I had managed to figure out basic navigation and how things are organized (sample groups, accessing shift functions, what the fader does and when and so on).\nDuring this blind test I also got to know the K.O. II’s buttons and faders. It was obvious from the launch materials that we weren’t getting rubber MPC-esque pads here but I would describe the ones on the K.O. as keys rather than buttons. Fortunately they are satisfying to click and they’re pressure sensitive so you can give your drum hits different velocities or play notes at different strengths, just be sure to focus on the lower part of the key as that seems to be where the sensor is.\nYou probably should read the manual though. If for no other reason than it’s likely the prettiest one you’ll use in a while. There’s also a very cute tool for managing your samples which works via desktop browser. For the brave, you can also use this on your phone if you have Android (Chrome, Brave and Opera should all work). On iOS the same browsers can’t access Web MIDI and therefore will not work. (There’s the iOS Web MIDI Browser which crashes when I tried it with an iPhone but it does connect so your mileage may vary.) The K.O. II won’t show up on your PC as either a drive or an audio interface, so the main uses for the USB port are power and sending\/receiving MIDI.\nThe workflow for grabbing sounds is pretty straightforward. If you want to sample from either a PC or phone or other sound-making device then as long as you can connect it to a 3.5mm cable you’re golden. For everything else, you’ll be using the built-in mic, which is surprisingly good. I recorded a few short vocal phrases and other found sounds and they come out well, assuming you’re in a quiet environment.\nPhoto by James Trew \/ Engadget\nDon’t worry though, if you don’t have a bunch of samples yet, the K.O. II comes with a bunch pre-installed, and they’re pretty great. There’s a good mix of drums, bass pads and lead sounds — certainly enough to get you going straight away. You’ll definitely want to add your own though to make your projects unique. The presets use about half of the 64MB of memory, but you can back them up, delete them and free the slots up for your own. Max sample length is 20 seconds (same as on the OP-1 Field).\nIf 64MB doesn’t sound like a lot, know that it translates to about 11 minutes of samples at the 46kHz\/16bit in which the K.O. II records. You can halve that time if you sample in stereo. Even if you go all out, over five minutes of samples should be plenty enough for most songs (we hope). If there’s going to be a bottleneck, it’ll more likely be due to the 12-voice limit. This means the K.O. II can make 12 sounds at once, so if you have six stereo samples playing at one time, you’ll hit that limit. My compositions aren’t interesting enough to hit that threshold, but if you’re a maximalist, then it’s worth keeping in mind.\nA common technique to help avoid hitting the voice limit on other devices is resampling — basically merging separate sounds down into one new sample. This is also the technique for baking in any effects and modulation, which, given that the K.O. II can only manage one master effect at any one time makes the lack of resampling all the more obvious. Understandably, it’s possibly the biggest complaint among users I’ve seen so far (after fadergate of course).\nThere are ways around this, but it would involve recording out into another device and then sampling that back into the K.O. II and no one should have a sampler for their sampler, not in this economy. Teenage Engineering does have a decent track record of adding functionality via firmware updates — the company just added a new effect to the OP-1 Field as I wrote this — so fingers crossed.\nPhoto by James Trew \/ Engadget\nWhile we’re on the topic of features the K.O. II doesn’t have, there doesn’t appear to be any kind of song mode. There are four sample “groups” that you can think of as tracks (drums, bass, lead and so on). Each of these groups can hold up to 99 patterns and patterns can be up to 99 bars in length. The active patterns across the four groups can be saved as a “scene” and scenes can be triggered consecutively. But, importantly, there’s no way for that to happen automatically right now. This means if you wanted to tease a whole recorded song out of the K.O. II you’ll have to either get clever with MIDI or trigger scenes and patterns manually in real time.\nThis performative nature might be a burden for songs, but I found it to be a feature in other areas. On top of the master effects you also have 12 “punch in” effects that can be applied — or punched in — by holding down the FX key and then any of the 12 black pads. Each is marked with its effect name (Level, Pitch and so on). These punch-in effects express themselves differently based on the amount of pressure you apply, making it a very expressive experience. The effects on these keys also correspond to modulation tools when used with the fader. So FX+7 adds the “Level” punch-in effect (rhythmic gating) while Fader+7 will assign gain\/level to the fader until you choose another modulator such as Attack or Low Pass Filter.\nI swear, half of the things you learn about how to use the K.O. II happen by accident. Yes, it’s in the manual, but I discovered you can solo groups by pressing the FX button and the corresponding group. You can also press multiple buttons to “solo” multiple groups or sounds at the same time. With a group or group solo’d you can then apply punch-in effects to create a lot of variations in real time. With so many touches like this, I am starting to assume that Teenage Engineering envisioned the K.O. II as a playful performative device rather than a linear song-making machine.\nPhoto by James Trew \/ Engadget\nI’ve talked before about the sort of “magic” factor that Teenage Engineering sometimes hides into its products. Just small, cute and often a bit hidden features that aren’t necessary but are tons of fun. A common one is the inclusion of FM radio on the OP1\/Field and OB 4 etc. Or the video making tool in the app for the OP-Z. There was a brief moment of excitement when I spotted “loop mode from OB-4” on the K.O. II’s product page. The hope being the two devices would interact somehow, but it appears that’s just a way of describing the looping feature that’s been borrowed from the OB-4.\nAs I write these closing thoughts, the second official firmware update (v1.1.1) has just been released. There’s nothing spicy in here like motion control or sampling the radio, but it’s confirmation of what I mentioned earlier about Teenage Engineering adding features after a product hits the shelves — such as the OP-1 Field’s vocoder synth that landed over six months after release or the fairly substantial 1.2.38 update for the OP-Z which came almost three years into its life.\nThe K.O. II represents an opportunity for Teenage Engineering to do the unthinkable and create a series of more capable instruments that don’t cost Field-series levels of money. As a sampler, it’s great for beginners or those who love a more performative style. It’s not nearly as detailed and in-depth as something like Roland’s SP 404 or Native Instruments’ Maschine, but it was never going to be a rival to, well, anything really. Fadergate aside, this is a promising product from a company that has tested the loyalty of its fans more than usual in recent years.\nAll products recommended by Engadget are selected by our editorial team, independent of our parent company. Some of our stories include affiliate links. If you buy something through one of these links, we may earn an affiliate commission. All prices are correct at the time of publishing.\n\nThis article, authored by James Trew, was published by Engadget on 2023-12-19 under the category 'technology'.\n\n","id":417}
{"title":"Fundamental Investing: The Art of Relative Valuation","context":"## Fundamental Investing: The Art of Relative Valuation\n\nThe PE (price to earnings ratio) of a stock is 18. Is that cheap or expensive? Well, it depends. On what? Many things! Welcome to the world of relative valuation.\nThe findings from research done a decade earlier by Aswath Damodaran indicated that around 85 per cent of valuation done by equity research analysts and 50 per cent of corporate M&A transactions were based on relative valuation. So, what exactly is this relative valuation?\nIt is the art of attempting to determine the fair value of a stock based on how it is valued relative to many factors. So, whether the PE of a stock is 15 or 18 or 30, the only way you can make an assessment of whether it is cheap or expensive is by analysing this one number — against its growth prospects, peer company multiples, industry trading range, historical average PE, the prevailing interest rates, etc.\nPortfolio podcast: The art of valuing stocks Portfolio podcast: The art of valuing stocks\nLet there be no doubt, valuation experts like Aswath Damodaran and many successful hedge fund managers believe that absolute valuation (which we discussed in the Big Story in bl.portfolio edition dated October 8) is the better way to arrive at the value of a stock.\nHowever, due to a combination of complexities involved in building appropriate models, insufficient information, time constraints and also the fact that there are hundreds of stocks you want to consider, it is just not possible to do a DCF ( discounted cash flow model) for all your stock investments, and hence relative valuation as an approach to picking stocks too is well accepted and widely prevalent.\nWhen you decide to buy or sell a stock based on its PE or P\/B or EV\/EBITDA or EV\/Revenue or even EV\/subscriber ratios, you are engaging in the art of relative valuation. And it’s totally fine to be an investor relying on relative valuation to make your savings work for you, provided you approach it the right way and ensure adequate risk management. In relative valuation, the broader you assess the valuation, ie assess valuation multiple against more parameters, the better the perspective you get.\nIn simple words, one way to understand the difference between absolute valuation (explained in last week’s edition) and relative valuation is this – absolute valuation is made up of an interesting story that is backed by credible and validated numbers, while relative valuation is made up of an interesting number backed by a credible and validated story.\nWhat are those numbers in relative valuation? Every number in relative valuation is the result of a number A divided by a number B. For example, PE is price of the stock divided by its earnings. These are all numbers that are used to compare against similar metrics of other stocks and assess the merits of the stock.\nBefore we proceed on using relative valuation to pick stocks, it is important to understand that you can do relative valuation using equity multiples or firm\/enterprise multiples.\nEquity multiples\nIf you check the balance sheet of any company, the liabilities side is primarily made up of two line items — shareholder funds and borrowings. To the contrary, a Profit and Loss statement has many line items — starting with revenue, followed by variable costs and then fixed costs and taxes. The only claim that equity shareholders have for distribution or for appropriation amongst themselves is what is left after paying the taxes — net profit.\nSo, if you are doing relative valuation based on equity multiples, it is important to ensure you divide the equity – ie price per share or market cap of the company by line items that apply to equity shareholders.\nBased on this, there are only 3 items that can be attributed to equity shareholders — net profit from P&L statement, book value or shareholder funds from the Balance Sheet, and the free cash flows to equity (FCFE) from the cash flow statement. Any relative valuation multiples will be linked to these three items one way or the other. Any other metric could be wrong and misleading.\nFor example, price by revenue or price by EBITDA is incorrect. Why? How do you differentiate between two companies A and B — both having same market cap of ₹100 and similar in all means except for debt levels — same revenue (₹100) and same gross margin and same EBITDA margins of 20 per cent and thus same EBITDA of ₹20. But A has zero debt, while B has debt of ₹10. Since revenue or sales and EBITDA are same, if you do a market cap\/revenue or Price \/Sales, or marketcap\/EBITDA, both companies will have the same valuation.\nHowever, let’s assume depreciation is ₹10, interest cost is 10 per cent and taxes are zero. This means the net profit of A is ₹10, while that of B is ₹9. Thus although both companies are similar in terms of Price\/Revenue and Price\/EBITDA, A is cheaper on the PE ratio – ie PE of A is 10 and PE of B is 11.1. On a relative valuation basis, you must choose A instead of B, but you would not have spotted it if you had used incorrect metrics.\nHence it’s very important to use the right multiples. When it comes to equity metrics, it always has to be price or market cap (or variations of the same) in numerator divided by line items attributable to equity holders (or variations of the same)\nThe accompanying table gives the commonly used equity multiples for relative valuation.\nOnce the metrics and importance are understood, there are, as such, no limits to how you can use them to pick stocks. You can use one or two metrics or a combination of many more metrics to assess which stocks are undervalued or overvalued.\nDepending on specific cases, you can use further variations to pick stocks. For example, during the 2003-2007 bull market, many textile stocks, for instance, Bombay Dyeing, turned out to be multibaggers. Was their textile business booming? Not really. But the stocks were zooming because there was real estate boom and many textile mills had manufacturing facilities in prime real estate locations. So the markets started to factor value of the company based on market value of their land. In such a case you can deviate from Price\/Book multiple to price\/market value of net assets (assets – net debt).\nSimilar is the case with holding companies. If you think there is a reasonable case for underlying value of assets to be unlocked and Holdco discount to shrink, like it has happened in bank holding companies in the last 2-3 years, then there is a case to move beyond book value to market value.\nEnterprise value multiples\nEnterprise value refers to total value of a company\/business. This total value as perceived by the market is represented by the sum of its market cap + net debt (includes minority interest). What works in the case of EV is that it helps in doing a capital-agnostic analysis of a company. Whether a company is funded only with equity, or a combination of equity and debt, the total value of the business is the same. Sources of funding don’t matter.\nUsing EV, the value of equity (share price) is derived from the value of the business. Since the capital structure of companies varies significantly, an EV approach enables valuing them on similar terms. One can arrive at the value of the business first and then subtract net debt, to arrive at the equity value. The advantage with EV-based metrics is that you have more options to value a company.\nBear in mind, valuation accuracy is better the lower down the P&L and cash flow statement one can get to. But there are many times when company profits are low, but its operational performance ie EBITDA is not bad. In such cases, as revenue and EBITDA continue to grow, operating leverage will result in PE growing much faster than the above two line items.\nFor example, take the case of Bharti Airtel: at the start of FY22 (April ‘21) its trailing PE was negative\/invalid due to losses in FY21. The stock would have been avoided if one went by PE alone. However, on trailing EV\/EBITDA basis, it was trading at 10 times EV\/EBITDA. When this was considered against its estimated next 2 years EBITDA CAGR of over 20 per cent, the valuation, combined with qualitative factors, made it an interesting buy. Since then, net profits have improved substantially as operating leverage played out.\nAt bl.portfolio we had recommended a buy on the stock based on this in April 2021 and the stock has returned 80 per cent since. The stock would have been easily missed if PE was the metric used to spot the performers.\nHence EV-based metrics are options to consider as well when equity-based valuation multiples do not give a clear picture. Where even EBITDA multiples are not clear, as was the case with many new-age company IPOs that were reporting losses even at the EBITDA level, investors have no option but to go further up the P&L to metrics like EV\/revenue, or even outside of P&L to use metrics like EV\/subscriber.\nAs we mentioned earlier, relative valuation represents a number backed by a credible and well-validated story. Hence, you can use non-P&L multiples. So when you compare companies and invest in one based on EV\/Subscriber, there must be a credible story backing future monetisation of the subscriber in a profitable manner. But do bear in mind, the risks are higher and so may be the rewards or pain as the case may be. When the risks are higher, you must apply a higher margin of safety before choosing the stock.\nAnother thing to bear in mind when it comes to EV-based valuation — any change in EV will impact only the equity value. For example, if EV of a company is ₹100 and it has ₹50 in debt, then the value of its equity is ₹50. In this case, if you think EV can increase by 10 per cent, the value of equity will increase by 20 per cent, and the reverse is also true. The higher the leverage, more the impact of change in EV on the value of the stock (both ways).\nKeep a weather eye on Ketchup Economics\nGiven the fact that relative valuation is based on comparison with peer multiples, investors must take measures to check whether the peer multiples are reasonable as well. An overvalued peer cannot be used to justify expensive valuation in one stock. This is what economist Larry Summers termed as Ketchup economists\/economics. It was his sarcastic take on some of the highly paid economists and finance professionals who are concerned only with inter-relationships between prices of different financial assets. Based on this approach, they conclude whether the price of an asset independently is efficient or not. If two bottles of ketchup sell for twice as much as one bottle (except for minor differences traceable to transaction costs), the market is efficient.\nThe risk in this – it ignores the aspect of whether one bottle of ketchup is priced rationally. Nobel Laureate Paul Krugman once explained how the US housing bubble that precipitated the global financial crisis reminded him of ketchup economists. Before purchasing a house during the bubble, buyers carefully compared prices with ‘prices of other houses’, but ignored whether the overall level of a home price made sense.\nHow to avoid pitfalls\nSo, what can you do to avoid pitfalls while using relative valuation? Here are a few pointers.\nOne, after comparing stocks based on relative valuation, you can do more layers of comparison by assessing how their valuation fares relative to growth prospects. This apart, many other factors can justify different valuations. For example, TCS has always commanded a valuation premium to peer stocks like Infosys, Wipro and HCLTech because of its superior margins and much more consistent growth. So just because the other stocks are cheaper on PE basis does not mean they are cheap compared to TCS. So you can also do one more layer of comparison by assessing each company’s valuation against its long-term (5-10 years) mean and median valuations and assess how they fare relative to their own history.\nTwo, equity valuations do not function in a silo. Investors have many options — fixed deposits, bonds, real estate, etc. When other assets get more attractive one must assess scope for valuation change in equities as well. For example, interest rates and bond yields in many developed markets, including the US, are at their highest levels since 2007. This means investors may have to assess current valuations not just against last 10 years’ valuations, but of prior periods as well.\nWhy? Near zero interest rates and low bond yields made stocks with earnings yield of mere 1-2 per cent attractive for an FPI — for example stocks such as Asian Paints, Nestle India and ABB India which today trade at PE of 65, 83 and 85 times respectively. This implies earnings yield of 1.5 per cent for Asian Paints and 1.2 per cent for Nestle and ABB. Such earnings yields of these stocks were fine for FPIs to hold when compared to zero interest income in their domestic market. But now, with US bond yields offering 5 per cent, these may not be so attractive even when considering the growth prospects. While Indian interest rates were always higher, investors in equities benefited from the global investors’ hunger for yields. That advantage is diminishing today. This is not a recommendation on the stocks, but pointers on factors to consider to make your relative valuation process more foolproof.\nWith discipline and experience, the process will keep getting better.\n\nThis article was published by Business Line on 2023-10-14 under the category 'business'.\n\n","id":418}
{"title":"Taylor Swift has already sold over $100 million of tickets for her concert movie. Theaters nationwide brace for impact","context":"## Taylor Swift has already sold over $100 million of tickets for her concert movie. Theaters nationwide brace for impact\n\nGreg Marcus has been in the movie business for years but he never expected to be urging moviegoers to take out their phones during a film — let alone to be crafting friendship bracelets in preparation for an opening weekend.\nBut there the chief executive and chair of the Marcus Corporation is in a promotion for his theater chain headquartered in Milwaukee, Wisconsin, stringing beads together while humming “Shake It Off.”\nMovie theaters are readying for an onslaught like they’ve never seen before, beginning Friday when “Taylor Swift: The Eras Tour” debuts. The concert film, compiled from several Swift shows at Southern California’s SoFi Stadium, is expected to launch with $100 million, or possibly more. Advance ticket sales worldwide have already surpassed $100 million.\nSwifties will descend. Dancing will be encouraged.\n“This is different,” says Marcus. “Take your phone out. Take selfies. Dance, sing, get up, have a good time. We want to create an atmosphere.”\nConcert films, of course, aren’t anything new. Just last month, the Talking Heads classic “Stop Making Sense” returned to theaters for a decades-later encore. But “The Eras Tour” heralds something new and potentially game-changing in the movie industry.\nTwo of the biggest stars on the planet — Swift and , in December under a very similar arrangement, Beyoncé — are heading into cinemas in first-of-their-kind deals made directly with AMC Theaters that circumvent Hollywood studios and which, for now, leave streamers waiting on the sidelines.\nBut how did the once declared-for-dead multiplex become the go-to place this fall a pair of stars previously at home on Netflix?\nWhen studios began diverting some of their titles to streaming platforms, movie theaters began thinking harder about how they could fill their screens — a question exacerbated this autumn by an actors strike that’s led to the postponement of big releases like “Dune: Part Two.”\nMovie theaters are increasingly not just a marquee of movie showtimes but a big-screen stage for a variety of visual media. BTS earlier this year released a concert film, with higher ticket prices and limited showtimes. The Metropolitan Opera has for years done popular live broadcasts in theaters.\nFew acts can do what Swift and Beyoncé can. Their expected success is unlikely to be replicated. But “The Eras Tour” could be the start of an expansion of what, exactly, a movie theater can be. Think the Sphere, only much cheaper and in most towns.\n“You could say we’re in the movie business, but really we’re in the getting-together-with-other-people business,” says Marcus. “The more we do of it, the more the customers will think about it and the more talent will go: This is something I could do.”\nSwift’s camp was motivated to get the film out even as her stadium tour continues internationally. The tour, which is projected by Pollstar to gross some $1.4 billion, crashed Ticketmaster’s site, saw sky-high resale mark-ups and left many fans priced out.\nThe movie, directed by Sam Wrench, would be a way for millions more to experience the Eras Tour. Adult tickets are being sold for $19.89, a reference to her birth year and 2014 album, a re-recording of which is due out Oct. 27. That’s higher than the average movie ticket but several thousand less than many tickets to see Swift live.\nIt’s arriving uncommonly fast, too, just a little over two months since the SoFi shows. Speed was one reason Swift’s father, Scott Swift, is said to have sought out a direct deal with AMC. Swift produced the film, herself, and, with 274 million followers on Instagram, didn’t need a studio to promote it.\nThe pop star’s apparent relationship with Kansas City Chiefs tight end Travis Kelce has only further brightened the spotlight on the movie. According to ad tracking firm iSpot, TV ads for the film ran only a few dozen times as of Oct. 6, including several spots during NFL broadcasts. (A Marvel movie, by comparison, might run several thousand TV commercials.)\nTicket sales will be split 43% with theaters and 57% shared by Swift and AMC — with the lion’s share of that going to Swift. The film will play exclusively in theaters for at least 13 weeks — longer than many Hollywood releases do now. AMC CEO Adam Aron has called the deal “a coup for AMC” on social media.\nBoth AMC and representatives for Swift declined to discuss the film’s release.\nAfter a premiere in Los Angeles on Wednesday, there won’t be any advance screenings until the movie begins playing at 6 p.m. local time Friday. Most wide-release movies open with Thursday showings and Friday daytime screenings. It’s another wrinkle in a nontraditional release that’s challenging Hollywood norms.\n“Innovation comes out of challenging times in this business. We’re seeing a lot of changes, some subtle, some not so subtle,” says Paul Dergarabedian, senior media analyst for data firm Comscore. “It seems like, right now, there are no rules when it comes to being successful.”\nDergarabedian believes the two concert films should help lift the North American box office to more than $9 billion in 2023, up from the $7.4 billion of last year and edging closer to the $11.4 billion of 2019.\n“It really opens up the idea that other types of content can play really well in a movie theater,” he says.\nSome of those changes have been facilitated by the abolishment of long-held antitrust restrictions governing movie distribution. After more than 70 years of regulating divisions between exhibition and distribution, the Paramount consent decrees were terminated in 2020 at the urging of the Department of Justice, with a two-year sunset period that ran until last year.\n“Innovation had effectively been stunted,” says Makan Delrahim, the former antitrust chief at the Justice Department who proposed ending the consent decrees.\nDelrahim believes “Taylor Swift: The Eras Tour” — as a movie distributed by a theater chain, with nontraditional ticket prices — could “fuel new business models to save the exhibitors.”\n“There will be more appetite to experiment different models for theatrical distribution,” Delrahim says. “The industry needs it and, frankly, so do consumers.”\nMeanwhile, “Taylor Swift: The Eras Tour” is poised to become the biggest concert film ever in about two days of release. Not accounting for inflation, 2011’s “Justin Bieber: Never Say Never” holds that mark with $73.1 million across its entire run. Accounting for inflation, it will be harder for “The Eras Tour” to catch “Woodstock,” which grossed $50 million in 1970, a total that translates to nearly $400 million today.\nIn Marcus’ theaters, like many other chains, there will be friendship bracelet stations. Sound systems have been modified for more of a concert feel. And while Marcus grants it will be strange to see an AMC logo before a film playing in his theaters, he doesn’t particularly mind.\n“I’m just happy it’s there,” he says.\n\nThis article, authored by Jake Coyle, The Associated Press, was published by Fortune on 2023-10-10 under the category 'business'.\n\n","id":419}